grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#pragma once 

/* --- GFXMMU: Graphic MMU ------------------------------------------ */

/** @defgroup gfxmmu_registers Graphic MMU Register
@{*/

/** GFXMMU_CR Graphic MMU configuration register **/
#define GFXMMU_CR			MMIO32(GFXMMU_BASE + 0x00)
/** GFXMMU_SR Graphic MMU status register **/
#define GFXMMU_SR			MMIO32(GFXMMU_BASE + 0x04)
/** GFXMMU_FCR Graphic MMU flag clear register **/
#define GFXMMU_FCR			MMIO32(GFXMMU_BASE + 0x08)
/** GFXMMU_DVR Graphic MMU default value register **/
#define GFXMMU_DVR			MMIO32(GFXMMU_BASE + 0x10)
/** GFXMMU_B0CR Graphic MMU buffer 0 configuration register **/
#define GFXMMU_B0CR			MMIO32(GFXMMU_BASE + 0x20)
/** GFXMMU_B1CR Graphic MMU buffer 1 configuration register **/
#define GFXMMU_B1CR			MMIO32(GFXMMU_BASE + 0x24)
/** GFXMMU_B2CR Graphic MMU buffer 2 configuration register **/
#define GFXMMU_B2CR			MMIO32(GFXMMU_BASE + 0x28)
/** GFXMMU_B3CR Graphic MMU buffer 3 configuration register **/
#define GFXMMU_B3CR			MMIO32(GFXMMU_BASE + 0x2c)
/** GFXMMU_VERR Graphic MMU version register **/
#define GFXMMU_VERR			MMIO32(GFXMMU_BASE + 0xff4)
/** GFXMMU_IPIDR Graphic MMU identification register **/
#define GFXMMU_IPIDR			MMIO32(GFXMMU_BASE + 0xff8)
/** GFXMMU_SIDR Graphic MMU size identification register **/
#define GFXMMU_SIDR			MMIO32(GFXMMU_BASE + 0xffc)
/** GFXMMU_LUT0L Graphic MMU LUT entry 0 low **/
#define GFXMMU_LUT0L			MMIO32(GFXMMU_BASE + 0x1000)
/** GFXMMU_LUT0H Graphic MMU LUT entry 0 high **/
#define GFXMMU_LUT0H			MMIO32(GFXMMU_BASE + 0x1004)
/** GFXMMU_LUT1L Graphic MMU LUT entry 1 low **/
#define GFXMMU_LUT1L			MMIO32(GFXMMU_BASE + 0x1008)
/** GFXMMU_LUT1H Graphic MMU LUT entry 1 high **/
#define GFXMMU_LUT1H			MMIO32(GFXMMU_BASE + 0x100c)
/** GFXMMU_LUT2L Graphic MMU LUT entry 2 low **/
#define GFXMMU_LUT2L			MMIO32(GFXMMU_BASE + 0x1010)
/** GFXMMU_LUT2H Graphic MMU LUT entry 2 high **/
#define GFXMMU_LUT2H			MMIO32(GFXMMU_BASE + 0x1014)
/** GFXMMU_LUT3L Graphic MMU LUT entry 3 low **/
#define GFXMMU_LUT3L			MMIO32(GFXMMU_BASE + 0x1018)
/** GFXMMU_LUT3H Graphic MMU LUT entry 3 high **/
#define GFXMMU_LUT3H			MMIO32(GFXMMU_BASE + 0x101c)
/** GFXMMU_LUT4L Graphic MMU LUT entry 4 low **/
#define GFXMMU_LUT4L			MMIO32(GFXMMU_BASE + 0x1020)
/** GFXMMU_LUT4H Graphic MMU LUT entry 4 high **/
#define GFXMMU_LUT4H			MMIO32(GFXMMU_BASE + 0x1024)
/** GFXMMU_LUT5L Graphic MMU LUT entry 5 low **/
#define GFXMMU_LUT5L			MMIO32(GFXMMU_BASE + 0x1028)
/** GFXMMU_LUT5H Graphic MMU LUT entry 5 high **/
#define GFXMMU_LUT5H			MMIO32(GFXMMU_BASE + 0x102c)
/** GFXMMU_LUT6L Graphic MMU LUT entry 6 low **/
#define GFXMMU_LUT6L			MMIO32(GFXMMU_BASE + 0x1030)
/** GFXMMU_LUT6H Graphic MMU LUT entry 6 high **/
#define GFXMMU_LUT6H			MMIO32(GFXMMU_BASE + 0x1034)
/** GFXMMU_LUT7L Graphic MMU LUT entry 7 low **/
#define GFXMMU_LUT7L			MMIO32(GFXMMU_BASE + 0x1038)
/** GFXMMU_LUT7H Graphic MMU LUT entry 7 high **/
#define GFXMMU_LUT7H			MMIO32(GFXMMU_BASE + 0x103c)
/** GFXMMU_LUT8L Graphic MMU LUT entry 8 low **/
#define GFXMMU_LUT8L			MMIO32(GFXMMU_BASE + 0x1040)
/** GFXMMU_LUT8H Graphic MMU LUT entry 8 high **/
#define GFXMMU_LUT8H			MMIO32(GFXMMU_BASE + 0x1044)
/** GFXMMU_LUT9L Graphic MMU LUT entry 9 low **/
#define GFXMMU_LUT9L			MMIO32(GFXMMU_BASE + 0x1048)
/** GFXMMU_LUT9H Graphic MMU LUT entry 9 high **/
#define GFXMMU_LUT9H			MMIO32(GFXMMU_BASE + 0x104c)
/** GFXMMU_LUT10L Graphic MMU LUT entry 10 low **/
#define GFXMMU_LUT10L			MMIO32(GFXMMU_BASE + 0x1050)
/** GFXMMU_LUT10H Graphic MMU LUT entry 10 high **/
#define GFXMMU_LUT10H			MMIO32(GFXMMU_BASE + 0x1054)
/** GFXMMU_LUT11L Graphic MMU LUT entry 11 low **/
#define GFXMMU_LUT11L			MMIO32(GFXMMU_BASE + 0x1058)
/** GFXMMU_LUT11H Graphic MMU LUT entry 11 high **/
#define GFXMMU_LUT11H			MMIO32(GFXMMU_BASE + 0x105c)
/** GFXMMU_LUT12L Graphic MMU LUT entry 12 low **/
#define GFXMMU_LUT12L			MMIO32(GFXMMU_BASE + 0x1060)
/** GFXMMU_LUT12H Graphic MMU LUT entry 12 high **/
#define GFXMMU_LUT12H			MMIO32(GFXMMU_BASE + 0x1064)
/** GFXMMU_LUT13L Graphic MMU LUT entry 13 low **/
#define GFXMMU_LUT13L			MMIO32(GFXMMU_BASE + 0x1068)
/** GFXMMU_LUT13H Graphic MMU LUT entry 13 high **/
#define GFXMMU_LUT13H			MMIO32(GFXMMU_BASE + 0x106c)
/** GFXMMU_LUT14L Graphic MMU LUT entry 14 low **/
#define GFXMMU_LUT14L			MMIO32(GFXMMU_BASE + 0x1070)
/** GFXMMU_LUT14H Graphic MMU LUT entry 14 high **/
#define GFXMMU_LUT14H			MMIO32(GFXMMU_BASE + 0x1074)
/** GFXMMU_LUT15L Graphic MMU LUT entry 15 low **/
#define GFXMMU_LUT15L			MMIO32(GFXMMU_BASE + 0x1078)
/** GFXMMU_LUT15H Graphic MMU LUT entry 15 high **/
#define GFXMMU_LUT15H			MMIO32(GFXMMU_BASE + 0x107c)
/** GFXMMU_LUT16L Graphic MMU LUT entry 16 low **/
#define GFXMMU_LUT16L			MMIO32(GFXMMU_BASE + 0x1080)
/** GFXMMU_LUT16H Graphic MMU LUT entry 16 high **/
#define GFXMMU_LUT16H			MMIO32(GFXMMU_BASE + 0x1084)
/** GFXMMU_LUT17L Graphic MMU LUT entry 17 low **/
#define GFXMMU_LUT17L			MMIO32(GFXMMU_BASE + 0x1088)
/** GFXMMU_LUT17H Graphic MMU LUT entry 17 high **/
#define GFXMMU_LUT17H			MMIO32(GFXMMU_BASE + 0x108c)
/** GFXMMU_LUT18L Graphic MMU LUT entry 18 low **/
#define GFXMMU_LUT18L			MMIO32(GFXMMU_BASE + 0x1090)
/** GFXMMU_LUT18H Graphic MMU LUT entry 18 high **/
#define GFXMMU_LUT18H			MMIO32(GFXMMU_BASE + 0x1094)
/** GFXMMU_LUT19L Graphic MMU LUT entry 19 low **/
#define GFXMMU_LUT19L			MMIO32(GFXMMU_BASE + 0x1098)
/** GFXMMU_LUT19H Graphic MMU LUT entry 19 high **/
#define GFXMMU_LUT19H			MMIO32(GFXMMU_BASE + 0x109c)
/** GFXMMU_LUT20L Graphic MMU LUT entry 20 low **/
#define GFXMMU_LUT20L			MMIO32(GFXMMU_BASE + 0x10a0)
/** GFXMMU_LUT20H Graphic MMU LUT entry 20 high **/
#define GFXMMU_LUT20H			MMIO32(GFXMMU_BASE + 0x10a4)
/** GFXMMU_LUT21L Graphic MMU LUT entry 21 low **/
#define GFXMMU_LUT21L			MMIO32(GFXMMU_BASE + 0x10a8)
/** GFXMMU_LUT21H Graphic MMU LUT entry 21 high **/
#define GFXMMU_LUT21H			MMIO32(GFXMMU_BASE + 0x10ac)
/** GFXMMU_LUT22L Graphic MMU LUT entry 22 low **/
#define GFXMMU_LUT22L			MMIO32(GFXMMU_BASE + 0x10b0)
/** GFXMMU_LUT22H Graphic MMU LUT entry 22 high **/
#define GFXMMU_LUT22H			MMIO32(GFXMMU_BASE + 0x10b4)
/** GFXMMU_LUT23L Graphic MMU LUT entry 23 low **/
#define GFXMMU_LUT23L			MMIO32(GFXMMU_BASE + 0x10b8)
/** GFXMMU_LUT23H Graphic MMU LUT entry 23 high **/
#define GFXMMU_LUT23H			MMIO32(GFXMMU_BASE + 0x10bc)
/** GFXMMU_LUT24L Graphic MMU LUT entry 24 low **/
#define GFXMMU_LUT24L			MMIO32(GFXMMU_BASE + 0x10c0)
/** GFXMMU_LUT24H Graphic MMU LUT entry 24 high **/
#define GFXMMU_LUT24H			MMIO32(GFXMMU_BASE + 0x10c4)
/** GFXMMU_LUT25L Graphic MMU LUT entry 25 low **/
#define GFXMMU_LUT25L			MMIO32(GFXMMU_BASE + 0x10c8)
/** GFXMMU_LUT25H Graphic MMU LUT entry 25 high **/
#define GFXMMU_LUT25H			MMIO32(GFXMMU_BASE + 0x10cc)
/** GFXMMU_LUT26L Graphic MMU LUT entry 26 low **/
#define GFXMMU_LUT26L			MMIO32(GFXMMU_BASE + 0x10d0)
/** GFXMMU_LUT26H Graphic MMU LUT entry 26 high **/
#define GFXMMU_LUT26H			MMIO32(GFXMMU_BASE + 0x10d4)
/** GFXMMU_LUT27L Graphic MMU LUT entry 27 low **/
#define GFXMMU_LUT27L			MMIO32(GFXMMU_BASE + 0x10d8)
/** GFXMMU_LUT27H Graphic MMU LUT entry 27 high **/
#define GFXMMU_LUT27H			MMIO32(GFXMMU_BASE + 0x10dc)
/** GFXMMU_LUT28L Graphic MMU LUT entry 28 low **/
#define GFXMMU_LUT28L			MMIO32(GFXMMU_BASE + 0x10e0)
/** GFXMMU_LUT28H Graphic MMU LUT entry 28 high **/
#define GFXMMU_LUT28H			MMIO32(GFXMMU_BASE + 0x10e4)
/** GFXMMU_LUT29L Graphic MMU LUT entry 29 low **/
#define GFXMMU_LUT29L			MMIO32(GFXMMU_BASE + 0x10e8)
/** GFXMMU_LUT29H Graphic MMU LUT entry 29 high **/
#define GFXMMU_LUT29H			MMIO32(GFXMMU_BASE + 0x10ec)
/** GFXMMU_LUT30L Graphic MMU LUT entry 30 low **/
#define GFXMMU_LUT30L			MMIO32(GFXMMU_BASE + 0x10f0)
/** GFXMMU_LUT30H Graphic MMU LUT entry 30 high **/
#define GFXMMU_LUT30H			MMIO32(GFXMMU_BASE + 0x10f4)
/** GFXMMU_LUT31L Graphic MMU LUT entry 31 low **/
#define GFXMMU_LUT31L			MMIO32(GFXMMU_BASE + 0x10f8)
/** GFXMMU_LUT31H Graphic MMU LUT entry 31 high **/
#define GFXMMU_LUT31H			MMIO32(GFXMMU_BASE + 0x10fc)
/** GFXMMU_LUT32L Graphic MMU LUT entry 32 low **/
#define GFXMMU_LUT32L			MMIO32(GFXMMU_BASE + 0x1100)
/** GFXMMU_LUT32H Graphic MMU LUT entry 32 high **/
#define GFXMMU_LUT32H			MMIO32(GFXMMU_BASE + 0x1104)
/** GFXMMU_LUT33L Graphic MMU LUT entry 33 low **/
#define GFXMMU_LUT33L			MMIO32(GFXMMU_BASE + 0x1108)
/** GFXMMU_LUT33H Graphic MMU LUT entry 33 high **/
#define GFXMMU_LUT33H			MMIO32(GFXMMU_BASE + 0x110c)
/** GFXMMU_LUT34L Graphic MMU LUT entry 34 low **/
#define GFXMMU_LUT34L			MMIO32(GFXMMU_BASE + 0x1110)
/** GFXMMU_LUT34H Graphic MMU LUT entry 34 high **/
#define GFXMMU_LUT34H			MMIO32(GFXMMU_BASE + 0x1114)
/** GFXMMU_LUT35L Graphic MMU LUT entry 35 low **/
#define GFXMMU_LUT35L			MMIO32(GFXMMU_BASE + 0x1118)
/** GFXMMU_LUT35H Graphic MMU LUT entry 35 high **/
#define GFXMMU_LUT35H			MMIO32(GFXMMU_BASE + 0x111c)
/** GFXMMU_LUT36L Graphic MMU LUT entry 36 low **/
#define GFXMMU_LUT36L			MMIO32(GFXMMU_BASE + 0x1120)
/** GFXMMU_LUT36H Graphic MMU LUT entry 36 high **/
#define GFXMMU_LUT36H			MMIO32(GFXMMU_BASE + 0x1124)
/** GFXMMU_LUT37L Graphic MMU LUT entry 37 low **/
#define GFXMMU_LUT37L			MMIO32(GFXMMU_BASE + 0x1128)
/** GFXMMU_LUT37H Graphic MMU LUT entry 37 high **/
#define GFXMMU_LUT37H			MMIO32(GFXMMU_BASE + 0x112c)
/** GFXMMU_LUT38L Graphic MMU LUT entry 38 low **/
#define GFXMMU_LUT38L			MMIO32(GFXMMU_BASE + 0x1130)
/** GFXMMU_LUT38H Graphic MMU LUT entry 38 high **/
#define GFXMMU_LUT38H			MMIO32(GFXMMU_BASE + 0x1134)
/** GFXMMU_LUT39L Graphic MMU LUT entry 39 low **/
#define GFXMMU_LUT39L			MMIO32(GFXMMU_BASE + 0x1138)
/** GFXMMU_LUT39H Graphic MMU LUT entry 39 high **/
#define GFXMMU_LUT39H			MMIO32(GFXMMU_BASE + 0x113c)
/** GFXMMU_LUT40L Graphic MMU LUT entry 40 low **/
#define GFXMMU_LUT40L			MMIO32(GFXMMU_BASE + 0x1140)
/** GFXMMU_LUT40H Graphic MMU LUT entry 40 high **/
#define GFXMMU_LUT40H			MMIO32(GFXMMU_BASE + 0x1144)
/** GFXMMU_LUT41L Graphic MMU LUT entry 41 low **/
#define GFXMMU_LUT41L			MMIO32(GFXMMU_BASE + 0x1148)
/** GFXMMU_LUT41H Graphic MMU LUT entry 41 high **/
#define GFXMMU_LUT41H			MMIO32(GFXMMU_BASE + 0x114c)
/** GFXMMU_LUT42L Graphic MMU LUT entry 42 low **/
#define GFXMMU_LUT42L			MMIO32(GFXMMU_BASE + 0x1150)
/** GFXMMU_LUT42H Graphic MMU LUT entry 42 high **/
#define GFXMMU_LUT42H			MMIO32(GFXMMU_BASE + 0x1154)
/** GFXMMU_LUT43L Graphic MMU LUT entry 43 low **/
#define GFXMMU_LUT43L			MMIO32(GFXMMU_BASE + 0x1158)
/** GFXMMU_LUT43H Graphic MMU LUT entry 43 high **/
#define GFXMMU_LUT43H			MMIO32(GFXMMU_BASE + 0x115c)
/** GFXMMU_LUT44L Graphic MMU LUT entry 44 low **/
#define GFXMMU_LUT44L			MMIO32(GFXMMU_BASE + 0x1160)
/** GFXMMU_LUT44H Graphic MMU LUT entry 44 high **/
#define GFXMMU_LUT44H			MMIO32(GFXMMU_BASE + 0x1164)
/** GFXMMU_LUT45L Graphic MMU LUT entry 45 low **/
#define GFXMMU_LUT45L			MMIO32(GFXMMU_BASE + 0x1168)
/** GFXMMU_LUT45H Graphic MMU LUT entry 45 high **/
#define GFXMMU_LUT45H			MMIO32(GFXMMU_BASE + 0x116c)
/** GFXMMU_LUT46L Graphic MMU LUT entry 46 low **/
#define GFXMMU_LUT46L			MMIO32(GFXMMU_BASE + 0x1170)
/** GFXMMU_LUT46H Graphic MMU LUT entry 46 high **/
#define GFXMMU_LUT46H			MMIO32(GFXMMU_BASE + 0x1174)
/** GFXMMU_LUT47L Graphic MMU LUT entry 47 low **/
#define GFXMMU_LUT47L			MMIO32(GFXMMU_BASE + 0x1178)
/** GFXMMU_LUT47H Graphic MMU LUT entry 47 high **/
#define GFXMMU_LUT47H			MMIO32(GFXMMU_BASE + 0x117c)
/** GFXMMU_LUT48L Graphic MMU LUT entry 48 low **/
#define GFXMMU_LUT48L			MMIO32(GFXMMU_BASE + 0x1180)
/** GFXMMU_LUT48H Graphic MMU LUT entry 48 high **/
#define GFXMMU_LUT48H			MMIO32(GFXMMU_BASE + 0x1184)
/** GFXMMU_LUT49L Graphic MMU LUT entry 49 low **/
#define GFXMMU_LUT49L			MMIO32(GFXMMU_BASE + 0x1188)
/** GFXMMU_LUT49H Graphic MMU LUT entry 49 high **/
#define GFXMMU_LUT49H			MMIO32(GFXMMU_BASE + 0x118c)
/** GFXMMU_LUT50L Graphic MMU LUT entry 50 low **/
#define GFXMMU_LUT50L			MMIO32(GFXMMU_BASE + 0x1190)
/** GFXMMU_LUT50H Graphic MMU LUT entry 50 high **/
#define GFXMMU_LUT50H			MMIO32(GFXMMU_BASE + 0x1194)
/** GFXMMU_LUT51L Graphic MMU LUT entry 51 low **/
#define GFXMMU_LUT51L			MMIO32(GFXMMU_BASE + 0x1198)
/** GFXMMU_LUT51H Graphic MMU LUT entry 51 high **/
#define GFXMMU_LUT51H			MMIO32(GFXMMU_BASE + 0x119c)
/** GFXMMU_LUT52L Graphic MMU LUT entry 52 low **/
#define GFXMMU_LUT52L			MMIO32(GFXMMU_BASE + 0x11a0)
/** GFXMMU_LUT52H Graphic MMU LUT entry 52 high **/
#define GFXMMU_LUT52H			MMIO32(GFXMMU_BASE + 0x11a4)
/** GFXMMU_LUT53L Graphic MMU LUT entry 53 low **/
#define GFXMMU_LUT53L			MMIO32(GFXMMU_BASE + 0x11a8)
/** GFXMMU_LUT53H Graphic MMU LUT entry 53 high **/
#define GFXMMU_LUT53H			MMIO32(GFXMMU_BASE + 0x11ac)
/** GFXMMU_LUT54L Graphic MMU LUT entry 54 low **/
#define GFXMMU_LUT54L			MMIO32(GFXMMU_BASE + 0x11b0)
/** GFXMMU_LUT54H Graphic MMU LUT entry 54 high **/
#define GFXMMU_LUT54H			MMIO32(GFXMMU_BASE + 0x11b4)
/** GFXMMU_LUT55L Graphic MMU LUT entry 55 low **/
#define GFXMMU_LUT55L			MMIO32(GFXMMU_BASE + 0x11b8)
/** GFXMMU_LUT55H Graphic MMU LUT entry 55 high **/
#define GFXMMU_LUT55H			MMIO32(GFXMMU_BASE + 0x11bc)
/** GFXMMU_LUT56L Graphic MMU LUT entry 56 low **/
#define GFXMMU_LUT56L			MMIO32(GFXMMU_BASE + 0x11c0)
/** GFXMMU_LUT56H Graphic MMU LUT entry 56 high **/
#define GFXMMU_LUT56H			MMIO32(GFXMMU_BASE + 0x11c4)
/** GFXMMU_LUT57L Graphic MMU LUT entry 57 low **/
#define GFXMMU_LUT57L			MMIO32(GFXMMU_BASE + 0x11c8)
/** GFXMMU_LUT57H Graphic MMU LUT entry 57 high **/
#define GFXMMU_LUT57H			MMIO32(GFXMMU_BASE + 0x11cc)
/** GFXMMU_LUT58L Graphic MMU LUT entry 58 low **/
#define GFXMMU_LUT58L			MMIO32(GFXMMU_BASE + 0x11d0)
/** GFXMMU_LUT58H Graphic MMU LUT entry 58 high **/
#define GFXMMU_LUT58H			MMIO32(GFXMMU_BASE + 0x11d4)
/** GFXMMU_LUT59L Graphic MMU LUT entry 59 low **/
#define GFXMMU_LUT59L			MMIO32(GFXMMU_BASE + 0x11d8)
/** GFXMMU_LUT59H Graphic MMU LUT entry 59 high **/
#define GFXMMU_LUT59H			MMIO32(GFXMMU_BASE + 0x11dc)
/** GFXMMU_LUT60L Graphic MMU LUT entry 60 low **/
#define GFXMMU_LUT60L			MMIO32(GFXMMU_BASE + 0x11e0)
/** GFXMMU_LUT60H Graphic MMU LUT entry 60 high **/
#define GFXMMU_LUT60H			MMIO32(GFXMMU_BASE + 0x11e4)
/** GFXMMU_LUT61L Graphic MMU LUT entry 61 low **/
#define GFXMMU_LUT61L			MMIO32(GFXMMU_BASE + 0x11e8)
/** GFXMMU_LUT61H Graphic MMU LUT entry 61 high **/
#define GFXMMU_LUT61H			MMIO32(GFXMMU_BASE + 0x11ec)
/** GFXMMU_LUT62L Graphic MMU LUT entry 62 low **/
#define GFXMMU_LUT62L			MMIO32(GFXMMU_BASE + 0x11f0)
/** GFXMMU_LUT62H Graphic MMU LUT entry 62 high **/
#define GFXMMU_LUT62H			MMIO32(GFXMMU_BASE + 0x11f4)
/** GFXMMU_LUT63L Graphic MMU LUT entry 63 low **/
#define GFXMMU_LUT63L			MMIO32(GFXMMU_BASE + 0x11f8)
/** GFXMMU_LUT63H Graphic MMU LUT entry 63 high **/
#define GFXMMU_LUT63H			MMIO32(GFXMMU_BASE + 0x11fc)
/** GFXMMU_LUT64L Graphic MMU LUT entry 64 low **/
#define GFXMMU_LUT64L			MMIO32(GFXMMU_BASE + 0x1200)
/** GFXMMU_LUT64H Graphic MMU LUT entry 64 high **/
#define GFXMMU_LUT64H			MMIO32(GFXMMU_BASE + 0x1204)
/** GFXMMU_LUT65L Graphic MMU LUT entry 65 low **/
#define GFXMMU_LUT65L			MMIO32(GFXMMU_BASE + 0x1208)
/** GFXMMU_LUT65H Graphic MMU LUT entry 65 high **/
#define GFXMMU_LUT65H			MMIO32(GFXMMU_BASE + 0x120c)
/** GFXMMU_LUT66L Graphic MMU LUT entry 66 low **/
#define GFXMMU_LUT66L			MMIO32(GFXMMU_BASE + 0x1210)
/** GFXMMU_LUT66H Graphic MMU LUT entry 66 high **/
#define GFXMMU_LUT66H			MMIO32(GFXMMU_BASE + 0x1214)
/** GFXMMU_LUT67L Graphic MMU LUT entry 67 low **/
#define GFXMMU_LUT67L			MMIO32(GFXMMU_BASE + 0x1218)
/** GFXMMU_LUT67H Graphic MMU LUT entry 67 high **/
#define GFXMMU_LUT67H			MMIO32(GFXMMU_BASE + 0x121c)
/** GFXMMU_LUT68L Graphic MMU LUT entry 68 low **/
#define GFXMMU_LUT68L			MMIO32(GFXMMU_BASE + 0x1220)
/** GFXMMU_LUT68H Graphic MMU LUT entry 68 high **/
#define GFXMMU_LUT68H			MMIO32(GFXMMU_BASE + 0x1224)
/** GFXMMU_LUT69L Graphic MMU LUT entry 69 low **/
#define GFXMMU_LUT69L			MMIO32(GFXMMU_BASE + 0x1228)
/** GFXMMU_LUT69H Graphic MMU LUT entry 69 high **/
#define GFXMMU_LUT69H			MMIO32(GFXMMU_BASE + 0x122c)
/** GFXMMU_LUT70L Graphic MMU LUT entry 70 low **/
#define GFXMMU_LUT70L			MMIO32(GFXMMU_BASE + 0x1230)
/** GFXMMU_LUT70H Graphic MMU LUT entry 70 high **/
#define GFXMMU_LUT70H			MMIO32(GFXMMU_BASE + 0x1234)
/** GFXMMU_LUT71L Graphic MMU LUT entry 71 low **/
#define GFXMMU_LUT71L			MMIO32(GFXMMU_BASE + 0x1238)
/** GFXMMU_LUT71H Graphic MMU LUT entry 71 high **/
#define GFXMMU_LUT71H			MMIO32(GFXMMU_BASE + 0x123c)
/** GFXMMU_LUT72L Graphic MMU LUT entry 72 low **/
#define GFXMMU_LUT72L			MMIO32(GFXMMU_BASE + 0x1240)
/** GFXMMU_LUT72H Graphic MMU LUT entry 72 high **/
#define GFXMMU_LUT72H			MMIO32(GFXMMU_BASE + 0x1244)
/** GFXMMU_LUT73L Graphic MMU LUT entry 73 low **/
#define GFXMMU_LUT73L			MMIO32(GFXMMU_BASE + 0x1248)
/** GFXMMU_LUT73H Graphic MMU LUT entry 73 high **/
#define GFXMMU_LUT73H			MMIO32(GFXMMU_BASE + 0x124c)
/** GFXMMU_LUT74L Graphic MMU LUT entry 74 low **/
#define GFXMMU_LUT74L			MMIO32(GFXMMU_BASE + 0x1250)
/** GFXMMU_LUT74H Graphic MMU LUT entry 74 high **/
#define GFXMMU_LUT74H			MMIO32(GFXMMU_BASE + 0x1254)
/** GFXMMU_LUT75L Graphic MMU LUT entry 75 low **/
#define GFXMMU_LUT75L			MMIO32(GFXMMU_BASE + 0x1258)
/** GFXMMU_LUT75H Graphic MMU LUT entry 75 high **/
#define GFXMMU_LUT75H			MMIO32(GFXMMU_BASE + 0x125c)
/** GFXMMU_LUT76L Graphic MMU LUT entry 76 low **/
#define GFXMMU_LUT76L			MMIO32(GFXMMU_BASE + 0x1260)
/** GFXMMU_LUT76H Graphic MMU LUT entry 76 high **/
#define GFXMMU_LUT76H			MMIO32(GFXMMU_BASE + 0x1264)
/** GFXMMU_LUT77L Graphic MMU LUT entry 77 low **/
#define GFXMMU_LUT77L			MMIO32(GFXMMU_BASE + 0x1268)
/** GFXMMU_LUT77H Graphic MMU LUT entry 77 high **/
#define GFXMMU_LUT77H			MMIO32(GFXMMU_BASE + 0x126c)
/** GFXMMU_LUT78L Graphic MMU LUT entry 78 low **/
#define GFXMMU_LUT78L			MMIO32(GFXMMU_BASE + 0x1270)
/** GFXMMU_LUT78H Graphic MMU LUT entry 78 high **/
#define GFXMMU_LUT78H			MMIO32(GFXMMU_BASE + 0x1274)
/** GFXMMU_LUT79L Graphic MMU LUT entry 79 low **/
#define GFXMMU_LUT79L			MMIO32(GFXMMU_BASE + 0x1278)
/** GFXMMU_LUT79H Graphic MMU LUT entry 79 high **/
#define GFXMMU_LUT79H			MMIO32(GFXMMU_BASE + 0x127c)
/** GFXMMU_LUT80L Graphic MMU LUT entry 80 low **/
#define GFXMMU_LUT80L			MMIO32(GFXMMU_BASE + 0x1280)
/** GFXMMU_LUT80H Graphic MMU LUT entry 80 high **/
#define GFXMMU_LUT80H			MMIO32(GFXMMU_BASE + 0x1284)
/** GFXMMU_LUT81L Graphic MMU LUT entry 81 low **/
#define GFXMMU_LUT81L			MMIO32(GFXMMU_BASE + 0x1288)
/** GFXMMU_LUT81H Graphic MMU LUT entry 81 high **/
#define GFXMMU_LUT81H			MMIO32(GFXMMU_BASE + 0x128c)
/** GFXMMU_LUT82L Graphic MMU LUT entry 82 low **/
#define GFXMMU_LUT82L			MMIO32(GFXMMU_BASE + 0x1290)
/** GFXMMU_LUT82H Graphic MMU LUT entry 82 high **/
#define GFXMMU_LUT82H			MMIO32(GFXMMU_BASE + 0x1294)
/** GFXMMU_LUT83L Graphic MMU LUT entry 83 low **/
#define GFXMMU_LUT83L			MMIO32(GFXMMU_BASE + 0x1298)
/** GFXMMU_LUT83H Graphic MMU LUT entry 83 high **/
#define GFXMMU_LUT83H			MMIO32(GFXMMU_BASE + 0x129c)
/** GFXMMU_LUT84L Graphic MMU LUT entry 84 low **/
#define GFXMMU_LUT84L			MMIO32(GFXMMU_BASE + 0x12a0)
/** GFXMMU_LUT84H Graphic MMU LUT entry 84 high **/
#define GFXMMU_LUT84H			MMIO32(GFXMMU_BASE + 0x12a4)
/** GFXMMU_LUT85L Graphic MMU LUT entry 85 low **/
#define GFXMMU_LUT85L			MMIO32(GFXMMU_BASE + 0x12a8)
/** GFXMMU_LUT85H Graphic MMU LUT entry 85 high **/
#define GFXMMU_LUT85H			MMIO32(GFXMMU_BASE + 0x12ac)
/** GFXMMU_LUT86L Graphic MMU LUT entry 86 low **/
#define GFXMMU_LUT86L			MMIO32(GFXMMU_BASE + 0x12b0)
/** GFXMMU_LUT86H Graphic MMU LUT entry 86 high **/
#define GFXMMU_LUT86H			MMIO32(GFXMMU_BASE + 0x12b4)
/** GFXMMU_LUT87L Graphic MMU LUT entry 87 low **/
#define GFXMMU_LUT87L			MMIO32(GFXMMU_BASE + 0x12b8)
/** GFXMMU_LUT87H Graphic MMU LUT entry 87 high **/
#define GFXMMU_LUT87H			MMIO32(GFXMMU_BASE + 0x12bc)
/** GFXMMU_LUT88L Graphic MMU LUT entry 88 low **/
#define GFXMMU_LUT88L			MMIO32(GFXMMU_BASE + 0x12c0)
/** GFXMMU_LUT88H Graphic MMU LUT entry 88 high **/
#define GFXMMU_LUT88H			MMIO32(GFXMMU_BASE + 0x12c4)
/** GFXMMU_LUT89L Graphic MMU LUT entry 89 low **/
#define GFXMMU_LUT89L			MMIO32(GFXMMU_BASE + 0x12c8)
/** GFXMMU_LUT89H Graphic MMU LUT entry 89 high **/
#define GFXMMU_LUT89H			MMIO32(GFXMMU_BASE + 0x12cc)
/** GFXMMU_LUT90L Graphic MMU LUT entry 90 low **/
#define GFXMMU_LUT90L			MMIO32(GFXMMU_BASE + 0x12d0)
/** GFXMMU_LUT90H Graphic MMU LUT entry 90 high **/
#define GFXMMU_LUT90H			MMIO32(GFXMMU_BASE + 0x12d4)
/** GFXMMU_LUT91L Graphic MMU LUT entry 91 low **/
#define GFXMMU_LUT91L			MMIO32(GFXMMU_BASE + 0x12d8)
/** GFXMMU_LUT91H Graphic MMU LUT entry 91 high **/
#define GFXMMU_LUT91H			MMIO32(GFXMMU_BASE + 0x12dc)
/** GFXMMU_LUT92L Graphic MMU LUT entry 92 low **/
#define GFXMMU_LUT92L			MMIO32(GFXMMU_BASE + 0x12e0)
/** GFXMMU_LUT92H Graphic MMU LUT entry 92 high **/
#define GFXMMU_LUT92H			MMIO32(GFXMMU_BASE + 0x12e4)
/** GFXMMU_LUT93L Graphic MMU LUT entry 93 low **/
#define GFXMMU_LUT93L			MMIO32(GFXMMU_BASE + 0x12e8)
/** GFXMMU_LUT93H Graphic MMU LUT entry 93 high **/
#define GFXMMU_LUT93H			MMIO32(GFXMMU_BASE + 0x12ec)
/** GFXMMU_LUT94L Graphic MMU LUT entry 94 low **/
#define GFXMMU_LUT94L			MMIO32(GFXMMU_BASE + 0x12f0)
/** GFXMMU_LUT94H Graphic MMU LUT entry 94 high **/
#define GFXMMU_LUT94H			MMIO32(GFXMMU_BASE + 0x12f4)
/** GFXMMU_LUT95L Graphic MMU LUT entry 95 low **/
#define GFXMMU_LUT95L			MMIO32(GFXMMU_BASE + 0x12f8)
/** GFXMMU_LUT95H Graphic MMU LUT entry 95 high **/
#define GFXMMU_LUT95H			MMIO32(GFXMMU_BASE + 0x12fc)
/** GFXMMU_LUT96L Graphic MMU LUT entry 96 low **/
#define GFXMMU_LUT96L			MMIO32(GFXMMU_BASE + 0x1300)
/** GFXMMU_LUT96H Graphic MMU LUT entry 96 high **/
#define GFXMMU_LUT96H			MMIO32(GFXMMU_BASE + 0x1304)
/** GFXMMU_LUT97L Graphic MMU LUT entry 97 low **/
#define GFXMMU_LUT97L			MMIO32(GFXMMU_BASE + 0x1308)
/** GFXMMU_LUT97H Graphic MMU LUT entry 97 high **/
#define GFXMMU_LUT97H			MMIO32(GFXMMU_BASE + 0x130c)
/** GFXMMU_LUT98L Graphic MMU LUT entry 98 low **/
#define GFXMMU_LUT98L			MMIO32(GFXMMU_BASE + 0x1310)
/** GFXMMU_LUT98H Graphic MMU LUT entry 98 high **/
#define GFXMMU_LUT98H			MMIO32(GFXMMU_BASE + 0x1314)
/** GFXMMU_LUT99L Graphic MMU LUT entry 99 low **/
#define GFXMMU_LUT99L			MMIO32(GFXMMU_BASE + 0x1318)
/** GFXMMU_LUT99H Graphic MMU LUT entry 99 high **/
#define GFXMMU_LUT99H			MMIO32(GFXMMU_BASE + 0x131c)
/** GFXMMU_LUT100L Graphic MMU LUT entry 100 low **/
#define GFXMMU_LUT100L			MMIO32(GFXMMU_BASE + 0x1320)
/** GFXMMU_LUT100H Graphic MMU LUT entry 100 high **/
#define GFXMMU_LUT100H			MMIO32(GFXMMU_BASE + 0x1324)
/** GFXMMU_LUT101L Graphic MMU LUT entry 101 low **/
#define GFXMMU_LUT101L			MMIO32(GFXMMU_BASE + 0x1328)
/** GFXMMU_LUT101H Graphic MMU LUT entry 101 high **/
#define GFXMMU_LUT101H			MMIO32(GFXMMU_BASE + 0x132c)
/** GFXMMU_LUT102L Graphic MMU LUT entry 102 low **/
#define GFXMMU_LUT102L			MMIO32(GFXMMU_BASE + 0x1330)
/** GFXMMU_LUT102H Graphic MMU LUT entry 102 high **/
#define GFXMMU_LUT102H			MMIO32(GFXMMU_BASE + 0x1334)
/** GFXMMU_LUT103L Graphic MMU LUT entry 103 low **/
#define GFXMMU_LUT103L			MMIO32(GFXMMU_BASE + 0x1338)
/** GFXMMU_LUT103H Graphic MMU LUT entry 103 high **/
#define GFXMMU_LUT103H			MMIO32(GFXMMU_BASE + 0x133c)
/** GFXMMU_LUT104L Graphic MMU LUT entry 104 low **/
#define GFXMMU_LUT104L			MMIO32(GFXMMU_BASE + 0x1340)
/** GFXMMU_LUT104H Graphic MMU LUT entry 104 high **/
#define GFXMMU_LUT104H			MMIO32(GFXMMU_BASE + 0x1344)
/** GFXMMU_LUT105L Graphic MMU LUT entry 105 low **/
#define GFXMMU_LUT105L			MMIO32(GFXMMU_BASE + 0x1348)
/** GFXMMU_LUT105H Graphic MMU LUT entry 105 high **/
#define GFXMMU_LUT105H			MMIO32(GFXMMU_BASE + 0x134c)
/** GFXMMU_LUT106L Graphic MMU LUT entry 106 low **/
#define GFXMMU_LUT106L			MMIO32(GFXMMU_BASE + 0x1350)
/** GFXMMU_LUT106H Graphic MMU LUT entry 106 high **/
#define GFXMMU_LUT106H			MMIO32(GFXMMU_BASE + 0x1354)
/** GFXMMU_LUT107L Graphic MMU LUT entry 107 low **/
#define GFXMMU_LUT107L			MMIO32(GFXMMU_BASE + 0x1358)
/** GFXMMU_LUT107H Graphic MMU LUT entry 107 high **/
#define GFXMMU_LUT107H			MMIO32(GFXMMU_BASE + 0x135c)
/** GFXMMU_LUT108L Graphic MMU LUT entry 108 low **/
#define GFXMMU_LUT108L			MMIO32(GFXMMU_BASE + 0x1360)
