grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT108H Graphic MMU LUT entry 108 high **/
#define GFXMMU_LUT108H			MMIO32(GFXMMU_BASE + 0x1364)
/** GFXMMU_LUT109L Graphic MMU LUT entry 109 low **/
#define GFXMMU_LUT109L			MMIO32(GFXMMU_BASE + 0x1368)
/** GFXMMU_LUT109H Graphic MMU LUT entry 109 high **/
#define GFXMMU_LUT109H			MMIO32(GFXMMU_BASE + 0x136c)
/** GFXMMU_LUT110L Graphic MMU LUT entry 110 low **/
#define GFXMMU_LUT110L			MMIO32(GFXMMU_BASE + 0x1370)
/** GFXMMU_LUT110H Graphic MMU LUT entry 110 high **/
#define GFXMMU_LUT110H			MMIO32(GFXMMU_BASE + 0x1374)
/** GFXMMU_LUT111L Graphic MMU LUT entry 111 low **/
#define GFXMMU_LUT111L			MMIO32(GFXMMU_BASE + 0x1378)
/** GFXMMU_LUT111H Graphic MMU LUT entry 111 high **/
#define GFXMMU_LUT111H			MMIO32(GFXMMU_BASE + 0x137c)
/** GFXMMU_LUT112L Graphic MMU LUT entry 112 low **/
#define GFXMMU_LUT112L			MMIO32(GFXMMU_BASE + 0x1380)
/** GFXMMU_LUT112H Graphic MMU LUT entry 112 high **/
#define GFXMMU_LUT112H			MMIO32(GFXMMU_BASE + 0x1384)
/** GFXMMU_LUT113L Graphic MMU LUT entry 113 low **/
#define GFXMMU_LUT113L			MMIO32(GFXMMU_BASE + 0x1388)
/** GFXMMU_LUT113H Graphic MMU LUT entry 113 high **/
#define GFXMMU_LUT113H			MMIO32(GFXMMU_BASE + 0x138c)
/** GFXMMU_LUT114L Graphic MMU LUT entry 114 low **/
#define GFXMMU_LUT114L			MMIO32(GFXMMU_BASE + 0x1390)
/** GFXMMU_LUT114H Graphic MMU LUT entry 114 high **/
#define GFXMMU_LUT114H			MMIO32(GFXMMU_BASE + 0x1394)
/** GFXMMU_LUT115L Graphic MMU LUT entry 115 low **/
#define GFXMMU_LUT115L			MMIO32(GFXMMU_BASE + 0x1398)
/** GFXMMU_LUT115H Graphic MMU LUT entry 115 high **/
#define GFXMMU_LUT115H			MMIO32(GFXMMU_BASE + 0x139c)
/** GFXMMU_LUT116L Graphic MMU LUT entry 116 low **/
#define GFXMMU_LUT116L			MMIO32(GFXMMU_BASE + 0x13a0)
/** GFXMMU_LUT116H Graphic MMU LUT entry 116 high **/
#define GFXMMU_LUT116H			MMIO32(GFXMMU_BASE + 0x13a4)
/** GFXMMU_LUT117L Graphic MMU LUT entry 117 low **/
#define GFXMMU_LUT117L			MMIO32(GFXMMU_BASE + 0x13a8)
/** GFXMMU_LUT117H Graphic MMU LUT entry 117 high **/
#define GFXMMU_LUT117H			MMIO32(GFXMMU_BASE + 0x13ac)
/** GFXMMU_LUT118L Graphic MMU LUT entry 118 low **/
#define GFXMMU_LUT118L			MMIO32(GFXMMU_BASE + 0x13b0)
/** GFXMMU_LUT118H Graphic MMU LUT entry 118 high **/
#define GFXMMU_LUT118H			MMIO32(GFXMMU_BASE + 0x13b4)
/** GFXMMU_LUT119L Graphic MMU LUT entry 119 low **/
#define GFXMMU_LUT119L			MMIO32(GFXMMU_BASE + 0x13b8)
/** GFXMMU_LUT119H Graphic MMU LUT entry 119 high **/
#define GFXMMU_LUT119H			MMIO32(GFXMMU_BASE + 0x13bc)
/** GFXMMU_LUT120L Graphic MMU LUT entry 120 low **/
#define GFXMMU_LUT120L			MMIO32(GFXMMU_BASE + 0x13c0)
/** GFXMMU_LUT120H Graphic MMU LUT entry 120 high **/
#define GFXMMU_LUT120H			MMIO32(GFXMMU_BASE + 0x13c4)
/** GFXMMU_LUT121L Graphic MMU LUT entry 121 low **/
#define GFXMMU_LUT121L			MMIO32(GFXMMU_BASE + 0x13c8)
/** GFXMMU_LUT121H Graphic MMU LUT entry 121 high **/
#define GFXMMU_LUT121H			MMIO32(GFXMMU_BASE + 0x13cc)
/** GFXMMU_LUT122L Graphic MMU LUT entry 122 low **/
#define GFXMMU_LUT122L			MMIO32(GFXMMU_BASE + 0x13d0)
/** GFXMMU_LUT122H Graphic MMU LUT entry 122 high **/
#define GFXMMU_LUT122H			MMIO32(GFXMMU_BASE + 0x13d4)
/** GFXMMU_LUT123L Graphic MMU LUT entry 123 low **/
#define GFXMMU_LUT123L			MMIO32(GFXMMU_BASE + 0x13d8)
/** GFXMMU_LUT123H Graphic MMU LUT entry 123 high **/
#define GFXMMU_LUT123H			MMIO32(GFXMMU_BASE + 0x13dc)
/** GFXMMU_LUT124L Graphic MMU LUT entry 124 low **/
#define GFXMMU_LUT124L			MMIO32(GFXMMU_BASE + 0x13e0)
/** GFXMMU_LUT124H Graphic MMU LUT entry 124 high **/
#define GFXMMU_LUT124H			MMIO32(GFXMMU_BASE + 0x13e4)
/** GFXMMU_LUT125L Graphic MMU LUT entry 125 low **/
#define GFXMMU_LUT125L			MMIO32(GFXMMU_BASE + 0x13e8)
/** GFXMMU_LUT125H Graphic MMU LUT entry 125 high **/
#define GFXMMU_LUT125H			MMIO32(GFXMMU_BASE + 0x13ec)
/** GFXMMU_LUT126L Graphic MMU LUT entry 126 low **/
#define GFXMMU_LUT126L			MMIO32(GFXMMU_BASE + 0x13f0)
/** GFXMMU_LUT126H Graphic MMU LUT entry 126 high **/
#define GFXMMU_LUT126H			MMIO32(GFXMMU_BASE + 0x13f4)
/** GFXMMU_LUT127L Graphic MMU LUT entry 127 low **/
#define GFXMMU_LUT127L			MMIO32(GFXMMU_BASE + 0x13f8)
/** GFXMMU_LUT127H Graphic MMU LUT entry 127 high **/
#define GFXMMU_LUT127H			MMIO32(GFXMMU_BASE + 0x13fc)
/** GFXMMU_LUT128L Graphic MMU LUT entry 128 low **/
#define GFXMMU_LUT128L			MMIO32(GFXMMU_BASE + 0x1400)
/** GFXMMU_LUT128H Graphic MMU LUT entry 128 high **/
#define GFXMMU_LUT128H			MMIO32(GFXMMU_BASE + 0x1404)
/** GFXMMU_LUT129L Graphic MMU LUT entry 129 low **/
#define GFXMMU_LUT129L			MMIO32(GFXMMU_BASE + 0x1408)
/** GFXMMU_LUT129H Graphic MMU LUT entry 129 high **/
#define GFXMMU_LUT129H			MMIO32(GFXMMU_BASE + 0x140c)
/** GFXMMU_LUT130L Graphic MMU LUT entry 130 low **/
#define GFXMMU_LUT130L			MMIO32(GFXMMU_BASE + 0x1410)
/** GFXMMU_LUT130H Graphic MMU LUT entry 130 high **/
#define GFXMMU_LUT130H			MMIO32(GFXMMU_BASE + 0x1414)
/** GFXMMU_LUT131L Graphic MMU LUT entry 131 low **/
#define GFXMMU_LUT131L			MMIO32(GFXMMU_BASE + 0x1418)
/** GFXMMU_LUT131H Graphic MMU LUT entry 131 high **/
#define GFXMMU_LUT131H			MMIO32(GFXMMU_BASE + 0x141c)
/** GFXMMU_LUT132L Graphic MMU LUT entry 132 low **/
#define GFXMMU_LUT132L			MMIO32(GFXMMU_BASE + 0x1420)
/** GFXMMU_LUT132H Graphic MMU LUT entry 132 high **/
#define GFXMMU_LUT132H			MMIO32(GFXMMU_BASE + 0x1424)
/** GFXMMU_LUT133L Graphic MMU LUT entry 133 low **/
#define GFXMMU_LUT133L			MMIO32(GFXMMU_BASE + 0x1428)
/** GFXMMU_LUT133H Graphic MMU LUT entry 133 high **/
#define GFXMMU_LUT133H			MMIO32(GFXMMU_BASE + 0x142c)
/** GFXMMU_LUT134L Graphic MMU LUT entry 134 low **/
#define GFXMMU_LUT134L			MMIO32(GFXMMU_BASE + 0x1430)
/** GFXMMU_LUT134H Graphic MMU LUT entry 134 high **/
#define GFXMMU_LUT134H			MMIO32(GFXMMU_BASE + 0x1434)
/** GFXMMU_LUT135L Graphic MMU LUT entry 135 low **/
#define GFXMMU_LUT135L			MMIO32(GFXMMU_BASE + 0x1438)
/** GFXMMU_LUT135H Graphic MMU LUT entry 135 high **/
#define GFXMMU_LUT135H			MMIO32(GFXMMU_BASE + 0x143c)
/** GFXMMU_LUT136L Graphic MMU LUT entry 136 low **/
#define GFXMMU_LUT136L			MMIO32(GFXMMU_BASE + 0x1440)
/** GFXMMU_LUT136H Graphic MMU LUT entry 136 high **/
#define GFXMMU_LUT136H			MMIO32(GFXMMU_BASE + 0x1444)
/** GFXMMU_LUT137L Graphic MMU LUT entry 137 low **/
#define GFXMMU_LUT137L			MMIO32(GFXMMU_BASE + 0x1448)
/** GFXMMU_LUT137H Graphic MMU LUT entry 137 high **/
#define GFXMMU_LUT137H			MMIO32(GFXMMU_BASE + 0x144c)
/** GFXMMU_LUT138L Graphic MMU LUT entry 138 low **/
#define GFXMMU_LUT138L			MMIO32(GFXMMU_BASE + 0x1450)
/** GFXMMU_LUT138H Graphic MMU LUT entry 138 high **/
#define GFXMMU_LUT138H			MMIO32(GFXMMU_BASE + 0x1454)
/** GFXMMU_LUT139L Graphic MMU LUT entry 139 low **/
#define GFXMMU_LUT139L			MMIO32(GFXMMU_BASE + 0x1458)
/** GFXMMU_LUT139H Graphic MMU LUT entry 139 high **/
#define GFXMMU_LUT139H			MMIO32(GFXMMU_BASE + 0x145c)
/** GFXMMU_LUT140L Graphic MMU LUT entry 140 low **/
#define GFXMMU_LUT140L			MMIO32(GFXMMU_BASE + 0x1460)
/** GFXMMU_LUT140H Graphic MMU LUT entry 140 high **/
#define GFXMMU_LUT140H			MMIO32(GFXMMU_BASE + 0x1464)
/** GFXMMU_LUT141L Graphic MMU LUT entry 141 low **/
#define GFXMMU_LUT141L			MMIO32(GFXMMU_BASE + 0x1468)
/** GFXMMU_LUT141H Graphic MMU LUT entry 141 high **/
#define GFXMMU_LUT141H			MMIO32(GFXMMU_BASE + 0x146c)
/** GFXMMU_LUT142L Graphic MMU LUT entry 142 low **/
#define GFXMMU_LUT142L			MMIO32(GFXMMU_BASE + 0x1470)
/** GFXMMU_LUT142H Graphic MMU LUT entry 142 high **/
#define GFXMMU_LUT142H			MMIO32(GFXMMU_BASE + 0x1474)
/** GFXMMU_LUT143L Graphic MMU LUT entry 143 low **/
#define GFXMMU_LUT143L			MMIO32(GFXMMU_BASE + 0x1478)
/** GFXMMU_LUT143H Graphic MMU LUT entry 143 high **/
#define GFXMMU_LUT143H			MMIO32(GFXMMU_BASE + 0x147c)
/** GFXMMU_LUT144L Graphic MMU LUT entry 144 low **/
#define GFXMMU_LUT144L			MMIO32(GFXMMU_BASE + 0x1480)
/** GFXMMU_LUT144H Graphic MMU LUT entry 144 high **/
#define GFXMMU_LUT144H			MMIO32(GFXMMU_BASE + 0x1484)
/** GFXMMU_LUT145L Graphic MMU LUT entry 145 low **/
#define GFXMMU_LUT145L			MMIO32(GFXMMU_BASE + 0x1488)
/** GFXMMU_LUT145H Graphic MMU LUT entry 145 high **/
#define GFXMMU_LUT145H			MMIO32(GFXMMU_BASE + 0x148c)
/** GFXMMU_LUT146L Graphic MMU LUT entry 146 low **/
#define GFXMMU_LUT146L			MMIO32(GFXMMU_BASE + 0x1490)
/** GFXMMU_LUT146H Graphic MMU LUT entry 146 high **/
#define GFXMMU_LUT146H			MMIO32(GFXMMU_BASE + 0x1494)
/** GFXMMU_LUT147L Graphic MMU LUT entry 147 low **/
#define GFXMMU_LUT147L			MMIO32(GFXMMU_BASE + 0x1498)
/** GFXMMU_LUT147H Graphic MMU LUT entry 147 high **/
#define GFXMMU_LUT147H			MMIO32(GFXMMU_BASE + 0x149c)
/** GFXMMU_LUT148L Graphic MMU LUT entry 148 low **/
#define GFXMMU_LUT148L			MMIO32(GFXMMU_BASE + 0x14a0)
/** GFXMMU_LUT148H Graphic MMU LUT entry 148 high **/
#define GFXMMU_LUT148H			MMIO32(GFXMMU_BASE + 0x14a4)
/** GFXMMU_LUT149L Graphic MMU LUT entry 149 low **/
#define GFXMMU_LUT149L			MMIO32(GFXMMU_BASE + 0x14a8)
/** GFXMMU_LUT149H Graphic MMU LUT entry 149 high **/
#define GFXMMU_LUT149H			MMIO32(GFXMMU_BASE + 0x14ac)
/** GFXMMU_LUT150L Graphic MMU LUT entry 150 low **/
#define GFXMMU_LUT150L			MMIO32(GFXMMU_BASE + 0x14b0)
/** GFXMMU_LUT150H Graphic MMU LUT entry 150 high **/
#define GFXMMU_LUT150H			MMIO32(GFXMMU_BASE + 0x14b4)
/** GFXMMU_LUT151L Graphic MMU LUT entry 151 low **/
#define GFXMMU_LUT151L			MMIO32(GFXMMU_BASE + 0x14b8)
/** GFXMMU_LUT151H Graphic MMU LUT entry 151 high **/
#define GFXMMU_LUT151H			MMIO32(GFXMMU_BASE + 0x14bc)
/** GFXMMU_LUT152L Graphic MMU LUT entry 152 low **/
#define GFXMMU_LUT152L			MMIO32(GFXMMU_BASE + 0x14c0)
/** GFXMMU_LUT152H Graphic MMU LUT entry 152 high **/
#define GFXMMU_LUT152H			MMIO32(GFXMMU_BASE + 0x14c4)
/** GFXMMU_LUT153L Graphic MMU LUT entry 153 low **/
#define GFXMMU_LUT153L			MMIO32(GFXMMU_BASE + 0x14c8)
/** GFXMMU_LUT153H Graphic MMU LUT entry 153 high **/
#define GFXMMU_LUT153H			MMIO32(GFXMMU_BASE + 0x14cc)
/** GFXMMU_LUT154L Graphic MMU LUT entry 154 low **/
#define GFXMMU_LUT154L			MMIO32(GFXMMU_BASE + 0x14d0)
/** GFXMMU_LUT154H Graphic MMU LUT entry 154 high **/
#define GFXMMU_LUT154H			MMIO32(GFXMMU_BASE + 0x14d4)
/** GFXMMU_LUT155L Graphic MMU LUT entry 155 low **/
#define GFXMMU_LUT155L			MMIO32(GFXMMU_BASE + 0x14d8)
/** GFXMMU_LUT155H Graphic MMU LUT entry 155 high **/
#define GFXMMU_LUT155H			MMIO32(GFXMMU_BASE + 0x14dc)
/** GFXMMU_LUT156L Graphic MMU LUT entry 156 low **/
#define GFXMMU_LUT156L			MMIO32(GFXMMU_BASE + 0x14e0)
/** GFXMMU_LUT156H Graphic MMU LUT entry 156 high **/
#define GFXMMU_LUT156H			MMIO32(GFXMMU_BASE + 0x14e4)
/** GFXMMU_LUT157L Graphic MMU LUT entry 157 low **/
#define GFXMMU_LUT157L			MMIO32(GFXMMU_BASE + 0x14e8)
/** GFXMMU_LUT157H Graphic MMU LUT entry 157 high **/
#define GFXMMU_LUT157H			MMIO32(GFXMMU_BASE + 0x14ec)
/** GFXMMU_LUT158L Graphic MMU LUT entry 158 low **/
#define GFXMMU_LUT158L			MMIO32(GFXMMU_BASE + 0x14f0)
/** GFXMMU_LUT158H Graphic MMU LUT entry 158 high **/
#define GFXMMU_LUT158H			MMIO32(GFXMMU_BASE + 0x14f4)
/** GFXMMU_LUT159L Graphic MMU LUT entry 159 low **/
#define GFXMMU_LUT159L			MMIO32(GFXMMU_BASE + 0x14f8)
/** GFXMMU_LUT159H Graphic MMU LUT entry 159 high **/
#define GFXMMU_LUT159H			MMIO32(GFXMMU_BASE + 0x14fc)
/** GFXMMU_LUT160L Graphic MMU LUT entry 160 low **/
#define GFXMMU_LUT160L			MMIO32(GFXMMU_BASE + 0x1500)
/** GFXMMU_LUT160H Graphic MMU LUT entry 160 high **/
#define GFXMMU_LUT160H			MMIO32(GFXMMU_BASE + 0x1504)
/** GFXMMU_LUT161L Graphic MMU LUT entry 161 low **/
#define GFXMMU_LUT161L			MMIO32(GFXMMU_BASE + 0x1508)
/** GFXMMU_LUT161H Graphic MMU LUT entry 161 high **/
#define GFXMMU_LUT161H			MMIO32(GFXMMU_BASE + 0x150c)
/** GFXMMU_LUT162L Graphic MMU LUT entry 162 low **/
#define GFXMMU_LUT162L			MMIO32(GFXMMU_BASE + 0x1510)
/** GFXMMU_LUT162H Graphic MMU LUT entry 162 high **/
#define GFXMMU_LUT162H			MMIO32(GFXMMU_BASE + 0x1514)
/** GFXMMU_LUT163L Graphic MMU LUT entry 163 low **/
#define GFXMMU_LUT163L			MMIO32(GFXMMU_BASE + 0x1518)
/** GFXMMU_LUT163H Graphic MMU LUT entry 163 high **/
#define GFXMMU_LUT163H			MMIO32(GFXMMU_BASE + 0x151c)
/** GFXMMU_LUT164L Graphic MMU LUT entry 164 low **/
#define GFXMMU_LUT164L			MMIO32(GFXMMU_BASE + 0x1520)
/** GFXMMU_LUT164H Graphic MMU LUT entry 164 high **/
#define GFXMMU_LUT164H			MMIO32(GFXMMU_BASE + 0x1524)
/** GFXMMU_LUT165L Graphic MMU LUT entry 165 low **/
#define GFXMMU_LUT165L			MMIO32(GFXMMU_BASE + 0x1528)
/** GFXMMU_LUT165H Graphic MMU LUT entry 165 high **/
#define GFXMMU_LUT165H			MMIO32(GFXMMU_BASE + 0x152c)
/** GFXMMU_LUT166L Graphic MMU LUT entry 166 low **/
#define GFXMMU_LUT166L			MMIO32(GFXMMU_BASE + 0x1530)
/** GFXMMU_LUT166H Graphic MMU LUT entry 166 high **/
#define GFXMMU_LUT166H			MMIO32(GFXMMU_BASE + 0x1534)
/** GFXMMU_LUT167L Graphic MMU LUT entry 167 low **/
#define GFXMMU_LUT167L			MMIO32(GFXMMU_BASE + 0x1538)
/** GFXMMU_LUT167H Graphic MMU LUT entry 167 high **/
#define GFXMMU_LUT167H			MMIO32(GFXMMU_BASE + 0x153c)
/** GFXMMU_LUT168L Graphic MMU LUT entry 168 low **/
#define GFXMMU_LUT168L			MMIO32(GFXMMU_BASE + 0x1540)
/** GFXMMU_LUT168H Graphic MMU LUT entry 168 high **/
#define GFXMMU_LUT168H			MMIO32(GFXMMU_BASE + 0x1544)
/** GFXMMU_LUT169L Graphic MMU LUT entry 169 low **/
#define GFXMMU_LUT169L			MMIO32(GFXMMU_BASE + 0x1548)
/** GFXMMU_LUT169H Graphic MMU LUT entry 169 high **/
#define GFXMMU_LUT169H			MMIO32(GFXMMU_BASE + 0x154c)
/** GFXMMU_LUT170L Graphic MMU LUT entry 170 low **/
#define GFXMMU_LUT170L			MMIO32(GFXMMU_BASE + 0x1550)
/** GFXMMU_LUT170H Graphic MMU LUT entry 170 high **/
#define GFXMMU_LUT170H			MMIO32(GFXMMU_BASE + 0x1554)
/** GFXMMU_LUT171L Graphic MMU LUT entry 171 low **/
#define GFXMMU_LUT171L			MMIO32(GFXMMU_BASE + 0x1558)
/** GFXMMU_LUT171H Graphic MMU LUT entry 171 high **/
#define GFXMMU_LUT171H			MMIO32(GFXMMU_BASE + 0x155c)
/** GFXMMU_LUT172L Graphic MMU LUT entry 172 low **/
#define GFXMMU_LUT172L			MMIO32(GFXMMU_BASE + 0x1560)
/** GFXMMU_LUT172H Graphic MMU LUT entry 172 high **/
#define GFXMMU_LUT172H			MMIO32(GFXMMU_BASE + 0x1564)
/** GFXMMU_LUT173L Graphic MMU LUT entry 173 low **/
#define GFXMMU_LUT173L			MMIO32(GFXMMU_BASE + 0x1568)
/** GFXMMU_LUT173H Graphic MMU LUT entry 173 high **/
#define GFXMMU_LUT173H			MMIO32(GFXMMU_BASE + 0x156c)
/** GFXMMU_LUT174L Graphic MMU LUT entry 174 low **/
#define GFXMMU_LUT174L			MMIO32(GFXMMU_BASE + 0x1570)
/** GFXMMU_LUT174H Graphic MMU LUT entry 174 high **/
#define GFXMMU_LUT174H			MMIO32(GFXMMU_BASE + 0x1574)
/** GFXMMU_LUT175L Graphic MMU LUT entry 175 low **/
#define GFXMMU_LUT175L			MMIO32(GFXMMU_BASE + 0x1578)
/** GFXMMU_LUT175H Graphic MMU LUT entry 175 high **/
#define GFXMMU_LUT175H			MMIO32(GFXMMU_BASE + 0x157c)
/** GFXMMU_LUT176L Graphic MMU LUT entry 176 low **/
#define GFXMMU_LUT176L			MMIO32(GFXMMU_BASE + 0x1580)
/** GFXMMU_LUT176H Graphic MMU LUT entry 176 high **/
#define GFXMMU_LUT176H			MMIO32(GFXMMU_BASE + 0x1584)
/** GFXMMU_LUT177L Graphic MMU LUT entry 177 low **/
#define GFXMMU_LUT177L			MMIO32(GFXMMU_BASE + 0x1588)
/** GFXMMU_LUT177H Graphic MMU LUT entry 177 high **/
#define GFXMMU_LUT177H			MMIO32(GFXMMU_BASE + 0x158c)
/** GFXMMU_LUT178L Graphic MMU LUT entry 178 low **/
#define GFXMMU_LUT178L			MMIO32(GFXMMU_BASE + 0x1590)
/** GFXMMU_LUT178H Graphic MMU LUT entry 178 high **/
#define GFXMMU_LUT178H			MMIO32(GFXMMU_BASE + 0x1594)
/** GFXMMU_LUT179L Graphic MMU LUT entry 179 low **/
#define GFXMMU_LUT179L			MMIO32(GFXMMU_BASE + 0x1598)
/** GFXMMU_LUT179H Graphic MMU LUT entry 179 high **/
#define GFXMMU_LUT179H			MMIO32(GFXMMU_BASE + 0x159c)
/** GFXMMU_LUT180L Graphic MMU LUT entry 180 low **/
#define GFXMMU_LUT180L			MMIO32(GFXMMU_BASE + 0x15a0)
/** GFXMMU_LUT180H Graphic MMU LUT entry 180 high **/
#define GFXMMU_LUT180H			MMIO32(GFXMMU_BASE + 0x15a4)
/** GFXMMU_LUT181L Graphic MMU LUT entry 181 low **/
#define GFXMMU_LUT181L			MMIO32(GFXMMU_BASE + 0x15a8)
/** GFXMMU_LUT181H Graphic MMU LUT entry 181 high **/
#define GFXMMU_LUT181H			MMIO32(GFXMMU_BASE + 0x15ac)
/** GFXMMU_LUT182L Graphic MMU LUT entry 182 low **/
#define GFXMMU_LUT182L			MMIO32(GFXMMU_BASE + 0x15b0)
/** GFXMMU_LUT182H Graphic MMU LUT entry 182 high **/
#define GFXMMU_LUT182H			MMIO32(GFXMMU_BASE + 0x15b4)
/** GFXMMU_LUT183L Graphic MMU LUT entry 183 low **/
#define GFXMMU_LUT183L			MMIO32(GFXMMU_BASE + 0x15b8)
/** GFXMMU_LUT183H Graphic MMU LUT entry 183 high **/
#define GFXMMU_LUT183H			MMIO32(GFXMMU_BASE + 0x15bc)
/** GFXMMU_LUT184L Graphic MMU LUT entry 184 low **/
#define GFXMMU_LUT184L			MMIO32(GFXMMU_BASE + 0x15c0)
/** GFXMMU_LUT184H Graphic MMU LUT entry 184 high **/
#define GFXMMU_LUT184H			MMIO32(GFXMMU_BASE + 0x15c4)
/** GFXMMU_LUT185L Graphic MMU LUT entry 185 low **/
#define GFXMMU_LUT185L			MMIO32(GFXMMU_BASE + 0x15c8)
/** GFXMMU_LUT185H Graphic MMU LUT entry 185 high **/
#define GFXMMU_LUT185H			MMIO32(GFXMMU_BASE + 0x15cc)
/** GFXMMU_LUT186L Graphic MMU LUT entry 186 low **/
#define GFXMMU_LUT186L			MMIO32(GFXMMU_BASE + 0x15d0)
/** GFXMMU_LUT186H Graphic MMU LUT entry 186 high **/
#define GFXMMU_LUT186H			MMIO32(GFXMMU_BASE + 0x15d4)
/** GFXMMU_LUT187L Graphic MMU LUT entry 187 low **/
#define GFXMMU_LUT187L			MMIO32(GFXMMU_BASE + 0x15d8)
/** GFXMMU_LUT187H Graphic MMU LUT entry 187 high **/
#define GFXMMU_LUT187H			MMIO32(GFXMMU_BASE + 0x15dc)
/** GFXMMU_LUT188L Graphic MMU LUT entry 188 low **/
#define GFXMMU_LUT188L			MMIO32(GFXMMU_BASE + 0x15e0)
/** GFXMMU_LUT188H Graphic MMU LUT entry 188 high **/
#define GFXMMU_LUT188H			MMIO32(GFXMMU_BASE + 0x15e4)
/** GFXMMU_LUT189L Graphic MMU LUT entry 189 low **/
#define GFXMMU_LUT189L			MMIO32(GFXMMU_BASE + 0x15e8)
/** GFXMMU_LUT189H Graphic MMU LUT entry 189 high **/
#define GFXMMU_LUT189H			MMIO32(GFXMMU_BASE + 0x15ec)
/** GFXMMU_LUT190L Graphic MMU LUT entry 190 low **/
#define GFXMMU_LUT190L			MMIO32(GFXMMU_BASE + 0x15f0)
/** GFXMMU_LUT190H Graphic MMU LUT entry 190 high **/
#define GFXMMU_LUT190H			MMIO32(GFXMMU_BASE + 0x15f4)
/** GFXMMU_LUT191L Graphic MMU LUT entry 191 low **/
#define GFXMMU_LUT191L			MMIO32(GFXMMU_BASE + 0x15f8)
/** GFXMMU_LUT191H Graphic MMU LUT entry 191 high **/
#define GFXMMU_LUT191H			MMIO32(GFXMMU_BASE + 0x15fc)
/** GFXMMU_LUT192L Graphic MMU LUT entry 192 low **/
#define GFXMMU_LUT192L			MMIO32(GFXMMU_BASE + 0x1600)
/** GFXMMU_LUT192H Graphic MMU LUT entry 192 high **/
#define GFXMMU_LUT192H			MMIO32(GFXMMU_BASE + 0x1604)
/** GFXMMU_LUT193L Graphic MMU LUT entry 193 low **/
#define GFXMMU_LUT193L			MMIO32(GFXMMU_BASE + 0x1608)
/** GFXMMU_LUT193H Graphic MMU LUT entry 193 high **/
#define GFXMMU_LUT193H			MMIO32(GFXMMU_BASE + 0x160c)
/** GFXMMU_LUT194L Graphic MMU LUT entry 194 low **/
#define GFXMMU_LUT194L			MMIO32(GFXMMU_BASE + 0x1610)
/** GFXMMU_LUT194H Graphic MMU LUT entry 194 high **/
#define GFXMMU_LUT194H			MMIO32(GFXMMU_BASE + 0x1614)
/** GFXMMU_LUT195L Graphic MMU LUT entry 195 low **/
#define GFXMMU_LUT195L			MMIO32(GFXMMU_BASE + 0x1618)
/** GFXMMU_LUT195H Graphic MMU LUT entry 195 high **/
#define GFXMMU_LUT195H			MMIO32(GFXMMU_BASE + 0x161c)
/** GFXMMU_LUT196L Graphic MMU LUT entry 196 low **/
#define GFXMMU_LUT196L			MMIO32(GFXMMU_BASE + 0x1620)
/** GFXMMU_LUT196H Graphic MMU LUT entry 196 high **/
#define GFXMMU_LUT196H			MMIO32(GFXMMU_BASE + 0x1624)
/** GFXMMU_LUT197L Graphic MMU LUT entry 197 low **/
#define GFXMMU_LUT197L			MMIO32(GFXMMU_BASE + 0x1628)
/** GFXMMU_LUT197H Graphic MMU LUT entry 197 high **/
#define GFXMMU_LUT197H			MMIO32(GFXMMU_BASE + 0x162c)
/** GFXMMU_LUT198L Graphic MMU LUT entry 198 low **/
#define GFXMMU_LUT198L			MMIO32(GFXMMU_BASE + 0x1630)
/** GFXMMU_LUT198H Graphic MMU LUT entry 198 high **/
#define GFXMMU_LUT198H			MMIO32(GFXMMU_BASE + 0x1634)
/** GFXMMU_LUT199L Graphic MMU LUT entry 199 low **/
#define GFXMMU_LUT199L			MMIO32(GFXMMU_BASE + 0x1638)
/** GFXMMU_LUT199H Graphic MMU LUT entry 199 high **/
#define GFXMMU_LUT199H			MMIO32(GFXMMU_BASE + 0x163c)
/** GFXMMU_LUT200L Graphic MMU LUT entry 200 low **/
#define GFXMMU_LUT200L			MMIO32(GFXMMU_BASE + 0x1640)
/** GFXMMU_LUT200H Graphic MMU LUT entry 200 high **/
#define GFXMMU_LUT200H			MMIO32(GFXMMU_BASE + 0x1644)
/** GFXMMU_LUT201L Graphic MMU LUT entry 201 low **/
#define GFXMMU_LUT201L			MMIO32(GFXMMU_BASE + 0x1648)
/** GFXMMU_LUT201H Graphic MMU LUT entry 201 high **/
#define GFXMMU_LUT201H			MMIO32(GFXMMU_BASE + 0x164c)
/** GFXMMU_LUT202L Graphic MMU LUT entry 202 low **/
#define GFXMMU_LUT202L			MMIO32(GFXMMU_BASE + 0x1650)
/** GFXMMU_LUT202H Graphic MMU LUT entry 202 high **/
#define GFXMMU_LUT202H			MMIO32(GFXMMU_BASE + 0x1654)
/** GFXMMU_LUT203L Graphic MMU LUT entry 203 low **/
#define GFXMMU_LUT203L			MMIO32(GFXMMU_BASE + 0x1658)
/** GFXMMU_LUT203H Graphic MMU LUT entry 203 high **/
#define GFXMMU_LUT203H			MMIO32(GFXMMU_BASE + 0x165c)
/** GFXMMU_LUT204L Graphic MMU LUT entry 204 low **/
#define GFXMMU_LUT204L			MMIO32(GFXMMU_BASE + 0x1660)
/** GFXMMU_LUT204H Graphic MMU LUT entry 204 high **/
#define GFXMMU_LUT204H			MMIO32(GFXMMU_BASE + 0x1664)
/** GFXMMU_LUT205L Graphic MMU LUT entry 205 low **/
#define GFXMMU_LUT205L			MMIO32(GFXMMU_BASE + 0x1668)
/** GFXMMU_LUT205H Graphic MMU LUT entry 205 high **/
#define GFXMMU_LUT205H			MMIO32(GFXMMU_BASE + 0x166c)
/** GFXMMU_LUT206L Graphic MMU LUT entry 206 low **/
#define GFXMMU_LUT206L			MMIO32(GFXMMU_BASE + 0x1670)
/** GFXMMU_LUT206H Graphic MMU LUT entry 206 high **/
#define GFXMMU_LUT206H			MMIO32(GFXMMU_BASE + 0x1674)
/** GFXMMU_LUT207L Graphic MMU LUT entry 207 low **/
#define GFXMMU_LUT207L			MMIO32(GFXMMU_BASE + 0x1678)
/** GFXMMU_LUT207H Graphic MMU LUT entry 207 high **/
#define GFXMMU_LUT207H			MMIO32(GFXMMU_BASE + 0x167c)
/** GFXMMU_LUT208L Graphic MMU LUT entry 208 low **/
#define GFXMMU_LUT208L			MMIO32(GFXMMU_BASE + 0x1680)
/** GFXMMU_LUT208H Graphic MMU LUT entry 208 high **/
#define GFXMMU_LUT208H			MMIO32(GFXMMU_BASE + 0x1684)
/** GFXMMU_LUT209L Graphic MMU LUT entry 209 low **/
#define GFXMMU_LUT209L			MMIO32(GFXMMU_BASE + 0x1688)
/** GFXMMU_LUT209H Graphic MMU LUT entry 209 high **/
#define GFXMMU_LUT209H			MMIO32(GFXMMU_BASE + 0x168c)
/** GFXMMU_LUT210L Graphic MMU LUT entry 210 low **/
#define GFXMMU_LUT210L			MMIO32(GFXMMU_BASE + 0x1690)
/** GFXMMU_LUT210H Graphic MMU LUT entry 210 high **/
#define GFXMMU_LUT210H			MMIO32(GFXMMU_BASE + 0x1694)
/** GFXMMU_LUT211L Graphic MMU LUT entry 211 low **/
#define GFXMMU_LUT211L			MMIO32(GFXMMU_BASE + 0x1698)
/** GFXMMU_LUT211H Graphic MMU LUT entry 211 high **/
#define GFXMMU_LUT211H			MMIO32(GFXMMU_BASE + 0x169c)
/** GFXMMU_LUT212L Graphic MMU LUT entry 212 low **/
#define GFXMMU_LUT212L			MMIO32(GFXMMU_BASE + 0x16a0)
/** GFXMMU_LUT212H Graphic MMU LUT entry 212 high **/
#define GFXMMU_LUT212H			MMIO32(GFXMMU_BASE + 0x16a4)
/** GFXMMU_LUT213L Graphic MMU LUT entry 213 low **/
#define GFXMMU_LUT213L			MMIO32(GFXMMU_BASE + 0x16a8)
/** GFXMMU_LUT213H Graphic MMU LUT entry 213 high **/
#define GFXMMU_LUT213H			MMIO32(GFXMMU_BASE + 0x16ac)
/** GFXMMU_LUT214L Graphic MMU LUT entry 214 low **/
#define GFXMMU_LUT214L			MMIO32(GFXMMU_BASE + 0x16b0)
/** GFXMMU_LUT214H Graphic MMU LUT entry 214 high **/
#define GFXMMU_LUT214H			MMIO32(GFXMMU_BASE + 0x16b4)
/** GFXMMU_LUT215L Graphic MMU LUT entry 215 low **/
#define GFXMMU_LUT215L			MMIO32(GFXMMU_BASE + 0x16b8)
/** GFXMMU_LUT215H Graphic MMU LUT entry 215 high **/
#define GFXMMU_LUT215H			MMIO32(GFXMMU_BASE + 0x16bc)
/** GFXMMU_LUT216L Graphic MMU LUT entry 216 low **/
#define GFXMMU_LUT216L			MMIO32(GFXMMU_BASE + 0x16c0)
/** GFXMMU_LUT216H Graphic MMU LUT entry 216 high **/
#define GFXMMU_LUT216H			MMIO32(GFXMMU_BASE + 0x16c4)
/** GFXMMU_LUT217L Graphic MMU LUT entry 217 low **/
#define GFXMMU_LUT217L			MMIO32(GFXMMU_BASE + 0x16c8)
/** GFXMMU_LUT217H Graphic MMU LUT entry 217 high **/
#define GFXMMU_LUT217H			MMIO32(GFXMMU_BASE + 0x16cc)
/** GFXMMU_LUT218L Graphic MMU LUT entry 218 low **/
#define GFXMMU_LUT218L			MMIO32(GFXMMU_BASE + 0x16d0)
/** GFXMMU_LUT218H Graphic MMU LUT entry 218 high **/
#define GFXMMU_LUT218H			MMIO32(GFXMMU_BASE + 0x16d4)
/** GFXMMU_LUT219L Graphic MMU LUT entry 219 low **/
#define GFXMMU_LUT219L			MMIO32(GFXMMU_BASE + 0x16d8)
/** GFXMMU_LUT219H Graphic MMU LUT entry 219 high **/
#define GFXMMU_LUT219H			MMIO32(GFXMMU_BASE + 0x16dc)
