grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT220L Graphic MMU LUT entry 220 low **/
#define GFXMMU_LUT220L			MMIO32(GFXMMU_BASE + 0x16e0)
/** GFXMMU_LUT220H Graphic MMU LUT entry 220 high **/
#define GFXMMU_LUT220H			MMIO32(GFXMMU_BASE + 0x16e4)
/** GFXMMU_LUT221L Graphic MMU LUT entry 221 low **/
#define GFXMMU_LUT221L			MMIO32(GFXMMU_BASE + 0x16e8)
/** GFXMMU_LUT221H Graphic MMU LUT entry 221 high **/
#define GFXMMU_LUT221H			MMIO32(GFXMMU_BASE + 0x16ec)
/** GFXMMU_LUT222L Graphic MMU LUT entry 222 low **/
#define GFXMMU_LUT222L			MMIO32(GFXMMU_BASE + 0x16f0)
/** GFXMMU_LUT222H Graphic MMU LUT entry 222 high **/
#define GFXMMU_LUT222H			MMIO32(GFXMMU_BASE + 0x16f4)
/** GFXMMU_LUT223L Graphic MMU LUT entry 223 low **/
#define GFXMMU_LUT223L			MMIO32(GFXMMU_BASE + 0x16f8)
/** GFXMMU_LUT223H Graphic MMU LUT entry 223 high **/
#define GFXMMU_LUT223H			MMIO32(GFXMMU_BASE + 0x16fc)
/** GFXMMU_LUT224L Graphic MMU LUT entry 224 low **/
#define GFXMMU_LUT224L			MMIO32(GFXMMU_BASE + 0x1700)
/** GFXMMU_LUT224H Graphic MMU LUT entry 224 high **/
#define GFXMMU_LUT224H			MMIO32(GFXMMU_BASE + 0x1704)
/** GFXMMU_LUT225L Graphic MMU LUT entry 225 low **/
#define GFXMMU_LUT225L			MMIO32(GFXMMU_BASE + 0x1708)
/** GFXMMU_LUT225H Graphic MMU LUT entry 225 high **/
#define GFXMMU_LUT225H			MMIO32(GFXMMU_BASE + 0x170c)
/** GFXMMU_LUT226L Graphic MMU LUT entry 226 low **/
#define GFXMMU_LUT226L			MMIO32(GFXMMU_BASE + 0x1710)
/** GFXMMU_LUT226H Graphic MMU LUT entry 226 high **/
#define GFXMMU_LUT226H			MMIO32(GFXMMU_BASE + 0x1714)
/** GFXMMU_LUT227L Graphic MMU LUT entry 227 low **/
#define GFXMMU_LUT227L			MMIO32(GFXMMU_BASE + 0x1718)
/** GFXMMU_LUT227H Graphic MMU LUT entry 227 high **/
#define GFXMMU_LUT227H			MMIO32(GFXMMU_BASE + 0x171c)
/** GFXMMU_LUT228L Graphic MMU LUT entry 228 low **/
#define GFXMMU_LUT228L			MMIO32(GFXMMU_BASE + 0x1720)
/** GFXMMU_LUT228H Graphic MMU LUT entry 228 high **/
#define GFXMMU_LUT228H			MMIO32(GFXMMU_BASE + 0x1724)
/** GFXMMU_LUT229L Graphic MMU LUT entry 229 low **/
#define GFXMMU_LUT229L			MMIO32(GFXMMU_BASE + 0x1728)
/** GFXMMU_LUT229H Graphic MMU LUT entry 229 high **/
#define GFXMMU_LUT229H			MMIO32(GFXMMU_BASE + 0x172c)
/** GFXMMU_LUT230L Graphic MMU LUT entry 230 low **/
#define GFXMMU_LUT230L			MMIO32(GFXMMU_BASE + 0x1730)
/** GFXMMU_LUT230H Graphic MMU LUT entry 230 high **/
#define GFXMMU_LUT230H			MMIO32(GFXMMU_BASE + 0x1734)
/** GFXMMU_LUT231L Graphic MMU LUT entry 231 low **/
#define GFXMMU_LUT231L			MMIO32(GFXMMU_BASE + 0x1738)
/** GFXMMU_LUT231H Graphic MMU LUT entry 231 high **/
#define GFXMMU_LUT231H			MMIO32(GFXMMU_BASE + 0x173c)
/** GFXMMU_LUT232L Graphic MMU LUT entry 232 low **/
#define GFXMMU_LUT232L			MMIO32(GFXMMU_BASE + 0x1740)
/** GFXMMU_LUT232H Graphic MMU LUT entry 232 high **/
#define GFXMMU_LUT232H			MMIO32(GFXMMU_BASE + 0x1744)
/** GFXMMU_LUT233L Graphic MMU LUT entry 233 low **/
#define GFXMMU_LUT233L			MMIO32(GFXMMU_BASE + 0x1748)
/** GFXMMU_LUT233H Graphic MMU LUT entry 233 high **/
#define GFXMMU_LUT233H			MMIO32(GFXMMU_BASE + 0x174c)
/** GFXMMU_LUT234L Graphic MMU LUT entry 234 low **/
#define GFXMMU_LUT234L			MMIO32(GFXMMU_BASE + 0x1750)
/** GFXMMU_LUT234H Graphic MMU LUT entry 234 high **/
#define GFXMMU_LUT234H			MMIO32(GFXMMU_BASE + 0x1754)
/** GFXMMU_LUT235L Graphic MMU LUT entry 235 low **/
#define GFXMMU_LUT235L			MMIO32(GFXMMU_BASE + 0x1758)
/** GFXMMU_LUT235H Graphic MMU LUT entry 235 high **/
#define GFXMMU_LUT235H			MMIO32(GFXMMU_BASE + 0x175c)
/** GFXMMU_LUT236L Graphic MMU LUT entry 236 low **/
#define GFXMMU_LUT236L			MMIO32(GFXMMU_BASE + 0x1760)
/** GFXMMU_LUT236H Graphic MMU LUT entry 236 high **/
#define GFXMMU_LUT236H			MMIO32(GFXMMU_BASE + 0x1764)
/** GFXMMU_LUT237L Graphic MMU LUT entry 237 low **/
#define GFXMMU_LUT237L			MMIO32(GFXMMU_BASE + 0x1768)
/** GFXMMU_LUT237H Graphic MMU LUT entry 237 high **/
#define GFXMMU_LUT237H			MMIO32(GFXMMU_BASE + 0x176c)
/** GFXMMU_LUT238L Graphic MMU LUT entry 238 low **/
#define GFXMMU_LUT238L			MMIO32(GFXMMU_BASE + 0x1770)
/** GFXMMU_LUT238H Graphic MMU LUT entry 238 high **/
#define GFXMMU_LUT238H			MMIO32(GFXMMU_BASE + 0x1774)
/** GFXMMU_LUT239L Graphic MMU LUT entry 239 low **/
#define GFXMMU_LUT239L			MMIO32(GFXMMU_BASE + 0x1778)
/** GFXMMU_LUT239H Graphic MMU LUT entry 239 high **/
#define GFXMMU_LUT239H			MMIO32(GFXMMU_BASE + 0x177c)
/** GFXMMU_LUT240L Graphic MMU LUT entry 240 low **/
#define GFXMMU_LUT240L			MMIO32(GFXMMU_BASE + 0x1780)
/** GFXMMU_LUT240H Graphic MMU LUT entry 240 high **/
#define GFXMMU_LUT240H			MMIO32(GFXMMU_BASE + 0x1784)
/** GFXMMU_LUT241L Graphic MMU LUT entry 241 low **/
#define GFXMMU_LUT241L			MMIO32(GFXMMU_BASE + 0x1788)
/** GFXMMU_LUT241H Graphic MMU LUT entry 241 high **/
#define GFXMMU_LUT241H			MMIO32(GFXMMU_BASE + 0x178c)
/** GFXMMU_LUT242L Graphic MMU LUT entry 242 low **/
#define GFXMMU_LUT242L			MMIO32(GFXMMU_BASE + 0x1790)
/** GFXMMU_LUT242H Graphic MMU LUT entry 242 high **/
#define GFXMMU_LUT242H			MMIO32(GFXMMU_BASE + 0x1794)
/** GFXMMU_LUT243L Graphic MMU LUT entry 243 low **/
#define GFXMMU_LUT243L			MMIO32(GFXMMU_BASE + 0x1798)
/** GFXMMU_LUT243H Graphic MMU LUT entry 243 high **/
#define GFXMMU_LUT243H			MMIO32(GFXMMU_BASE + 0x179c)
/** GFXMMU_LUT244L Graphic MMU LUT entry 244 low **/
#define GFXMMU_LUT244L			MMIO32(GFXMMU_BASE + 0x17a0)
/** GFXMMU_LUT244H Graphic MMU LUT entry 244 high **/
#define GFXMMU_LUT244H			MMIO32(GFXMMU_BASE + 0x17a4)
/** GFXMMU_LUT245L Graphic MMU LUT entry 245 low **/
#define GFXMMU_LUT245L			MMIO32(GFXMMU_BASE + 0x17a8)
/** GFXMMU_LUT245H Graphic MMU LUT entry 245 high **/
#define GFXMMU_LUT245H			MMIO32(GFXMMU_BASE + 0x17ac)
/** GFXMMU_LUT246L Graphic MMU LUT entry 246 low **/
#define GFXMMU_LUT246L			MMIO32(GFXMMU_BASE + 0x17b0)
/** GFXMMU_LUT246H Graphic MMU LUT entry 246 high **/
#define GFXMMU_LUT246H			MMIO32(GFXMMU_BASE + 0x17b4)
/** GFXMMU_LUT247L Graphic MMU LUT entry 247 low **/
#define GFXMMU_LUT247L			MMIO32(GFXMMU_BASE + 0x17b8)
/** GFXMMU_LUT247H Graphic MMU LUT entry 247 high **/
#define GFXMMU_LUT247H			MMIO32(GFXMMU_BASE + 0x17bc)
/** GFXMMU_LUT248L Graphic MMU LUT entry 248 low **/
#define GFXMMU_LUT248L			MMIO32(GFXMMU_BASE + 0x17c0)
/** GFXMMU_LUT248H Graphic MMU LUT entry 248 high **/
#define GFXMMU_LUT248H			MMIO32(GFXMMU_BASE + 0x17c4)
/** GFXMMU_LUT249L Graphic MMU LUT entry 249 low **/
#define GFXMMU_LUT249L			MMIO32(GFXMMU_BASE + 0x17c8)
/** GFXMMU_LUT249H Graphic MMU LUT entry 249 high **/
#define GFXMMU_LUT249H			MMIO32(GFXMMU_BASE + 0x17cc)
/** GFXMMU_LUT250L Graphic MMU LUT entry 250 low **/
#define GFXMMU_LUT250L			MMIO32(GFXMMU_BASE + 0x17d0)
/** GFXMMU_LUT250H Graphic MMU LUT entry 250 high **/
#define GFXMMU_LUT250H			MMIO32(GFXMMU_BASE + 0x17d4)
/** GFXMMU_LUT251L Graphic MMU LUT entry 251 low **/
#define GFXMMU_LUT251L			MMIO32(GFXMMU_BASE + 0x17d8)
/** GFXMMU_LUT251H Graphic MMU LUT entry 251 high **/
#define GFXMMU_LUT251H			MMIO32(GFXMMU_BASE + 0x17dc)
/** GFXMMU_LUT252L Graphic MMU LUT entry 252 low **/
#define GFXMMU_LUT252L			MMIO32(GFXMMU_BASE + 0x17e0)
/** GFXMMU_LUT252H Graphic MMU LUT entry 252 high **/
#define GFXMMU_LUT252H			MMIO32(GFXMMU_BASE + 0x17e4)
/** GFXMMU_LUT253L Graphic MMU LUT entry 253 low **/
#define GFXMMU_LUT253L			MMIO32(GFXMMU_BASE + 0x17e8)
/** GFXMMU_LUT253H Graphic MMU LUT entry 253 high **/
#define GFXMMU_LUT253H			MMIO32(GFXMMU_BASE + 0x17ec)
/** GFXMMU_LUT254L Graphic MMU LUT entry 254 low **/
#define GFXMMU_LUT254L			MMIO32(GFXMMU_BASE + 0x17f0)
/** GFXMMU_LUT254H Graphic MMU LUT entry 254 high **/
#define GFXMMU_LUT254H			MMIO32(GFXMMU_BASE + 0x17f4)
/** GFXMMU_LUT255L Graphic MMU LUT entry 255 low **/
#define GFXMMU_LUT255L			MMIO32(GFXMMU_BASE + 0x17f8)
/** GFXMMU_LUT255H Graphic MMU LUT entry 255 high **/
#define GFXMMU_LUT255H			MMIO32(GFXMMU_BASE + 0x17fc)
/** GFXMMU_LUT256L Graphic MMU LUT entry 256 low **/
#define GFXMMU_LUT256L			MMIO32(GFXMMU_BASE + 0x1800)
/** GFXMMU_LUT256H Graphic MMU LUT entry 256 high **/
#define GFXMMU_LUT256H			MMIO32(GFXMMU_BASE + 0x1804)
/** GFXMMU_LUT257L Graphic MMU LUT entry 257 low **/
#define GFXMMU_LUT257L			MMIO32(GFXMMU_BASE + 0x1808)
/** GFXMMU_LUT257H Graphic MMU LUT entry 257 high **/
#define GFXMMU_LUT257H			MMIO32(GFXMMU_BASE + 0x180c)
/** GFXMMU_LUT258L Graphic MMU LUT entry 258 low **/
#define GFXMMU_LUT258L			MMIO32(GFXMMU_BASE + 0x1810)
/** GFXMMU_LUT258H Graphic MMU LUT entry 258 high **/
#define GFXMMU_LUT258H			MMIO32(GFXMMU_BASE + 0x1814)
/** GFXMMU_LUT259L Graphic MMU LUT entry 259 low **/
#define GFXMMU_LUT259L			MMIO32(GFXMMU_BASE + 0x1818)
/** GFXMMU_LUT259H Graphic MMU LUT entry 259 high **/
#define GFXMMU_LUT259H			MMIO32(GFXMMU_BASE + 0x181c)
/** GFXMMU_LUT260L Graphic MMU LUT entry 260 low **/
#define GFXMMU_LUT260L			MMIO32(GFXMMU_BASE + 0x1820)
/** GFXMMU_LUT260H Graphic MMU LUT entry 260 high **/
#define GFXMMU_LUT260H			MMIO32(GFXMMU_BASE + 0x1824)
/** GFXMMU_LUT261L Graphic MMU LUT entry 261 low **/
#define GFXMMU_LUT261L			MMIO32(GFXMMU_BASE + 0x1828)
/** GFXMMU_LUT261H Graphic MMU LUT entry 261 high **/
#define GFXMMU_LUT261H			MMIO32(GFXMMU_BASE + 0x182c)
/** GFXMMU_LUT262L Graphic MMU LUT entry 262 low **/
#define GFXMMU_LUT262L			MMIO32(GFXMMU_BASE + 0x1830)
/** GFXMMU_LUT262H Graphic MMU LUT entry 262 high **/
#define GFXMMU_LUT262H			MMIO32(GFXMMU_BASE + 0x1834)
/** GFXMMU_LUT263L Graphic MMU LUT entry 263 low **/
#define GFXMMU_LUT263L			MMIO32(GFXMMU_BASE + 0x1838)
/** GFXMMU_LUT263H Graphic MMU LUT entry 263 high **/
#define GFXMMU_LUT263H			MMIO32(GFXMMU_BASE + 0x183c)
/** GFXMMU_LUT264L Graphic MMU LUT entry 264 low **/
#define GFXMMU_LUT264L			MMIO32(GFXMMU_BASE + 0x1840)
/** GFXMMU_LUT264H Graphic MMU LUT entry 264 high **/
#define GFXMMU_LUT264H			MMIO32(GFXMMU_BASE + 0x1844)
/** GFXMMU_LUT265L Graphic MMU LUT entry 265 low **/
#define GFXMMU_LUT265L			MMIO32(GFXMMU_BASE + 0x1848)
/** GFXMMU_LUT265H Graphic MMU LUT entry 265 high **/
#define GFXMMU_LUT265H			MMIO32(GFXMMU_BASE + 0x184c)
/** GFXMMU_LUT266L Graphic MMU LUT entry 266 low **/
#define GFXMMU_LUT266L			MMIO32(GFXMMU_BASE + 0x1850)
/** GFXMMU_LUT266H Graphic MMU LUT entry 266 high **/
#define GFXMMU_LUT266H			MMIO32(GFXMMU_BASE + 0x1854)
/** GFXMMU_LUT267L Graphic MMU LUT entry 267 low **/
#define GFXMMU_LUT267L			MMIO32(GFXMMU_BASE + 0x1858)
/** GFXMMU_LUT267H Graphic MMU LUT entry 267 high **/
#define GFXMMU_LUT267H			MMIO32(GFXMMU_BASE + 0x185c)
/** GFXMMU_LUT268L Graphic MMU LUT entry 268 low **/
#define GFXMMU_LUT268L			MMIO32(GFXMMU_BASE + 0x1860)
/** GFXMMU_LUT268H Graphic MMU LUT entry 268 high **/
#define GFXMMU_LUT268H			MMIO32(GFXMMU_BASE + 0x1864)
/** GFXMMU_LUT269L Graphic MMU LUT entry 269 low **/
#define GFXMMU_LUT269L			MMIO32(GFXMMU_BASE + 0x1868)
/** GFXMMU_LUT269H Graphic MMU LUT entry 269 high **/
#define GFXMMU_LUT269H			MMIO32(GFXMMU_BASE + 0x186c)
/** GFXMMU_LUT270L Graphic MMU LUT entry 270 low **/
#define GFXMMU_LUT270L			MMIO32(GFXMMU_BASE + 0x1870)
/** GFXMMU_LUT270H Graphic MMU LUT entry 270 high **/
#define GFXMMU_LUT270H			MMIO32(GFXMMU_BASE + 0x1874)
/** GFXMMU_LUT271L Graphic MMU LUT entry 271 low **/
#define GFXMMU_LUT271L			MMIO32(GFXMMU_BASE + 0x1878)
/** GFXMMU_LUT271H Graphic MMU LUT entry 271 high **/
#define GFXMMU_LUT271H			MMIO32(GFXMMU_BASE + 0x187c)
/** GFXMMU_LUT272L Graphic MMU LUT entry 272 low **/
#define GFXMMU_LUT272L			MMIO32(GFXMMU_BASE + 0x1880)
/** GFXMMU_LUT272H Graphic MMU LUT entry 272 high **/
#define GFXMMU_LUT272H			MMIO32(GFXMMU_BASE + 0x1884)
/** GFXMMU_LUT273L Graphic MMU LUT entry 273 low **/
#define GFXMMU_LUT273L			MMIO32(GFXMMU_BASE + 0x1888)
/** GFXMMU_LUT273H Graphic MMU LUT entry 273 high **/
#define GFXMMU_LUT273H			MMIO32(GFXMMU_BASE + 0x188c)
/** GFXMMU_LUT274L Graphic MMU LUT entry 274 low **/
#define GFXMMU_LUT274L			MMIO32(GFXMMU_BASE + 0x1890)
/** GFXMMU_LUT274H Graphic MMU LUT entry 274 high **/
#define GFXMMU_LUT274H			MMIO32(GFXMMU_BASE + 0x1894)
/** GFXMMU_LUT275L Graphic MMU LUT entry 275 low **/
#define GFXMMU_LUT275L			MMIO32(GFXMMU_BASE + 0x1898)
/** GFXMMU_LUT275H Graphic MMU LUT entry 275 high **/
#define GFXMMU_LUT275H			MMIO32(GFXMMU_BASE + 0x189c)
/** GFXMMU_LUT276L Graphic MMU LUT entry 276 low **/
#define GFXMMU_LUT276L			MMIO32(GFXMMU_BASE + 0x18a0)
/** GFXMMU_LUT276H Graphic MMU LUT entry 276 high **/
#define GFXMMU_LUT276H			MMIO32(GFXMMU_BASE + 0x18a4)
/** GFXMMU_LUT277L Graphic MMU LUT entry 277 low **/
#define GFXMMU_LUT277L			MMIO32(GFXMMU_BASE + 0x18a8)
/** GFXMMU_LUT277H Graphic MMU LUT entry 277 high **/
#define GFXMMU_LUT277H			MMIO32(GFXMMU_BASE + 0x18ac)
/** GFXMMU_LUT278L Graphic MMU LUT entry 278 low **/
#define GFXMMU_LUT278L			MMIO32(GFXMMU_BASE + 0x18b0)
/** GFXMMU_LUT278H Graphic MMU LUT entry 278 high **/
#define GFXMMU_LUT278H			MMIO32(GFXMMU_BASE + 0x18b4)
/** GFXMMU_LUT279L Graphic MMU LUT entry 279 low **/
#define GFXMMU_LUT279L			MMIO32(GFXMMU_BASE + 0x18b8)
/** GFXMMU_LUT279H Graphic MMU LUT entry 279 high **/
#define GFXMMU_LUT279H			MMIO32(GFXMMU_BASE + 0x18bc)
/** GFXMMU_LUT280L Graphic MMU LUT entry 280 low **/
#define GFXMMU_LUT280L			MMIO32(GFXMMU_BASE + 0x18c0)
/** GFXMMU_LUT280H Graphic MMU LUT entry 280 high **/
#define GFXMMU_LUT280H			MMIO32(GFXMMU_BASE + 0x18c4)
/** GFXMMU_LUT281L Graphic MMU LUT entry 281 low **/
#define GFXMMU_LUT281L			MMIO32(GFXMMU_BASE + 0x18c8)
/** GFXMMU_LUT281H Graphic MMU LUT entry 281 high **/
#define GFXMMU_LUT281H			MMIO32(GFXMMU_BASE + 0x18cc)
/** GFXMMU_LUT282L Graphic MMU LUT entry 282 low **/
#define GFXMMU_LUT282L			MMIO32(GFXMMU_BASE + 0x18d0)
/** GFXMMU_LUT282H Graphic MMU LUT entry 282 high **/
#define GFXMMU_LUT282H			MMIO32(GFXMMU_BASE + 0x18d4)
/** GFXMMU_LUT283L Graphic MMU LUT entry 283 low **/
#define GFXMMU_LUT283L			MMIO32(GFXMMU_BASE + 0x18d8)
/** GFXMMU_LUT283H Graphic MMU LUT entry 283 high **/
#define GFXMMU_LUT283H			MMIO32(GFXMMU_BASE + 0x18dc)
/** GFXMMU_LUT284L Graphic MMU LUT entry 284 low **/
#define GFXMMU_LUT284L			MMIO32(GFXMMU_BASE + 0x18e0)
/** GFXMMU_LUT284H Graphic MMU LUT entry 284 high **/
#define GFXMMU_LUT284H			MMIO32(GFXMMU_BASE + 0x18e4)
/** GFXMMU_LUT285L Graphic MMU LUT entry 285 low **/
#define GFXMMU_LUT285L			MMIO32(GFXMMU_BASE + 0x18e8)
/** GFXMMU_LUT285H Graphic MMU LUT entry 285 high **/
#define GFXMMU_LUT285H			MMIO32(GFXMMU_BASE + 0x18ec)
/** GFXMMU_LUT286L Graphic MMU LUT entry 286 low **/
#define GFXMMU_LUT286L			MMIO32(GFXMMU_BASE + 0x18f0)
/** GFXMMU_LUT286H Graphic MMU LUT entry 286 high **/
#define GFXMMU_LUT286H			MMIO32(GFXMMU_BASE + 0x18f4)
/** GFXMMU_LUT287L Graphic MMU LUT entry 287 low **/
#define GFXMMU_LUT287L			MMIO32(GFXMMU_BASE + 0x18f8)
/** GFXMMU_LUT287H Graphic MMU LUT entry 287 high **/
#define GFXMMU_LUT287H			MMIO32(GFXMMU_BASE + 0x18fc)
/** GFXMMU_LUT288L Graphic MMU LUT entry 288 low **/
#define GFXMMU_LUT288L			MMIO32(GFXMMU_BASE + 0x1900)
/** GFXMMU_LUT288H Graphic MMU LUT entry 288 high **/
#define GFXMMU_LUT288H			MMIO32(GFXMMU_BASE + 0x1904)
/** GFXMMU_LUT289L Graphic MMU LUT entry 289 low **/
#define GFXMMU_LUT289L			MMIO32(GFXMMU_BASE + 0x1908)
/** GFXMMU_LUT289H Graphic MMU LUT entry 289 high **/
#define GFXMMU_LUT289H			MMIO32(GFXMMU_BASE + 0x190c)
/** GFXMMU_LUT290L Graphic MMU LUT entry 290 low **/
#define GFXMMU_LUT290L			MMIO32(GFXMMU_BASE + 0x1910)
/** GFXMMU_LUT290H Graphic MMU LUT entry 290 high **/
#define GFXMMU_LUT290H			MMIO32(GFXMMU_BASE + 0x1914)
/** GFXMMU_LUT291L Graphic MMU LUT entry 291 low **/
#define GFXMMU_LUT291L			MMIO32(GFXMMU_BASE + 0x1918)
/** GFXMMU_LUT291H Graphic MMU LUT entry 291 high **/
#define GFXMMU_LUT291H			MMIO32(GFXMMU_BASE + 0x191c)
/** GFXMMU_LUT292L Graphic MMU LUT entry 292 low **/
#define GFXMMU_LUT292L			MMIO32(GFXMMU_BASE + 0x1920)
/** GFXMMU_LUT292H Graphic MMU LUT entry 292 high **/
#define GFXMMU_LUT292H			MMIO32(GFXMMU_BASE + 0x1924)
/** GFXMMU_LUT293L Graphic MMU LUT entry 293 low **/
#define GFXMMU_LUT293L			MMIO32(GFXMMU_BASE + 0x1928)
/** GFXMMU_LUT293H Graphic MMU LUT entry 293 high **/
#define GFXMMU_LUT293H			MMIO32(GFXMMU_BASE + 0x192c)
/** GFXMMU_LUT294L Graphic MMU LUT entry 294 low **/
#define GFXMMU_LUT294L			MMIO32(GFXMMU_BASE + 0x1930)
/** GFXMMU_LUT294H Graphic MMU LUT entry 294 high **/
#define GFXMMU_LUT294H			MMIO32(GFXMMU_BASE + 0x1934)
/** GFXMMU_LUT295L Graphic MMU LUT entry 295 low **/
#define GFXMMU_LUT295L			MMIO32(GFXMMU_BASE + 0x1938)
/** GFXMMU_LUT295H Graphic MMU LUT entry 295 high **/
#define GFXMMU_LUT295H			MMIO32(GFXMMU_BASE + 0x193c)
/** GFXMMU_LUT296L Graphic MMU LUT entry 296 low **/
#define GFXMMU_LUT296L			MMIO32(GFXMMU_BASE + 0x1940)
/** GFXMMU_LUT296H Graphic MMU LUT entry 296 high **/
#define GFXMMU_LUT296H			MMIO32(GFXMMU_BASE + 0x1944)
/** GFXMMU_LUT297L Graphic MMU LUT entry 297 low **/
#define GFXMMU_LUT297L			MMIO32(GFXMMU_BASE + 0x1948)
/** GFXMMU_LUT297H Graphic MMU LUT entry 297 high **/
#define GFXMMU_LUT297H			MMIO32(GFXMMU_BASE + 0x194c)
/** GFXMMU_LUT298L Graphic MMU LUT entry 298 low **/
#define GFXMMU_LUT298L			MMIO32(GFXMMU_BASE + 0x1950)
/** GFXMMU_LUT298H Graphic MMU LUT entry 298 high **/
#define GFXMMU_LUT298H			MMIO32(GFXMMU_BASE + 0x1954)
/** GFXMMU_LUT299L Graphic MMU LUT entry 299 low **/
#define GFXMMU_LUT299L			MMIO32(GFXMMU_BASE + 0x1958)
/** GFXMMU_LUT299H Graphic MMU LUT entry 299 high **/
#define GFXMMU_LUT299H			MMIO32(GFXMMU_BASE + 0x195c)
/** GFXMMU_LUT300L Graphic MMU LUT entry 300 low **/
#define GFXMMU_LUT300L			MMIO32(GFXMMU_BASE + 0x1960)
/** GFXMMU_LUT300H Graphic MMU LUT entry 300 high **/
#define GFXMMU_LUT300H			MMIO32(GFXMMU_BASE + 0x1964)
/** GFXMMU_LUT301L Graphic MMU LUT entry 301 low **/
#define GFXMMU_LUT301L			MMIO32(GFXMMU_BASE + 0x1968)
/** GFXMMU_LUT301H Graphic MMU LUT entry 301 high **/
#define GFXMMU_LUT301H			MMIO32(GFXMMU_BASE + 0x196c)
/** GFXMMU_LUT302L Graphic MMU LUT entry 302 low **/
#define GFXMMU_LUT302L			MMIO32(GFXMMU_BASE + 0x1970)
/** GFXMMU_LUT302H Graphic MMU LUT entry 302 high **/
#define GFXMMU_LUT302H			MMIO32(GFXMMU_BASE + 0x1974)
/** GFXMMU_LUT303L Graphic MMU LUT entry 303 low **/
#define GFXMMU_LUT303L			MMIO32(GFXMMU_BASE + 0x1978)
/** GFXMMU_LUT303H Graphic MMU LUT entry 303 high **/
#define GFXMMU_LUT303H			MMIO32(GFXMMU_BASE + 0x197c)
/** GFXMMU_LUT304L Graphic MMU LUT entry 304 low **/
#define GFXMMU_LUT304L			MMIO32(GFXMMU_BASE + 0x1980)
/** GFXMMU_LUT304H Graphic MMU LUT entry 304 high **/
#define GFXMMU_LUT304H			MMIO32(GFXMMU_BASE + 0x1984)
/** GFXMMU_LUT305L Graphic MMU LUT entry 305 low **/
#define GFXMMU_LUT305L			MMIO32(GFXMMU_BASE + 0x1988)
/** GFXMMU_LUT305H Graphic MMU LUT entry 305 high **/
#define GFXMMU_LUT305H			MMIO32(GFXMMU_BASE + 0x198c)
/** GFXMMU_LUT306L Graphic MMU LUT entry 306 low **/
#define GFXMMU_LUT306L			MMIO32(GFXMMU_BASE + 0x1990)
/** GFXMMU_LUT306H Graphic MMU LUT entry 306 high **/
#define GFXMMU_LUT306H			MMIO32(GFXMMU_BASE + 0x1994)
/** GFXMMU_LUT307L Graphic MMU LUT entry 307 low **/
#define GFXMMU_LUT307L			MMIO32(GFXMMU_BASE + 0x1998)
/** GFXMMU_LUT307H Graphic MMU LUT entry 307 high **/
#define GFXMMU_LUT307H			MMIO32(GFXMMU_BASE + 0x199c)
/** GFXMMU_LUT308L Graphic MMU LUT entry 308 low **/
#define GFXMMU_LUT308L			MMIO32(GFXMMU_BASE + 0x19a0)
/** GFXMMU_LUT308H Graphic MMU LUT entry 308 high **/
#define GFXMMU_LUT308H			MMIO32(GFXMMU_BASE + 0x19a4)
/** GFXMMU_LUT309L Graphic MMU LUT entry 309 low **/
#define GFXMMU_LUT309L			MMIO32(GFXMMU_BASE + 0x19a8)
/** GFXMMU_LUT309H Graphic MMU LUT entry 309 high **/
#define GFXMMU_LUT309H			MMIO32(GFXMMU_BASE + 0x19ac)
/** GFXMMU_LUT310L Graphic MMU LUT entry 310 low **/
#define GFXMMU_LUT310L			MMIO32(GFXMMU_BASE + 0x19b0)
/** GFXMMU_LUT310H Graphic MMU LUT entry 310 high **/
#define GFXMMU_LUT310H			MMIO32(GFXMMU_BASE + 0x19b4)
/** GFXMMU_LUT311L Graphic MMU LUT entry 311 low **/
#define GFXMMU_LUT311L			MMIO32(GFXMMU_BASE + 0x19b8)
/** GFXMMU_LUT311H Graphic MMU LUT entry 311 high **/
#define GFXMMU_LUT311H			MMIO32(GFXMMU_BASE + 0x19bc)
/** GFXMMU_LUT312L Graphic MMU LUT entry 312 low **/
#define GFXMMU_LUT312L			MMIO32(GFXMMU_BASE + 0x19c0)
/** GFXMMU_LUT312H Graphic MMU LUT entry 312 high **/
#define GFXMMU_LUT312H			MMIO32(GFXMMU_BASE + 0x19c4)
/** GFXMMU_LUT313L Graphic MMU LUT entry 313 low **/
#define GFXMMU_LUT313L			MMIO32(GFXMMU_BASE + 0x19c8)
/** GFXMMU_LUT313H Graphic MMU LUT entry 313 high **/
#define GFXMMU_LUT313H			MMIO32(GFXMMU_BASE + 0x19cc)
/** GFXMMU_LUT314L Graphic MMU LUT entry 314 low **/
#define GFXMMU_LUT314L			MMIO32(GFXMMU_BASE + 0x19d0)
/** GFXMMU_LUT314H Graphic MMU LUT entry 314 high **/
#define GFXMMU_LUT314H			MMIO32(GFXMMU_BASE + 0x19d4)
/** GFXMMU_LUT315L Graphic MMU LUT entry 315 low **/
#define GFXMMU_LUT315L			MMIO32(GFXMMU_BASE + 0x19d8)
/** GFXMMU_LUT315H Graphic MMU LUT entry 315 high **/
#define GFXMMU_LUT315H			MMIO32(GFXMMU_BASE + 0x19dc)
/** GFXMMU_LUT316L Graphic MMU LUT entry 316 low **/
#define GFXMMU_LUT316L			MMIO32(GFXMMU_BASE + 0x19e0)
/** GFXMMU_LUT316H Graphic MMU LUT entry 316 high **/
#define GFXMMU_LUT316H			MMIO32(GFXMMU_BASE + 0x19e4)
/** GFXMMU_LUT317L Graphic MMU LUT entry 317 low **/
#define GFXMMU_LUT317L			MMIO32(GFXMMU_BASE + 0x19e8)
/** GFXMMU_LUT317H Graphic MMU LUT entry 317 high **/
#define GFXMMU_LUT317H			MMIO32(GFXMMU_BASE + 0x19ec)
/** GFXMMU_LUT318L Graphic MMU LUT entry 318 low **/
#define GFXMMU_LUT318L			MMIO32(GFXMMU_BASE + 0x19f0)
/** GFXMMU_LUT318H Graphic MMU LUT entry 318 high **/
#define GFXMMU_LUT318H			MMIO32(GFXMMU_BASE + 0x19f4)
/** GFXMMU_LUT319L Graphic MMU LUT entry 319 low **/
#define GFXMMU_LUT319L			MMIO32(GFXMMU_BASE + 0x19f8)
/** GFXMMU_LUT319H Graphic MMU LUT entry 319 high **/
#define GFXMMU_LUT319H			MMIO32(GFXMMU_BASE + 0x19fc)
/** GFXMMU_LUT320L Graphic MMU LUT entry 320 low **/
#define GFXMMU_LUT320L			MMIO32(GFXMMU_BASE + 0x1a00)
/** GFXMMU_LUT320H Graphic MMU LUT entry 320 high **/
#define GFXMMU_LUT320H			MMIO32(GFXMMU_BASE + 0x1a04)
/** GFXMMU_LUT321L Graphic MMU LUT entry 321 low **/
#define GFXMMU_LUT321L			MMIO32(GFXMMU_BASE + 0x1a08)
/** GFXMMU_LUT321H Graphic MMU LUT entry 321 high **/
#define GFXMMU_LUT321H			MMIO32(GFXMMU_BASE + 0x1a0c)
/** GFXMMU_LUT322L Graphic MMU LUT entry 322 low **/
#define GFXMMU_LUT322L			MMIO32(GFXMMU_BASE + 0x1a10)
/** GFXMMU_LUT322H Graphic MMU LUT entry 322 high **/
#define GFXMMU_LUT322H			MMIO32(GFXMMU_BASE + 0x1a14)
/** GFXMMU_LUT323L Graphic MMU LUT entry 323 low **/
#define GFXMMU_LUT323L			MMIO32(GFXMMU_BASE + 0x1a18)
/** GFXMMU_LUT323H Graphic MMU LUT entry 323 high **/
#define GFXMMU_LUT323H			MMIO32(GFXMMU_BASE + 0x1a1c)
/** GFXMMU_LUT324L Graphic MMU LUT entry 324 low **/
#define GFXMMU_LUT324L			MMIO32(GFXMMU_BASE + 0x1a20)
/** GFXMMU_LUT324H Graphic MMU LUT entry 324 high **/
#define GFXMMU_LUT324H			MMIO32(GFXMMU_BASE + 0x1a24)
/** GFXMMU_LUT325L Graphic MMU LUT entry 325 low **/
#define GFXMMU_LUT325L			MMIO32(GFXMMU_BASE + 0x1a28)
/** GFXMMU_LUT325H Graphic MMU LUT entry 325 high **/
#define GFXMMU_LUT325H			MMIO32(GFXMMU_BASE + 0x1a2c)
/** GFXMMU_LUT326L Graphic MMU LUT entry 326 low **/
#define GFXMMU_LUT326L			MMIO32(GFXMMU_BASE + 0x1a30)
/** GFXMMU_LUT326H Graphic MMU LUT entry 326 high **/
#define GFXMMU_LUT326H			MMIO32(GFXMMU_BASE + 0x1a34)
/** GFXMMU_LUT327L Graphic MMU LUT entry 327 low **/
#define GFXMMU_LUT327L			MMIO32(GFXMMU_BASE + 0x1a38)
/** GFXMMU_LUT327H Graphic MMU LUT entry 327 high **/
#define GFXMMU_LUT327H			MMIO32(GFXMMU_BASE + 0x1a3c)
/** GFXMMU_LUT328L Graphic MMU LUT entry 328 low **/
#define GFXMMU_LUT328L			MMIO32(GFXMMU_BASE + 0x1a40)
/** GFXMMU_LUT328H Graphic MMU LUT entry 328 high **/
#define GFXMMU_LUT328H			MMIO32(GFXMMU_BASE + 0x1a44)
/** GFXMMU_LUT329L Graphic MMU LUT entry 329 low **/
#define GFXMMU_LUT329L			MMIO32(GFXMMU_BASE + 0x1a48)
/** GFXMMU_LUT329H Graphic MMU LUT entry 329 high **/
#define GFXMMU_LUT329H			MMIO32(GFXMMU_BASE + 0x1a4c)
/** GFXMMU_LUT330L Graphic MMU LUT entry 330 low **/
#define GFXMMU_LUT330L			MMIO32(GFXMMU_BASE + 0x1a50)
/** GFXMMU_LUT330H Graphic MMU LUT entry 330 high **/
#define GFXMMU_LUT330H			MMIO32(GFXMMU_BASE + 0x1a54)
/** GFXMMU_LUT331L Graphic MMU LUT entry 331 low **/
#define GFXMMU_LUT331L			MMIO32(GFXMMU_BASE + 0x1a58)
