grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT331H Graphic MMU LUT entry 331 high **/
#define GFXMMU_LUT331H			MMIO32(GFXMMU_BASE + 0x1a5c)
/** GFXMMU_LUT332L Graphic MMU LUT entry 332 low **/
#define GFXMMU_LUT332L			MMIO32(GFXMMU_BASE + 0x1a60)
/** GFXMMU_LUT332H Graphic MMU LUT entry 332 high **/
#define GFXMMU_LUT332H			MMIO32(GFXMMU_BASE + 0x1a64)
/** GFXMMU_LUT333L Graphic MMU LUT entry 333 low **/
#define GFXMMU_LUT333L			MMIO32(GFXMMU_BASE + 0x1a68)
/** GFXMMU_LUT333H Graphic MMU LUT entry 333 high **/
#define GFXMMU_LUT333H			MMIO32(GFXMMU_BASE + 0x1a6c)
/** GFXMMU_LUT334L Graphic MMU LUT entry 334 low **/
#define GFXMMU_LUT334L			MMIO32(GFXMMU_BASE + 0x1a70)
/** GFXMMU_LUT334H Graphic MMU LUT entry 334 high **/
#define GFXMMU_LUT334H			MMIO32(GFXMMU_BASE + 0x1a74)
/** GFXMMU_LUT335L Graphic MMU LUT entry 335 low **/
#define GFXMMU_LUT335L			MMIO32(GFXMMU_BASE + 0x1a78)
/** GFXMMU_LUT335H Graphic MMU LUT entry 335 high **/
#define GFXMMU_LUT335H			MMIO32(GFXMMU_BASE + 0x1a7c)
/** GFXMMU_LUT336L Graphic MMU LUT entry 336 low **/
#define GFXMMU_LUT336L			MMIO32(GFXMMU_BASE + 0x1a80)
/** GFXMMU_LUT336H Graphic MMU LUT entry 336 high **/
#define GFXMMU_LUT336H			MMIO32(GFXMMU_BASE + 0x1a84)
/** GFXMMU_LUT337L Graphic MMU LUT entry 337 low **/
#define GFXMMU_LUT337L			MMIO32(GFXMMU_BASE + 0x1a88)
/** GFXMMU_LUT337H Graphic MMU LUT entry 337 high **/
#define GFXMMU_LUT337H			MMIO32(GFXMMU_BASE + 0x1a8c)
/** GFXMMU_LUT338L Graphic MMU LUT entry 338 low **/
#define GFXMMU_LUT338L			MMIO32(GFXMMU_BASE + 0x1a90)
/** GFXMMU_LUT338H Graphic MMU LUT entry 338 high **/
#define GFXMMU_LUT338H			MMIO32(GFXMMU_BASE + 0x1a94)
/** GFXMMU_LUT339L Graphic MMU LUT entry 339 low **/
#define GFXMMU_LUT339L			MMIO32(GFXMMU_BASE + 0x1a98)
/** GFXMMU_LUT339H Graphic MMU LUT entry 339 high **/
#define GFXMMU_LUT339H			MMIO32(GFXMMU_BASE + 0x1a9c)
/** GFXMMU_LUT340L Graphic MMU LUT entry 340 low **/
#define GFXMMU_LUT340L			MMIO32(GFXMMU_BASE + 0x1aa0)
/** GFXMMU_LUT340H Graphic MMU LUT entry 340 high **/
#define GFXMMU_LUT340H			MMIO32(GFXMMU_BASE + 0x1aa4)
/** GFXMMU_LUT341L Graphic MMU LUT entry 341 low **/
#define GFXMMU_LUT341L			MMIO32(GFXMMU_BASE + 0x1aa8)
/** GFXMMU_LUT341H Graphic MMU LUT entry 341 high **/
#define GFXMMU_LUT341H			MMIO32(GFXMMU_BASE + 0x1aac)
/** GFXMMU_LUT342L Graphic MMU LUT entry 342 low **/
#define GFXMMU_LUT342L			MMIO32(GFXMMU_BASE + 0x1ab0)
/** GFXMMU_LUT342H Graphic MMU LUT entry 342 high **/
#define GFXMMU_LUT342H			MMIO32(GFXMMU_BASE + 0x1ab4)
/** GFXMMU_LUT343L Graphic MMU LUT entry 343 low **/
#define GFXMMU_LUT343L			MMIO32(GFXMMU_BASE + 0x1ab8)
/** GFXMMU_LUT343H Graphic MMU LUT entry 343 high **/
#define GFXMMU_LUT343H			MMIO32(GFXMMU_BASE + 0x1abc)
/** GFXMMU_LUT344L Graphic MMU LUT entry 344 low **/
#define GFXMMU_LUT344L			MMIO32(GFXMMU_BASE + 0x1ac0)
/** GFXMMU_LUT344H Graphic MMU LUT entry 344 high **/
#define GFXMMU_LUT344H			MMIO32(GFXMMU_BASE + 0x1ac4)
/** GFXMMU_LUT345L Graphic MMU LUT entry 345 low **/
#define GFXMMU_LUT345L			MMIO32(GFXMMU_BASE + 0x1ac8)
/** GFXMMU_LUT345H Graphic MMU LUT entry 345 high **/
#define GFXMMU_LUT345H			MMIO32(GFXMMU_BASE + 0x1acc)
/** GFXMMU_LUT346L Graphic MMU LUT entry 346 low **/
#define GFXMMU_LUT346L			MMIO32(GFXMMU_BASE + 0x1ad0)
/** GFXMMU_LUT346H Graphic MMU LUT entry 346 high **/
#define GFXMMU_LUT346H			MMIO32(GFXMMU_BASE + 0x1ad4)
/** GFXMMU_LUT347L Graphic MMU LUT entry 347 low **/
#define GFXMMU_LUT347L			MMIO32(GFXMMU_BASE + 0x1ad8)
/** GFXMMU_LUT347H Graphic MMU LUT entry 347 high **/
#define GFXMMU_LUT347H			MMIO32(GFXMMU_BASE + 0x1adc)
/** GFXMMU_LUT348L Graphic MMU LUT entry 348 low **/
#define GFXMMU_LUT348L			MMIO32(GFXMMU_BASE + 0x1ae0)
/** GFXMMU_LUT348H Graphic MMU LUT entry 348 high **/
#define GFXMMU_LUT348H			MMIO32(GFXMMU_BASE + 0x1ae4)
/** GFXMMU_LUT349L Graphic MMU LUT entry 349 low **/
#define GFXMMU_LUT349L			MMIO32(GFXMMU_BASE + 0x1ae8)
/** GFXMMU_LUT349H Graphic MMU LUT entry 349 high **/
#define GFXMMU_LUT349H			MMIO32(GFXMMU_BASE + 0x1aec)
/** GFXMMU_LUT350L Graphic MMU LUT entry 350 low **/
#define GFXMMU_LUT350L			MMIO32(GFXMMU_BASE + 0x1af0)
/** GFXMMU_LUT350H Graphic MMU LUT entry 350 high **/
#define GFXMMU_LUT350H			MMIO32(GFXMMU_BASE + 0x1af4)
/** GFXMMU_LUT351L Graphic MMU LUT entry 351 low **/
#define GFXMMU_LUT351L			MMIO32(GFXMMU_BASE + 0x1af8)
/** GFXMMU_LUT351H Graphic MMU LUT entry 351 high **/
#define GFXMMU_LUT351H			MMIO32(GFXMMU_BASE + 0x1afc)
/** GFXMMU_LUT352L Graphic MMU LUT entry 352 low **/
#define GFXMMU_LUT352L			MMIO32(GFXMMU_BASE + 0x1b00)
/** GFXMMU_LUT352H Graphic MMU LUT entry 352 high **/
#define GFXMMU_LUT352H			MMIO32(GFXMMU_BASE + 0x1b04)
/** GFXMMU_LUT353L Graphic MMU LUT entry 353 low **/
#define GFXMMU_LUT353L			MMIO32(GFXMMU_BASE + 0x1b08)
/** GFXMMU_LUT353H Graphic MMU LUT entry 353 high **/
#define GFXMMU_LUT353H			MMIO32(GFXMMU_BASE + 0x1b0c)
/** GFXMMU_LUT354L Graphic MMU LUT entry 354 low **/
#define GFXMMU_LUT354L			MMIO32(GFXMMU_BASE + 0x1b10)
/** GFXMMU_LUT354H Graphic MMU LUT entry 354 high **/
#define GFXMMU_LUT354H			MMIO32(GFXMMU_BASE + 0x1b14)
/** GFXMMU_LUT355L Graphic MMU LUT entry 355 low **/
#define GFXMMU_LUT355L			MMIO32(GFXMMU_BASE + 0x1b18)
/** GFXMMU_LUT355H Graphic MMU LUT entry 355 high **/
#define GFXMMU_LUT355H			MMIO32(GFXMMU_BASE + 0x1b1c)
/** GFXMMU_LUT356L Graphic MMU LUT entry 356 low **/
#define GFXMMU_LUT356L			MMIO32(GFXMMU_BASE + 0x1b20)
/** GFXMMU_LUT356H Graphic MMU LUT entry 356 high **/
#define GFXMMU_LUT356H			MMIO32(GFXMMU_BASE + 0x1b24)
/** GFXMMU_LUT357L Graphic MMU LUT entry 357 low **/
#define GFXMMU_LUT357L			MMIO32(GFXMMU_BASE + 0x1b28)
/** GFXMMU_LUT357H Graphic MMU LUT entry 357 high **/
#define GFXMMU_LUT357H			MMIO32(GFXMMU_BASE + 0x1b2c)
/** GFXMMU_LUT358L Graphic MMU LUT entry 358 low **/
#define GFXMMU_LUT358L			MMIO32(GFXMMU_BASE + 0x1b30)
/** GFXMMU_LUT358H Graphic MMU LUT entry 358 high **/
#define GFXMMU_LUT358H			MMIO32(GFXMMU_BASE + 0x1b34)
/** GFXMMU_LUT359L Graphic MMU LUT entry 359 low **/
#define GFXMMU_LUT359L			MMIO32(GFXMMU_BASE + 0x1b38)
/** GFXMMU_LUT359H Graphic MMU LUT entry 359 high **/
#define GFXMMU_LUT359H			MMIO32(GFXMMU_BASE + 0x1b3c)
/** GFXMMU_LUT360L Graphic MMU LUT entry 360 low **/
#define GFXMMU_LUT360L			MMIO32(GFXMMU_BASE + 0x1b40)
/** GFXMMU_LUT360H Graphic MMU LUT entry 360 high **/
#define GFXMMU_LUT360H			MMIO32(GFXMMU_BASE + 0x1b44)
/** GFXMMU_LUT361L Graphic MMU LUT entry 361 low **/
#define GFXMMU_LUT361L			MMIO32(GFXMMU_BASE + 0x1b48)
/** GFXMMU_LUT361H Graphic MMU LUT entry 361 high **/
#define GFXMMU_LUT361H			MMIO32(GFXMMU_BASE + 0x1b4c)
/** GFXMMU_LUT362L Graphic MMU LUT entry 362 low **/
#define GFXMMU_LUT362L			MMIO32(GFXMMU_BASE + 0x1b50)
/** GFXMMU_LUT362H Graphic MMU LUT entry 362 high **/
#define GFXMMU_LUT362H			MMIO32(GFXMMU_BASE + 0x1b54)
/** GFXMMU_LUT363L Graphic MMU LUT entry 363 low **/
#define GFXMMU_LUT363L			MMIO32(GFXMMU_BASE + 0x1b58)
/** GFXMMU_LUT363H Graphic MMU LUT entry 363 high **/
#define GFXMMU_LUT363H			MMIO32(GFXMMU_BASE + 0x1b5c)
/** GFXMMU_LUT364L Graphic MMU LUT entry 364 low **/
#define GFXMMU_LUT364L			MMIO32(GFXMMU_BASE + 0x1b60)
/** GFXMMU_LUT364H Graphic MMU LUT entry 364 high **/
#define GFXMMU_LUT364H			MMIO32(GFXMMU_BASE + 0x1b64)
/** GFXMMU_LUT365L Graphic MMU LUT entry 365 low **/
#define GFXMMU_LUT365L			MMIO32(GFXMMU_BASE + 0x1b68)
/** GFXMMU_LUT365H Graphic MMU LUT entry 365 high **/
#define GFXMMU_LUT365H			MMIO32(GFXMMU_BASE + 0x1b6c)
/** GFXMMU_LUT366L Graphic MMU LUT entry 366 low **/
#define GFXMMU_LUT366L			MMIO32(GFXMMU_BASE + 0x1b70)
/** GFXMMU_LUT366H Graphic MMU LUT entry 366 high **/
#define GFXMMU_LUT366H			MMIO32(GFXMMU_BASE + 0x1b74)
/** GFXMMU_LUT367L Graphic MMU LUT entry 367 low **/
#define GFXMMU_LUT367L			MMIO32(GFXMMU_BASE + 0x1b78)
/** GFXMMU_LUT367H Graphic MMU LUT entry 367 high **/
#define GFXMMU_LUT367H			MMIO32(GFXMMU_BASE + 0x1b7c)
/** GFXMMU_LUT368L Graphic MMU LUT entry 368 low **/
#define GFXMMU_LUT368L			MMIO32(GFXMMU_BASE + 0x1b80)
/** GFXMMU_LUT368H Graphic MMU LUT entry 368 high **/
#define GFXMMU_LUT368H			MMIO32(GFXMMU_BASE + 0x1b84)
/** GFXMMU_LUT369L Graphic MMU LUT entry 369 low **/
#define GFXMMU_LUT369L			MMIO32(GFXMMU_BASE + 0x1b88)
/** GFXMMU_LUT369H Graphic MMU LUT entry 369 high **/
#define GFXMMU_LUT369H			MMIO32(GFXMMU_BASE + 0x1b8c)
/** GFXMMU_LUT370L Graphic MMU LUT entry 370 low **/
#define GFXMMU_LUT370L			MMIO32(GFXMMU_BASE + 0x1b90)
/** GFXMMU_LUT370H Graphic MMU LUT entry 370 high **/
#define GFXMMU_LUT370H			MMIO32(GFXMMU_BASE + 0x1b94)
/** GFXMMU_LUT371L Graphic MMU LUT entry 371 low **/
#define GFXMMU_LUT371L			MMIO32(GFXMMU_BASE + 0x1b98)
/** GFXMMU_LUT371H Graphic MMU LUT entry 371 high **/
#define GFXMMU_LUT371H			MMIO32(GFXMMU_BASE + 0x1b9c)
/** GFXMMU_LUT372L Graphic MMU LUT entry 372 low **/
#define GFXMMU_LUT372L			MMIO32(GFXMMU_BASE + 0x1ba0)
/** GFXMMU_LUT372H Graphic MMU LUT entry 372 high **/
#define GFXMMU_LUT372H			MMIO32(GFXMMU_BASE + 0x1ba4)
/** GFXMMU_LUT373L Graphic MMU LUT entry 373 low **/
#define GFXMMU_LUT373L			MMIO32(GFXMMU_BASE + 0x1ba8)
/** GFXMMU_LUT373H Graphic MMU LUT entry 373 high **/
#define GFXMMU_LUT373H			MMIO32(GFXMMU_BASE + 0x1bac)
/** GFXMMU_LUT374L Graphic MMU LUT entry 374 low **/
#define GFXMMU_LUT374L			MMIO32(GFXMMU_BASE + 0x1bb0)
/** GFXMMU_LUT374H Graphic MMU LUT entry 374 high **/
#define GFXMMU_LUT374H			MMIO32(GFXMMU_BASE + 0x1bb4)
/** GFXMMU_LUT375L Graphic MMU LUT entry 375 low **/
#define GFXMMU_LUT375L			MMIO32(GFXMMU_BASE + 0x1bb8)
/** GFXMMU_LUT375H Graphic MMU LUT entry 375 high **/
#define GFXMMU_LUT375H			MMIO32(GFXMMU_BASE + 0x1bbc)
/** GFXMMU_LUT376L Graphic MMU LUT entry 376 low **/
#define GFXMMU_LUT376L			MMIO32(GFXMMU_BASE + 0x1bc0)
/** GFXMMU_LUT376H Graphic MMU LUT entry 376 high **/
#define GFXMMU_LUT376H			MMIO32(GFXMMU_BASE + 0x1bc4)
/** GFXMMU_LUT377L Graphic MMU LUT entry 377 low **/
#define GFXMMU_LUT377L			MMIO32(GFXMMU_BASE + 0x1bc8)
/** GFXMMU_LUT377H Graphic MMU LUT entry 377 high **/
#define GFXMMU_LUT377H			MMIO32(GFXMMU_BASE + 0x1bcc)
/** GFXMMU_LUT378L Graphic MMU LUT entry 378 low **/
#define GFXMMU_LUT378L			MMIO32(GFXMMU_BASE + 0x1bd0)
/** GFXMMU_LUT378H Graphic MMU LUT entry 378 high **/
#define GFXMMU_LUT378H			MMIO32(GFXMMU_BASE + 0x1bd4)
/** GFXMMU_LUT379L Graphic MMU LUT entry 379 low **/
#define GFXMMU_LUT379L			MMIO32(GFXMMU_BASE + 0x1bd8)
/** GFXMMU_LUT379H Graphic MMU LUT entry 379 high **/
#define GFXMMU_LUT379H			MMIO32(GFXMMU_BASE + 0x1bdc)
/** GFXMMU_LUT380L Graphic MMU LUT entry 380 low **/
#define GFXMMU_LUT380L			MMIO32(GFXMMU_BASE + 0x1be0)
/** GFXMMU_LUT380H Graphic MMU LUT entry 380 high **/
#define GFXMMU_LUT380H			MMIO32(GFXMMU_BASE + 0x1be4)
/** GFXMMU_LUT381L Graphic MMU LUT entry 381 low **/
#define GFXMMU_LUT381L			MMIO32(GFXMMU_BASE + 0x1be8)
/** GFXMMU_LUT381H Graphic MMU LUT entry 381 high **/
#define GFXMMU_LUT381H			MMIO32(GFXMMU_BASE + 0x1bec)
/** GFXMMU_LUT382L Graphic MMU LUT entry 382 low **/
#define GFXMMU_LUT382L			MMIO32(GFXMMU_BASE + 0x1bf0)
/** GFXMMU_LUT382H Graphic MMU LUT entry 382 high **/
#define GFXMMU_LUT382H			MMIO32(GFXMMU_BASE + 0x1bf4)
/** GFXMMU_LUT383L Graphic MMU LUT entry 383 low **/
#define GFXMMU_LUT383L			MMIO32(GFXMMU_BASE + 0x1bf8)
/** GFXMMU_LUT383H Graphic MMU LUT entry 383 high **/
#define GFXMMU_LUT383H			MMIO32(GFXMMU_BASE + 0x1bfc)
/** GFXMMU_LUT384L Graphic MMU LUT entry 384 low **/
#define GFXMMU_LUT384L			MMIO32(GFXMMU_BASE + 0x1c00)
/** GFXMMU_LUT384H Graphic MMU LUT entry 384 high **/
#define GFXMMU_LUT384H			MMIO32(GFXMMU_BASE + 0x1c04)
/** GFXMMU_LUT385L Graphic MMU LUT entry 385 low **/
#define GFXMMU_LUT385L			MMIO32(GFXMMU_BASE + 0x1c08)
/** GFXMMU_LUT385H Graphic MMU LUT entry 385 high **/
#define GFXMMU_LUT385H			MMIO32(GFXMMU_BASE + 0x1c0c)
/** GFXMMU_LUT386L Graphic MMU LUT entry 386 low **/
#define GFXMMU_LUT386L			MMIO32(GFXMMU_BASE + 0x1c10)
/** GFXMMU_LUT386H Graphic MMU LUT entry 386 high **/
#define GFXMMU_LUT386H			MMIO32(GFXMMU_BASE + 0x1c14)
/** GFXMMU_LUT387L Graphic MMU LUT entry 387 low **/
#define GFXMMU_LUT387L			MMIO32(GFXMMU_BASE + 0x1c18)
/** GFXMMU_LUT387H Graphic MMU LUT entry 387 high **/
#define GFXMMU_LUT387H			MMIO32(GFXMMU_BASE + 0x1c1c)
/** GFXMMU_LUT388L Graphic MMU LUT entry 388 low **/
#define GFXMMU_LUT388L			MMIO32(GFXMMU_BASE + 0x1c20)
/** GFXMMU_LUT388H Graphic MMU LUT entry 388 high **/
#define GFXMMU_LUT388H			MMIO32(GFXMMU_BASE + 0x1c24)
/** GFXMMU_LUT389L Graphic MMU LUT entry 389 low **/
#define GFXMMU_LUT389L			MMIO32(GFXMMU_BASE + 0x1c28)
/** GFXMMU_LUT389H Graphic MMU LUT entry 389 high **/
#define GFXMMU_LUT389H			MMIO32(GFXMMU_BASE + 0x1c2c)
/** GFXMMU_LUT390L Graphic MMU LUT entry 390 low **/
#define GFXMMU_LUT390L			MMIO32(GFXMMU_BASE + 0x1c30)
/** GFXMMU_LUT390H Graphic MMU LUT entry 390 high **/
#define GFXMMU_LUT390H			MMIO32(GFXMMU_BASE + 0x1c34)
/** GFXMMU_LUT391L Graphic MMU LUT entry 391 low **/
#define GFXMMU_LUT391L			MMIO32(GFXMMU_BASE + 0x1c38)
/** GFXMMU_LUT391H Graphic MMU LUT entry 391 high **/
#define GFXMMU_LUT391H			MMIO32(GFXMMU_BASE + 0x1c3c)
/** GFXMMU_LUT392L Graphic MMU LUT entry 392 low **/
#define GFXMMU_LUT392L			MMIO32(GFXMMU_BASE + 0x1c40)
/** GFXMMU_LUT392H Graphic MMU LUT entry 392 high **/
#define GFXMMU_LUT392H			MMIO32(GFXMMU_BASE + 0x1c44)
/** GFXMMU_LUT393L Graphic MMU LUT entry 393 low **/
#define GFXMMU_LUT393L			MMIO32(GFXMMU_BASE + 0x1c48)
/** GFXMMU_LUT393H Graphic MMU LUT entry 393 high **/
#define GFXMMU_LUT393H			MMIO32(GFXMMU_BASE + 0x1c4c)
/** GFXMMU_LUT394L Graphic MMU LUT entry 394 low **/
#define GFXMMU_LUT394L			MMIO32(GFXMMU_BASE + 0x1c50)
/** GFXMMU_LUT394H Graphic MMU LUT entry 394 high **/
#define GFXMMU_LUT394H			MMIO32(GFXMMU_BASE + 0x1c54)
/** GFXMMU_LUT395L Graphic MMU LUT entry 395 low **/
#define GFXMMU_LUT395L			MMIO32(GFXMMU_BASE + 0x1c58)
/** GFXMMU_LUT395H Graphic MMU LUT entry 395 high **/
#define GFXMMU_LUT395H			MMIO32(GFXMMU_BASE + 0x1c5c)
/** GFXMMU_LUT396L Graphic MMU LUT entry 396 low **/
#define GFXMMU_LUT396L			MMIO32(GFXMMU_BASE + 0x1c60)
/** GFXMMU_LUT396H Graphic MMU LUT entry 396 high **/
#define GFXMMU_LUT396H			MMIO32(GFXMMU_BASE + 0x1c64)
/** GFXMMU_LUT397L Graphic MMU LUT entry 397 low **/
#define GFXMMU_LUT397L			MMIO32(GFXMMU_BASE + 0x1c68)
/** GFXMMU_LUT397H Graphic MMU LUT entry 397 high **/
#define GFXMMU_LUT397H			MMIO32(GFXMMU_BASE + 0x1c6c)
/** GFXMMU_LUT398L Graphic MMU LUT entry 398 low **/
#define GFXMMU_LUT398L			MMIO32(GFXMMU_BASE + 0x1c70)
/** GFXMMU_LUT398H Graphic MMU LUT entry 398 high **/
#define GFXMMU_LUT398H			MMIO32(GFXMMU_BASE + 0x1c74)
/** GFXMMU_LUT399L Graphic MMU LUT entry 399 low **/
#define GFXMMU_LUT399L			MMIO32(GFXMMU_BASE + 0x1c78)
/** GFXMMU_LUT399H Graphic MMU LUT entry 399 high **/
#define GFXMMU_LUT399H			MMIO32(GFXMMU_BASE + 0x1c7c)
/** GFXMMU_LUT400L Graphic MMU LUT entry 400 low **/
#define GFXMMU_LUT400L			MMIO32(GFXMMU_BASE + 0x1c80)
/** GFXMMU_LUT400H Graphic MMU LUT entry 400 high **/
#define GFXMMU_LUT400H			MMIO32(GFXMMU_BASE + 0x1c84)
/** GFXMMU_LUT401L Graphic MMU LUT entry 401 low **/
#define GFXMMU_LUT401L			MMIO32(GFXMMU_BASE + 0x1c88)
/** GFXMMU_LUT401H Graphic MMU LUT entry 401 high **/
#define GFXMMU_LUT401H			MMIO32(GFXMMU_BASE + 0x1c8c)
/** GFXMMU_LUT402L Graphic MMU LUT entry 402 low **/
#define GFXMMU_LUT402L			MMIO32(GFXMMU_BASE + 0x1c90)
/** GFXMMU_LUT402H Graphic MMU LUT entry 402 high **/
#define GFXMMU_LUT402H			MMIO32(GFXMMU_BASE + 0x1c94)
/** GFXMMU_LUT403L Graphic MMU LUT entry 403 low **/
#define GFXMMU_LUT403L			MMIO32(GFXMMU_BASE + 0x1c98)
/** GFXMMU_LUT403H Graphic MMU LUT entry 403 high **/
#define GFXMMU_LUT403H			MMIO32(GFXMMU_BASE + 0x1c9c)
/** GFXMMU_LUT404L Graphic MMU LUT entry 404 low **/
#define GFXMMU_LUT404L			MMIO32(GFXMMU_BASE + 0x1ca0)
/** GFXMMU_LUT404H Graphic MMU LUT entry 404 high **/
#define GFXMMU_LUT404H			MMIO32(GFXMMU_BASE + 0x1ca4)
/** GFXMMU_LUT405L Graphic MMU LUT entry 405 low **/
#define GFXMMU_LUT405L			MMIO32(GFXMMU_BASE + 0x1ca8)
/** GFXMMU_LUT405H Graphic MMU LUT entry 405 high **/
#define GFXMMU_LUT405H			MMIO32(GFXMMU_BASE + 0x1cac)
/** GFXMMU_LUT406L Graphic MMU LUT entry 406 low **/
#define GFXMMU_LUT406L			MMIO32(GFXMMU_BASE + 0x1cb0)
/** GFXMMU_LUT406H Graphic MMU LUT entry 406 high **/
#define GFXMMU_LUT406H			MMIO32(GFXMMU_BASE + 0x1cb4)
/** GFXMMU_LUT407L Graphic MMU LUT entry 407 low **/
#define GFXMMU_LUT407L			MMIO32(GFXMMU_BASE + 0x1cb8)
/** GFXMMU_LUT407H Graphic MMU LUT entry 407 high **/
#define GFXMMU_LUT407H			MMIO32(GFXMMU_BASE + 0x1cbc)
/** GFXMMU_LUT408L Graphic MMU LUT entry 408 low **/
#define GFXMMU_LUT408L			MMIO32(GFXMMU_BASE + 0x1cc0)
/** GFXMMU_LUT408H Graphic MMU LUT entry 408 high **/
#define GFXMMU_LUT408H			MMIO32(GFXMMU_BASE + 0x1cc4)
/** GFXMMU_LUT409L Graphic MMU LUT entry 409 low **/
#define GFXMMU_LUT409L			MMIO32(GFXMMU_BASE + 0x1cc8)
/** GFXMMU_LUT409H Graphic MMU LUT entry 409 high **/
#define GFXMMU_LUT409H			MMIO32(GFXMMU_BASE + 0x1ccc)
/** GFXMMU_LUT410L Graphic MMU LUT entry 410 low **/
#define GFXMMU_LUT410L			MMIO32(GFXMMU_BASE + 0x1cd0)
/** GFXMMU_LUT410H Graphic MMU LUT entry 410 high **/
#define GFXMMU_LUT410H			MMIO32(GFXMMU_BASE + 0x1cd4)
/** GFXMMU_LUT411L Graphic MMU LUT entry 411 low **/
#define GFXMMU_LUT411L			MMIO32(GFXMMU_BASE + 0x1cd8)
/** GFXMMU_LUT411H Graphic MMU LUT entry 411 high **/
#define GFXMMU_LUT411H			MMIO32(GFXMMU_BASE + 0x1cdc)
/** GFXMMU_LUT412L Graphic MMU LUT entry 412 low **/
#define GFXMMU_LUT412L			MMIO32(GFXMMU_BASE + 0x1ce0)
/** GFXMMU_LUT412H Graphic MMU LUT entry 412 high **/
#define GFXMMU_LUT412H			MMIO32(GFXMMU_BASE + 0x1ce4)
/** GFXMMU_LUT413L Graphic MMU LUT entry 413 low **/
#define GFXMMU_LUT413L			MMIO32(GFXMMU_BASE + 0x1ce8)
/** GFXMMU_LUT413H Graphic MMU LUT entry 413 high **/
#define GFXMMU_LUT413H			MMIO32(GFXMMU_BASE + 0x1cec)
/** GFXMMU_LUT414L Graphic MMU LUT entry 414 low **/
#define GFXMMU_LUT414L			MMIO32(GFXMMU_BASE + 0x1cf0)
/** GFXMMU_LUT414H Graphic MMU LUT entry 414 high **/
#define GFXMMU_LUT414H			MMIO32(GFXMMU_BASE + 0x1cf4)
/** GFXMMU_LUT415L Graphic MMU LUT entry 415 low **/
#define GFXMMU_LUT415L			MMIO32(GFXMMU_BASE + 0x1cf8)
/** GFXMMU_LUT415H Graphic MMU LUT entry 415 high **/
#define GFXMMU_LUT415H			MMIO32(GFXMMU_BASE + 0x1cfc)
/** GFXMMU_LUT416L Graphic MMU LUT entry 416 low **/
#define GFXMMU_LUT416L			MMIO32(GFXMMU_BASE + 0x1d00)
/** GFXMMU_LUT416H Graphic MMU LUT entry 416 high **/
#define GFXMMU_LUT416H			MMIO32(GFXMMU_BASE + 0x1d04)
/** GFXMMU_LUT417L Graphic MMU LUT entry 417 low **/
#define GFXMMU_LUT417L			MMIO32(GFXMMU_BASE + 0x1d08)
/** GFXMMU_LUT417H Graphic MMU LUT entry 417 high **/
#define GFXMMU_LUT417H			MMIO32(GFXMMU_BASE + 0x1d0c)
/** GFXMMU_LUT418L Graphic MMU LUT entry 418 low **/
#define GFXMMU_LUT418L			MMIO32(GFXMMU_BASE + 0x1d10)
/** GFXMMU_LUT418H Graphic MMU LUT entry 418 high **/
#define GFXMMU_LUT418H			MMIO32(GFXMMU_BASE + 0x1d14)
/** GFXMMU_LUT419L Graphic MMU LUT entry 419 low **/
#define GFXMMU_LUT419L			MMIO32(GFXMMU_BASE + 0x1d18)
/** GFXMMU_LUT419H Graphic MMU LUT entry 419 high **/
#define GFXMMU_LUT419H			MMIO32(GFXMMU_BASE + 0x1d1c)
/** GFXMMU_LUT420L Graphic MMU LUT entry 420 low **/
#define GFXMMU_LUT420L			MMIO32(GFXMMU_BASE + 0x1d20)
/** GFXMMU_LUT420H Graphic MMU LUT entry 420 high **/
#define GFXMMU_LUT420H			MMIO32(GFXMMU_BASE + 0x1d24)
/** GFXMMU_LUT421L Graphic MMU LUT entry 421 low **/
#define GFXMMU_LUT421L			MMIO32(GFXMMU_BASE + 0x1d28)
/** GFXMMU_LUT421H Graphic MMU LUT entry 421 high **/
#define GFXMMU_LUT421H			MMIO32(GFXMMU_BASE + 0x1d2c)
/** GFXMMU_LUT422L Graphic MMU LUT entry 422 low **/
#define GFXMMU_LUT422L			MMIO32(GFXMMU_BASE + 0x1d30)
/** GFXMMU_LUT422H Graphic MMU LUT entry 422 high **/
#define GFXMMU_LUT422H			MMIO32(GFXMMU_BASE + 0x1d34)
/** GFXMMU_LUT423L Graphic MMU LUT entry 423 low **/
#define GFXMMU_LUT423L			MMIO32(GFXMMU_BASE + 0x1d38)
/** GFXMMU_LUT423H Graphic MMU LUT entry 423 high **/
#define GFXMMU_LUT423H			MMIO32(GFXMMU_BASE + 0x1d3c)
/** GFXMMU_LUT424L Graphic MMU LUT entry 424 low **/
#define GFXMMU_LUT424L			MMIO32(GFXMMU_BASE + 0x1d40)
/** GFXMMU_LUT424H Graphic MMU LUT entry 424 high **/
#define GFXMMU_LUT424H			MMIO32(GFXMMU_BASE + 0x1d44)
/** GFXMMU_LUT425L Graphic MMU LUT entry 425 low **/
#define GFXMMU_LUT425L			MMIO32(GFXMMU_BASE + 0x1d48)
/** GFXMMU_LUT425H Graphic MMU LUT entry 425 high **/
#define GFXMMU_LUT425H			MMIO32(GFXMMU_BASE + 0x1d4c)
/** GFXMMU_LUT426L Graphic MMU LUT entry 426 low **/
#define GFXMMU_LUT426L			MMIO32(GFXMMU_BASE + 0x1d50)
/** GFXMMU_LUT426H Graphic MMU LUT entry 426 high **/
#define GFXMMU_LUT426H			MMIO32(GFXMMU_BASE + 0x1d54)
/** GFXMMU_LUT427L Graphic MMU LUT entry 427 low **/
#define GFXMMU_LUT427L			MMIO32(GFXMMU_BASE + 0x1d58)
/** GFXMMU_LUT427H Graphic MMU LUT entry 427 high **/
#define GFXMMU_LUT427H			MMIO32(GFXMMU_BASE + 0x1d5c)
/** GFXMMU_LUT428L Graphic MMU LUT entry 428 low **/
#define GFXMMU_LUT428L			MMIO32(GFXMMU_BASE + 0x1d60)
/** GFXMMU_LUT428H Graphic MMU LUT entry 428 high **/
#define GFXMMU_LUT428H			MMIO32(GFXMMU_BASE + 0x1d64)
/** GFXMMU_LUT429L Graphic MMU LUT entry 429 low **/
#define GFXMMU_LUT429L			MMIO32(GFXMMU_BASE + 0x1d68)
/** GFXMMU_LUT429H Graphic MMU LUT entry 429 high **/
#define GFXMMU_LUT429H			MMIO32(GFXMMU_BASE + 0x1d6c)
/** GFXMMU_LUT430L Graphic MMU LUT entry 430 low **/
#define GFXMMU_LUT430L			MMIO32(GFXMMU_BASE + 0x1d70)
/** GFXMMU_LUT430H Graphic MMU LUT entry 430 high **/
#define GFXMMU_LUT430H			MMIO32(GFXMMU_BASE + 0x1d74)
/** GFXMMU_LUT431L Graphic MMU LUT entry 431 low **/
#define GFXMMU_LUT431L			MMIO32(GFXMMU_BASE + 0x1d78)
/** GFXMMU_LUT431H Graphic MMU LUT entry 431 high **/
#define GFXMMU_LUT431H			MMIO32(GFXMMU_BASE + 0x1d7c)
/** GFXMMU_LUT432L Graphic MMU LUT entry 432 low **/
#define GFXMMU_LUT432L			MMIO32(GFXMMU_BASE + 0x1d80)
/** GFXMMU_LUT432H Graphic MMU LUT entry 432 high **/
#define GFXMMU_LUT432H			MMIO32(GFXMMU_BASE + 0x1d84)
/** GFXMMU_LUT433L Graphic MMU LUT entry 433 low **/
#define GFXMMU_LUT433L			MMIO32(GFXMMU_BASE + 0x1d88)
/** GFXMMU_LUT433H Graphic MMU LUT entry 433 high **/
#define GFXMMU_LUT433H			MMIO32(GFXMMU_BASE + 0x1d8c)
/** GFXMMU_LUT434L Graphic MMU LUT entry 434 low **/
#define GFXMMU_LUT434L			MMIO32(GFXMMU_BASE + 0x1d90)
/** GFXMMU_LUT434H Graphic MMU LUT entry 434 high **/
#define GFXMMU_LUT434H			MMIO32(GFXMMU_BASE + 0x1d94)
/** GFXMMU_LUT435L Graphic MMU LUT entry 435 low **/
#define GFXMMU_LUT435L			MMIO32(GFXMMU_BASE + 0x1d98)
/** GFXMMU_LUT435H Graphic MMU LUT entry 435 high **/
#define GFXMMU_LUT435H			MMIO32(GFXMMU_BASE + 0x1d9c)
/** GFXMMU_LUT436L Graphic MMU LUT entry 436 low **/
#define GFXMMU_LUT436L			MMIO32(GFXMMU_BASE + 0x1da0)
/** GFXMMU_LUT436H Graphic MMU LUT entry 436 high **/
#define GFXMMU_LUT436H			MMIO32(GFXMMU_BASE + 0x1da4)
/** GFXMMU_LUT437L Graphic MMU LUT entry 437 low **/
#define GFXMMU_LUT437L			MMIO32(GFXMMU_BASE + 0x1da8)
/** GFXMMU_LUT437H Graphic MMU LUT entry 437 high **/
#define GFXMMU_LUT437H			MMIO32(GFXMMU_BASE + 0x1dac)
/** GFXMMU_LUT438L Graphic MMU LUT entry 438 low **/
#define GFXMMU_LUT438L			MMIO32(GFXMMU_BASE + 0x1db0)
/** GFXMMU_LUT438H Graphic MMU LUT entry 438 high **/
#define GFXMMU_LUT438H			MMIO32(GFXMMU_BASE + 0x1db4)
/** GFXMMU_LUT439L Graphic MMU LUT entry 439 low **/
#define GFXMMU_LUT439L			MMIO32(GFXMMU_BASE + 0x1db8)
/** GFXMMU_LUT439H Graphic MMU LUT entry 439 high **/
#define GFXMMU_LUT439H			MMIO32(GFXMMU_BASE + 0x1dbc)
/** GFXMMU_LUT440L Graphic MMU LUT entry 440 low **/
#define GFXMMU_LUT440L			MMIO32(GFXMMU_BASE + 0x1dc0)
/** GFXMMU_LUT440H Graphic MMU LUT entry 440 high **/
#define GFXMMU_LUT440H			MMIO32(GFXMMU_BASE + 0x1dc4)
/** GFXMMU_LUT441L Graphic MMU LUT entry 441 low **/
#define GFXMMU_LUT441L			MMIO32(GFXMMU_BASE + 0x1dc8)
/** GFXMMU_LUT441H Graphic MMU LUT entry 441 high **/
#define GFXMMU_LUT441H			MMIO32(GFXMMU_BASE + 0x1dcc)
/** GFXMMU_LUT442L Graphic MMU LUT entry 442 low **/
#define GFXMMU_LUT442L			MMIO32(GFXMMU_BASE + 0x1dd0)
/** GFXMMU_LUT442H Graphic MMU LUT entry 442 high **/
#define GFXMMU_LUT442H			MMIO32(GFXMMU_BASE + 0x1dd4)
