grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT443L Graphic MMU LUT entry 443 low **/
#define GFXMMU_LUT443L			MMIO32(GFXMMU_BASE + 0x1dd8)
/** GFXMMU_LUT443H Graphic MMU LUT entry 443 high **/
#define GFXMMU_LUT443H			MMIO32(GFXMMU_BASE + 0x1ddc)
/** GFXMMU_LUT444L Graphic MMU LUT entry 444 low **/
#define GFXMMU_LUT444L			MMIO32(GFXMMU_BASE + 0x1de0)
/** GFXMMU_LUT444H Graphic MMU LUT entry 444 high **/
#define GFXMMU_LUT444H			MMIO32(GFXMMU_BASE + 0x1de4)
/** GFXMMU_LUT445L Graphic MMU LUT entry 445 low **/
#define GFXMMU_LUT445L			MMIO32(GFXMMU_BASE + 0x1de8)
/** GFXMMU_LUT445H Graphic MMU LUT entry 445 high **/
#define GFXMMU_LUT445H			MMIO32(GFXMMU_BASE + 0x1dec)
/** GFXMMU_LUT446L Graphic MMU LUT entry 446 low **/
#define GFXMMU_LUT446L			MMIO32(GFXMMU_BASE + 0x1df0)
/** GFXMMU_LUT446H Graphic MMU LUT entry 446 high **/
#define GFXMMU_LUT446H			MMIO32(GFXMMU_BASE + 0x1df4)
/** GFXMMU_LUT447L Graphic MMU LUT entry 447 low **/
#define GFXMMU_LUT447L			MMIO32(GFXMMU_BASE + 0x1df8)
/** GFXMMU_LUT447H Graphic MMU LUT entry 447 high **/
#define GFXMMU_LUT447H			MMIO32(GFXMMU_BASE + 0x1dfc)
/** GFXMMU_LUT448L Graphic MMU LUT entry 448 low **/
#define GFXMMU_LUT448L			MMIO32(GFXMMU_BASE + 0x1e00)
/** GFXMMU_LUT448H Graphic MMU LUT entry 448 high **/
#define GFXMMU_LUT448H			MMIO32(GFXMMU_BASE + 0x1e04)
/** GFXMMU_LUT449L Graphic MMU LUT entry 449 low **/
#define GFXMMU_LUT449L			MMIO32(GFXMMU_BASE + 0x1e08)
/** GFXMMU_LUT449H Graphic MMU LUT entry 449 high **/
#define GFXMMU_LUT449H			MMIO32(GFXMMU_BASE + 0x1e0c)
/** GFXMMU_LUT450L Graphic MMU LUT entry 450 low **/
#define GFXMMU_LUT450L			MMIO32(GFXMMU_BASE + 0x1e10)
/** GFXMMU_LUT450H Graphic MMU LUT entry 450 high **/
#define GFXMMU_LUT450H			MMIO32(GFXMMU_BASE + 0x1e14)
/** GFXMMU_LUT451L Graphic MMU LUT entry 451 low **/
#define GFXMMU_LUT451L			MMIO32(GFXMMU_BASE + 0x1e18)
/** GFXMMU_LUT451H Graphic MMU LUT entry 451 high **/
#define GFXMMU_LUT451H			MMIO32(GFXMMU_BASE + 0x1e1c)
/** GFXMMU_LUT452L Graphic MMU LUT entry 452 low **/
#define GFXMMU_LUT452L			MMIO32(GFXMMU_BASE + 0x1e20)
/** GFXMMU_LUT452H Graphic MMU LUT entry 452 high **/
#define GFXMMU_LUT452H			MMIO32(GFXMMU_BASE + 0x1e24)
/** GFXMMU_LUT453L Graphic MMU LUT entry 453 low **/
#define GFXMMU_LUT453L			MMIO32(GFXMMU_BASE + 0x1e28)
/** GFXMMU_LUT453H Graphic MMU LUT entry 453 high **/
#define GFXMMU_LUT453H			MMIO32(GFXMMU_BASE + 0x1e2c)
/** GFXMMU_LUT454L Graphic MMU LUT entry 454 low **/
#define GFXMMU_LUT454L			MMIO32(GFXMMU_BASE + 0x1e30)
/** GFXMMU_LUT454H Graphic MMU LUT entry 454 high **/
#define GFXMMU_LUT454H			MMIO32(GFXMMU_BASE + 0x1e34)
/** GFXMMU_LUT455L Graphic MMU LUT entry 455 low **/
#define GFXMMU_LUT455L			MMIO32(GFXMMU_BASE + 0x1e38)
/** GFXMMU_LUT455H Graphic MMU LUT entry 455 high **/
#define GFXMMU_LUT455H			MMIO32(GFXMMU_BASE + 0x1e3c)
/** GFXMMU_LUT456L Graphic MMU LUT entry 456 low **/
#define GFXMMU_LUT456L			MMIO32(GFXMMU_BASE + 0x1e40)
/** GFXMMU_LUT456H Graphic MMU LUT entry 456 high **/
#define GFXMMU_LUT456H			MMIO32(GFXMMU_BASE + 0x1e44)
/** GFXMMU_LUT457L Graphic MMU LUT entry 457 low **/
#define GFXMMU_LUT457L			MMIO32(GFXMMU_BASE + 0x1e48)
/** GFXMMU_LUT457H Graphic MMU LUT entry 457 high **/
#define GFXMMU_LUT457H			MMIO32(GFXMMU_BASE + 0x1e4c)
/** GFXMMU_LUT458L Graphic MMU LUT entry 458 low **/
#define GFXMMU_LUT458L			MMIO32(GFXMMU_BASE + 0x1e50)
/** GFXMMU_LUT458H Graphic MMU LUT entry 458 high **/
#define GFXMMU_LUT458H			MMIO32(GFXMMU_BASE + 0x1e54)
/** GFXMMU_LUT459L Graphic MMU LUT entry 459 low **/
#define GFXMMU_LUT459L			MMIO32(GFXMMU_BASE + 0x1e58)
/** GFXMMU_LUT459H Graphic MMU LUT entry 459 high **/
#define GFXMMU_LUT459H			MMIO32(GFXMMU_BASE + 0x1e5c)
/** GFXMMU_LUT460L Graphic MMU LUT entry 460 low **/
#define GFXMMU_LUT460L			MMIO32(GFXMMU_BASE + 0x1e60)
/** GFXMMU_LUT460H Graphic MMU LUT entry 460 high **/
#define GFXMMU_LUT460H			MMIO32(GFXMMU_BASE + 0x1e64)
/** GFXMMU_LUT461L Graphic MMU LUT entry 461 low **/
#define GFXMMU_LUT461L			MMIO32(GFXMMU_BASE + 0x1e68)
/** GFXMMU_LUT461H Graphic MMU LUT entry 461 high **/
#define GFXMMU_LUT461H			MMIO32(GFXMMU_BASE + 0x1e6c)
/** GFXMMU_LUT462L Graphic MMU LUT entry 462 low **/
#define GFXMMU_LUT462L			MMIO32(GFXMMU_BASE + 0x1e70)
/** GFXMMU_LUT462H Graphic MMU LUT entry 462 high **/
#define GFXMMU_LUT462H			MMIO32(GFXMMU_BASE + 0x1e74)
/** GFXMMU_LUT463L Graphic MMU LUT entry 463 low **/
#define GFXMMU_LUT463L			MMIO32(GFXMMU_BASE + 0x1e78)
/** GFXMMU_LUT463H Graphic MMU LUT entry 463 high **/
#define GFXMMU_LUT463H			MMIO32(GFXMMU_BASE + 0x1e7c)
/** GFXMMU_LUT464L Graphic MMU LUT entry 464 low **/
#define GFXMMU_LUT464L			MMIO32(GFXMMU_BASE + 0x1e80)
/** GFXMMU_LUT464H Graphic MMU LUT entry 464 high **/
#define GFXMMU_LUT464H			MMIO32(GFXMMU_BASE + 0x1e84)
/** GFXMMU_LUT465L Graphic MMU LUT entry 465 low **/
#define GFXMMU_LUT465L			MMIO32(GFXMMU_BASE + 0x1e88)
/** GFXMMU_LUT465H Graphic MMU LUT entry 465 high **/
#define GFXMMU_LUT465H			MMIO32(GFXMMU_BASE + 0x1e8c)
/** GFXMMU_LUT466L Graphic MMU LUT entry 466 low **/
#define GFXMMU_LUT466L			MMIO32(GFXMMU_BASE + 0x1e90)
/** GFXMMU_LUT466H Graphic MMU LUT entry 466 high **/
#define GFXMMU_LUT466H			MMIO32(GFXMMU_BASE + 0x1e94)
/** GFXMMU_LUT467L Graphic MMU LUT entry 467 low **/
#define GFXMMU_LUT467L			MMIO32(GFXMMU_BASE + 0x1e98)
/** GFXMMU_LUT467H Graphic MMU LUT entry 467 high **/
#define GFXMMU_LUT467H			MMIO32(GFXMMU_BASE + 0x1e9c)
/** GFXMMU_LUT468L Graphic MMU LUT entry 468 low **/
#define GFXMMU_LUT468L			MMIO32(GFXMMU_BASE + 0x1ea0)
/** GFXMMU_LUT468H Graphic MMU LUT entry 468 high **/
#define GFXMMU_LUT468H			MMIO32(GFXMMU_BASE + 0x1ea4)
/** GFXMMU_LUT469L Graphic MMU LUT entry 469 low **/
#define GFXMMU_LUT469L			MMIO32(GFXMMU_BASE + 0x1ea8)
/** GFXMMU_LUT469H Graphic MMU LUT entry 469 high **/
#define GFXMMU_LUT469H			MMIO32(GFXMMU_BASE + 0x1eac)
/** GFXMMU_LUT470L Graphic MMU LUT entry 470 low **/
#define GFXMMU_LUT470L			MMIO32(GFXMMU_BASE + 0x1eb0)
/** GFXMMU_LUT470H Graphic MMU LUT entry 470 high **/
#define GFXMMU_LUT470H			MMIO32(GFXMMU_BASE + 0x1eb4)
/** GFXMMU_LUT471L Graphic MMU LUT entry 471 low **/
#define GFXMMU_LUT471L			MMIO32(GFXMMU_BASE + 0x1eb8)
/** GFXMMU_LUT471H Graphic MMU LUT entry 471 high **/
#define GFXMMU_LUT471H			MMIO32(GFXMMU_BASE + 0x1ebc)
/** GFXMMU_LUT472L Graphic MMU LUT entry 472 low **/
#define GFXMMU_LUT472L			MMIO32(GFXMMU_BASE + 0x1ec0)
/** GFXMMU_LUT472H Graphic MMU LUT entry 472 high **/
#define GFXMMU_LUT472H			MMIO32(GFXMMU_BASE + 0x1ec4)
/** GFXMMU_LUT473L Graphic MMU LUT entry 473 low **/
#define GFXMMU_LUT473L			MMIO32(GFXMMU_BASE + 0x1ec8)
/** GFXMMU_LUT473H Graphic MMU LUT entry 473 high **/
#define GFXMMU_LUT473H			MMIO32(GFXMMU_BASE + 0x1ecc)
/** GFXMMU_LUT474L Graphic MMU LUT entry 474 low **/
#define GFXMMU_LUT474L			MMIO32(GFXMMU_BASE + 0x1ed0)
/** GFXMMU_LUT474H Graphic MMU LUT entry 474 high **/
#define GFXMMU_LUT474H			MMIO32(GFXMMU_BASE + 0x1ed4)
/** GFXMMU_LUT475L Graphic MMU LUT entry 475 low **/
#define GFXMMU_LUT475L			MMIO32(GFXMMU_BASE + 0x1ed8)
/** GFXMMU_LUT475H Graphic MMU LUT entry 475 high **/
#define GFXMMU_LUT475H			MMIO32(GFXMMU_BASE + 0x1edc)
/** GFXMMU_LUT476L Graphic MMU LUT entry 476 low **/
#define GFXMMU_LUT476L			MMIO32(GFXMMU_BASE + 0x1ee0)
/** GFXMMU_LUT476H Graphic MMU LUT entry 476 high **/
#define GFXMMU_LUT476H			MMIO32(GFXMMU_BASE + 0x1ee4)
/** GFXMMU_LUT477L Graphic MMU LUT entry 477 low **/
#define GFXMMU_LUT477L			MMIO32(GFXMMU_BASE + 0x1ee8)
/** GFXMMU_LUT477H Graphic MMU LUT entry 477 high **/
#define GFXMMU_LUT477H			MMIO32(GFXMMU_BASE + 0x1eec)
/** GFXMMU_LUT478L Graphic MMU LUT entry 478 low **/
#define GFXMMU_LUT478L			MMIO32(GFXMMU_BASE + 0x1ef0)
/** GFXMMU_LUT478H Graphic MMU LUT entry 478 high **/
#define GFXMMU_LUT478H			MMIO32(GFXMMU_BASE + 0x1ef4)
/** GFXMMU_LUT479L Graphic MMU LUT entry 479 low **/
#define GFXMMU_LUT479L			MMIO32(GFXMMU_BASE + 0x1ef8)
/** GFXMMU_LUT479H Graphic MMU LUT entry 479 high **/
#define GFXMMU_LUT479H			MMIO32(GFXMMU_BASE + 0x1efc)
/** GFXMMU_LUT480L Graphic MMU LUT entry 480 low **/
#define GFXMMU_LUT480L			MMIO32(GFXMMU_BASE + 0x1f00)
/** GFXMMU_LUT480H Graphic MMU LUT entry 480 high **/
#define GFXMMU_LUT480H			MMIO32(GFXMMU_BASE + 0x1f04)
/** GFXMMU_LUT481L Graphic MMU LUT entry 481 low **/
#define GFXMMU_LUT481L			MMIO32(GFXMMU_BASE + 0x1f08)
/** GFXMMU_LUT481H Graphic MMU LUT entry 481 high **/
#define GFXMMU_LUT481H			MMIO32(GFXMMU_BASE + 0x1f0c)
/** GFXMMU_LUT482L Graphic MMU LUT entry 482 low **/
#define GFXMMU_LUT482L			MMIO32(GFXMMU_BASE + 0x1f10)
/** GFXMMU_LUT482H Graphic MMU LUT entry 482 high **/
#define GFXMMU_LUT482H			MMIO32(GFXMMU_BASE + 0x1f14)
/** GFXMMU_LUT483L Graphic MMU LUT entry 483 low **/
#define GFXMMU_LUT483L			MMIO32(GFXMMU_BASE + 0x1f18)
/** GFXMMU_LUT483H Graphic MMU LUT entry 483 high **/
#define GFXMMU_LUT483H			MMIO32(GFXMMU_BASE + 0x1f1c)
/** GFXMMU_LUT484L Graphic MMU LUT entry 484 low **/
#define GFXMMU_LUT484L			MMIO32(GFXMMU_BASE + 0x1f20)
/** GFXMMU_LUT484H Graphic MMU LUT entry 484 high **/
#define GFXMMU_LUT484H			MMIO32(GFXMMU_BASE + 0x1f24)
/** GFXMMU_LUT485L Graphic MMU LUT entry 485 low **/
#define GFXMMU_LUT485L			MMIO32(GFXMMU_BASE + 0x1f28)
/** GFXMMU_LUT485H Graphic MMU LUT entry 485 high **/
#define GFXMMU_LUT485H			MMIO32(GFXMMU_BASE + 0x1f2c)
/** GFXMMU_LUT486L Graphic MMU LUT entry 486 low **/
#define GFXMMU_LUT486L			MMIO32(GFXMMU_BASE + 0x1f30)
/** GFXMMU_LUT486H Graphic MMU LUT entry 486 high **/
#define GFXMMU_LUT486H			MMIO32(GFXMMU_BASE + 0x1f34)
/** GFXMMU_LUT487L Graphic MMU LUT entry 487 low **/
#define GFXMMU_LUT487L			MMIO32(GFXMMU_BASE + 0x1f38)
/** GFXMMU_LUT487H Graphic MMU LUT entry 487 high **/
#define GFXMMU_LUT487H			MMIO32(GFXMMU_BASE + 0x1f3c)
/** GFXMMU_LUT488L Graphic MMU LUT entry 488 low **/
#define GFXMMU_LUT488L			MMIO32(GFXMMU_BASE + 0x1f40)
/** GFXMMU_LUT488H Graphic MMU LUT entry 488 high **/
#define GFXMMU_LUT488H			MMIO32(GFXMMU_BASE + 0x1f44)
/** GFXMMU_LUT489L Graphic MMU LUT entry 489 low **/
#define GFXMMU_LUT489L			MMIO32(GFXMMU_BASE + 0x1f48)
/** GFXMMU_LUT489H Graphic MMU LUT entry 489 high **/
#define GFXMMU_LUT489H			MMIO32(GFXMMU_BASE + 0x1f4c)
/** GFXMMU_LUT490L Graphic MMU LUT entry 490 low **/
#define GFXMMU_LUT490L			MMIO32(GFXMMU_BASE + 0x1f50)
/** GFXMMU_LUT490H Graphic MMU LUT entry 490 high **/
#define GFXMMU_LUT490H			MMIO32(GFXMMU_BASE + 0x1f54)
/** GFXMMU_LUT491L Graphic MMU LUT entry 491 low **/
#define GFXMMU_LUT491L			MMIO32(GFXMMU_BASE + 0x1f58)
/** GFXMMU_LUT491H Graphic MMU LUT entry 491 high **/
#define GFXMMU_LUT491H			MMIO32(GFXMMU_BASE + 0x1f5c)
/** GFXMMU_LUT492L Graphic MMU LUT entry 492 low **/
#define GFXMMU_LUT492L			MMIO32(GFXMMU_BASE + 0x1f60)
/** GFXMMU_LUT492H Graphic MMU LUT entry 492 high **/
#define GFXMMU_LUT492H			MMIO32(GFXMMU_BASE + 0x1f64)
/** GFXMMU_LUT493L Graphic MMU LUT entry 493 low **/
#define GFXMMU_LUT493L			MMIO32(GFXMMU_BASE + 0x1f68)
/** GFXMMU_LUT493H Graphic MMU LUT entry 493 high **/
#define GFXMMU_LUT493H			MMIO32(GFXMMU_BASE + 0x1f6c)
/** GFXMMU_LUT494L Graphic MMU LUT entry 494 low **/
#define GFXMMU_LUT494L			MMIO32(GFXMMU_BASE + 0x1f70)
/** GFXMMU_LUT494H Graphic MMU LUT entry 494 high **/
#define GFXMMU_LUT494H			MMIO32(GFXMMU_BASE + 0x1f74)
/** GFXMMU_LUT495L Graphic MMU LUT entry 495 low **/
#define GFXMMU_LUT495L			MMIO32(GFXMMU_BASE + 0x1f78)
/** GFXMMU_LUT495H Graphic MMU LUT entry 495 high **/
#define GFXMMU_LUT495H			MMIO32(GFXMMU_BASE + 0x1f7c)
/** GFXMMU_LUT496L Graphic MMU LUT entry 496 low **/
#define GFXMMU_LUT496L			MMIO32(GFXMMU_BASE + 0x1f80)
/** GFXMMU_LUT496H Graphic MMU LUT entry 496 high **/
#define GFXMMU_LUT496H			MMIO32(GFXMMU_BASE + 0x1f84)
/** GFXMMU_LUT497L Graphic MMU LUT entry 497 low **/
#define GFXMMU_LUT497L			MMIO32(GFXMMU_BASE + 0x1f88)
/** GFXMMU_LUT497H Graphic MMU LUT entry 497 high **/
#define GFXMMU_LUT497H			MMIO32(GFXMMU_BASE + 0x1f8c)
/** GFXMMU_LUT498L Graphic MMU LUT entry 498 low **/
#define GFXMMU_LUT498L			MMIO32(GFXMMU_BASE + 0x1f90)
/** GFXMMU_LUT498H Graphic MMU LUT entry 498 high **/
#define GFXMMU_LUT498H			MMIO32(GFXMMU_BASE + 0x1f94)
/** GFXMMU_LUT499L Graphic MMU LUT entry 499 low **/
#define GFXMMU_LUT499L			MMIO32(GFXMMU_BASE + 0x1f98)
/** GFXMMU_LUT499H Graphic MMU LUT entry 499 high **/
#define GFXMMU_LUT499H			MMIO32(GFXMMU_BASE + 0x1f9c)
/** GFXMMU_LUT500L Graphic MMU LUT entry 500 low **/
#define GFXMMU_LUT500L			MMIO32(GFXMMU_BASE + 0x1fa0)
/** GFXMMU_LUT500H Graphic MMU LUT entry 500 high **/
#define GFXMMU_LUT500H			MMIO32(GFXMMU_BASE + 0x1fa4)
/** GFXMMU_LUT501L Graphic MMU LUT entry 501 low **/
#define GFXMMU_LUT501L			MMIO32(GFXMMU_BASE + 0x1fa8)
/** GFXMMU_LUT501H Graphic MMU LUT entry 501 high **/
#define GFXMMU_LUT501H			MMIO32(GFXMMU_BASE + 0x1fac)
/** GFXMMU_LUT502L Graphic MMU LUT entry 502 low **/
#define GFXMMU_LUT502L			MMIO32(GFXMMU_BASE + 0x1fb0)
/** GFXMMU_LUT502H Graphic MMU LUT entry 502 high **/
#define GFXMMU_LUT502H			MMIO32(GFXMMU_BASE + 0x1fb4)
/** GFXMMU_LUT503L Graphic MMU LUT entry 503 low **/
#define GFXMMU_LUT503L			MMIO32(GFXMMU_BASE + 0x1fb8)
/** GFXMMU_LUT503H Graphic MMU LUT entry 503 high **/
#define GFXMMU_LUT503H			MMIO32(GFXMMU_BASE + 0x1fbc)
/** GFXMMU_LUT504L Graphic MMU LUT entry 504 low **/
#define GFXMMU_LUT504L			MMIO32(GFXMMU_BASE + 0x1fc0)
/** GFXMMU_LUT504H Graphic MMU LUT entry 504 high **/
#define GFXMMU_LUT504H			MMIO32(GFXMMU_BASE + 0x1fc4)
/** GFXMMU_LUT505L Graphic MMU LUT entry 505 low **/
#define GFXMMU_LUT505L			MMIO32(GFXMMU_BASE + 0x1fc8)
/** GFXMMU_LUT505H Graphic MMU LUT entry 505 high **/
#define GFXMMU_LUT505H			MMIO32(GFXMMU_BASE + 0x1fcc)
/** GFXMMU_LUT506L Graphic MMU LUT entry 506 low **/
#define GFXMMU_LUT506L			MMIO32(GFXMMU_BASE + 0x1fd0)
/** GFXMMU_LUT506H Graphic MMU LUT entry 506 high **/
#define GFXMMU_LUT506H			MMIO32(GFXMMU_BASE + 0x1fd4)
/** GFXMMU_LUT507L Graphic MMU LUT entry 507 low **/
#define GFXMMU_LUT507L			MMIO32(GFXMMU_BASE + 0x1fd8)
/** GFXMMU_LUT507H Graphic MMU LUT entry 507 high **/
#define GFXMMU_LUT507H			MMIO32(GFXMMU_BASE + 0x1fdc)
/** GFXMMU_LUT508L Graphic MMU LUT entry 508 low **/
#define GFXMMU_LUT508L			MMIO32(GFXMMU_BASE + 0x1fe0)
/** GFXMMU_LUT508H Graphic MMU LUT entry 508 high **/
#define GFXMMU_LUT508H			MMIO32(GFXMMU_BASE + 0x1fe4)
/** GFXMMU_LUT509L Graphic MMU LUT entry 509 low **/
#define GFXMMU_LUT509L			MMIO32(GFXMMU_BASE + 0x1fe8)
/** GFXMMU_LUT509H Graphic MMU LUT entry 509 high **/
#define GFXMMU_LUT509H			MMIO32(GFXMMU_BASE + 0x1fec)
/** GFXMMU_LUT510L Graphic MMU LUT entry 510 low **/
#define GFXMMU_LUT510L			MMIO32(GFXMMU_BASE + 0x1ff0)
/** GFXMMU_LUT510H Graphic MMU LUT entry 510 high **/
#define GFXMMU_LUT510H			MMIO32(GFXMMU_BASE + 0x1ff4)
/** GFXMMU_LUT511L Graphic MMU LUT entry 511 low **/
#define GFXMMU_LUT511L			MMIO32(GFXMMU_BASE + 0x1ff8)
/** GFXMMU_LUT511H Graphic MMU LUT entry 511 high **/
#define GFXMMU_LUT511H			MMIO32(GFXMMU_BASE + 0x1ffc)
/** GFXMMU_LUT512L Graphic MMU LUT entry 512 low **/
#define GFXMMU_LUT512L			MMIO32(GFXMMU_BASE + 0x2000)
/** GFXMMU_LUT512H Graphic MMU LUT entry 512 high **/
#define GFXMMU_LUT512H			MMIO32(GFXMMU_BASE + 0x2004)
/** GFXMMU_LUT513L Graphic MMU LUT entry 513 low **/
#define GFXMMU_LUT513L			MMIO32(GFXMMU_BASE + 0x2008)
/** GFXMMU_LUT513H Graphic MMU LUT entry 513 high **/
#define GFXMMU_LUT513H			MMIO32(GFXMMU_BASE + 0x200c)
/** GFXMMU_LUT514L Graphic MMU LUT entry 514 low **/
#define GFXMMU_LUT514L			MMIO32(GFXMMU_BASE + 0x2010)
/** GFXMMU_LUT514H Graphic MMU LUT entry 514 high **/
#define GFXMMU_LUT514H			MMIO32(GFXMMU_BASE + 0x2014)
/** GFXMMU_LUT515L Graphic MMU LUT entry 515 low **/
#define GFXMMU_LUT515L			MMIO32(GFXMMU_BASE + 0x2018)
/** GFXMMU_LUT515H Graphic MMU LUT entry 515 high **/
#define GFXMMU_LUT515H			MMIO32(GFXMMU_BASE + 0x201c)
/** GFXMMU_LUT516L Graphic MMU LUT entry 516 low **/
#define GFXMMU_LUT516L			MMIO32(GFXMMU_BASE + 0x2020)
/** GFXMMU_LUT516H Graphic MMU LUT entry 516 high **/
#define GFXMMU_LUT516H			MMIO32(GFXMMU_BASE + 0x2024)
/** GFXMMU_LUT517L Graphic MMU LUT entry 517 low **/
#define GFXMMU_LUT517L			MMIO32(GFXMMU_BASE + 0x2028)
/** GFXMMU_LUT517H Graphic MMU LUT entry 517 high **/
#define GFXMMU_LUT517H			MMIO32(GFXMMU_BASE + 0x202c)
/** GFXMMU_LUT518L Graphic MMU LUT entry 518 low **/
#define GFXMMU_LUT518L			MMIO32(GFXMMU_BASE + 0x2030)
/** GFXMMU_LUT518H Graphic MMU LUT entry 518 high **/
#define GFXMMU_LUT518H			MMIO32(GFXMMU_BASE + 0x2034)
/** GFXMMU_LUT519L Graphic MMU LUT entry 519 low **/
#define GFXMMU_LUT519L			MMIO32(GFXMMU_BASE + 0x2038)
/** GFXMMU_LUT519H Graphic MMU LUT entry 519 high **/
#define GFXMMU_LUT519H			MMIO32(GFXMMU_BASE + 0x203c)
/** GFXMMU_LUT520L Graphic MMU LUT entry 520 low **/
#define GFXMMU_LUT520L			MMIO32(GFXMMU_BASE + 0x2040)
/** GFXMMU_LUT520H Graphic MMU LUT entry 520 high **/
#define GFXMMU_LUT520H			MMIO32(GFXMMU_BASE + 0x2044)
/** GFXMMU_LUT521L Graphic MMU LUT entry 521 low **/
#define GFXMMU_LUT521L			MMIO32(GFXMMU_BASE + 0x2048)
/** GFXMMU_LUT521H Graphic MMU LUT entry 521 high **/
#define GFXMMU_LUT521H			MMIO32(GFXMMU_BASE + 0x204c)
/** GFXMMU_LUT522L Graphic MMU LUT entry 522 low **/
#define GFXMMU_LUT522L			MMIO32(GFXMMU_BASE + 0x2050)
/** GFXMMU_LUT522H Graphic MMU LUT entry 522 high **/
#define GFXMMU_LUT522H			MMIO32(GFXMMU_BASE + 0x2054)
/** GFXMMU_LUT523L Graphic MMU LUT entry 523 low **/
#define GFXMMU_LUT523L			MMIO32(GFXMMU_BASE + 0x2058)
/** GFXMMU_LUT523H Graphic MMU LUT entry 523 high **/
#define GFXMMU_LUT523H			MMIO32(GFXMMU_BASE + 0x205c)
/** GFXMMU_LUT524L Graphic MMU LUT entry 524 low **/
#define GFXMMU_LUT524L			MMIO32(GFXMMU_BASE + 0x2060)
/** GFXMMU_LUT524H Graphic MMU LUT entry 524 high **/
#define GFXMMU_LUT524H			MMIO32(GFXMMU_BASE + 0x2064)
/** GFXMMU_LUT525L Graphic MMU LUT entry 525 low **/
#define GFXMMU_LUT525L			MMIO32(GFXMMU_BASE + 0x2068)
/** GFXMMU_LUT525H Graphic MMU LUT entry 525 high **/
#define GFXMMU_LUT525H			MMIO32(GFXMMU_BASE + 0x206c)
/** GFXMMU_LUT526L Graphic MMU LUT entry 526 low **/
#define GFXMMU_LUT526L			MMIO32(GFXMMU_BASE + 0x2070)
/** GFXMMU_LUT526H Graphic MMU LUT entry 526 high **/
#define GFXMMU_LUT526H			MMIO32(GFXMMU_BASE + 0x2074)
/** GFXMMU_LUT527L Graphic MMU LUT entry 527 low **/
#define GFXMMU_LUT527L			MMIO32(GFXMMU_BASE + 0x2078)
/** GFXMMU_LUT527H Graphic MMU LUT entry 527 high **/
#define GFXMMU_LUT527H			MMIO32(GFXMMU_BASE + 0x207c)
/** GFXMMU_LUT528L Graphic MMU LUT entry 528 low **/
#define GFXMMU_LUT528L			MMIO32(GFXMMU_BASE + 0x2080)
/** GFXMMU_LUT528H Graphic MMU LUT entry 528 high **/
#define GFXMMU_LUT528H			MMIO32(GFXMMU_BASE + 0x2084)
/** GFXMMU_LUT529L Graphic MMU LUT entry 529 low **/
#define GFXMMU_LUT529L			MMIO32(GFXMMU_BASE + 0x2088)
/** GFXMMU_LUT529H Graphic MMU LUT entry 529 high **/
#define GFXMMU_LUT529H			MMIO32(GFXMMU_BASE + 0x208c)
/** GFXMMU_LUT530L Graphic MMU LUT entry 530 low **/
#define GFXMMU_LUT530L			MMIO32(GFXMMU_BASE + 0x2090)
/** GFXMMU_LUT530H Graphic MMU LUT entry 530 high **/
#define GFXMMU_LUT530H			MMIO32(GFXMMU_BASE + 0x2094)
/** GFXMMU_LUT531L Graphic MMU LUT entry 531 low **/
#define GFXMMU_LUT531L			MMIO32(GFXMMU_BASE + 0x2098)
/** GFXMMU_LUT531H Graphic MMU LUT entry 531 high **/
#define GFXMMU_LUT531H			MMIO32(GFXMMU_BASE + 0x209c)
/** GFXMMU_LUT532L Graphic MMU LUT entry 532 low **/
#define GFXMMU_LUT532L			MMIO32(GFXMMU_BASE + 0x20a0)
/** GFXMMU_LUT532H Graphic MMU LUT entry 532 high **/
#define GFXMMU_LUT532H			MMIO32(GFXMMU_BASE + 0x20a4)
/** GFXMMU_LUT533L Graphic MMU LUT entry 533 low **/
#define GFXMMU_LUT533L			MMIO32(GFXMMU_BASE + 0x20a8)
/** GFXMMU_LUT533H Graphic MMU LUT entry 533 high **/
#define GFXMMU_LUT533H			MMIO32(GFXMMU_BASE + 0x20ac)
/** GFXMMU_LUT534L Graphic MMU LUT entry 534 low **/
#define GFXMMU_LUT534L			MMIO32(GFXMMU_BASE + 0x20b0)
/** GFXMMU_LUT534H Graphic MMU LUT entry 534 high **/
#define GFXMMU_LUT534H			MMIO32(GFXMMU_BASE + 0x20b4)
/** GFXMMU_LUT535L Graphic MMU LUT entry 535 low **/
#define GFXMMU_LUT535L			MMIO32(GFXMMU_BASE + 0x20b8)
/** GFXMMU_LUT535H Graphic MMU LUT entry 535 high **/
#define GFXMMU_LUT535H			MMIO32(GFXMMU_BASE + 0x20bc)
/** GFXMMU_LUT536L Graphic MMU LUT entry 536 low **/
#define GFXMMU_LUT536L			MMIO32(GFXMMU_BASE + 0x20c0)
/** GFXMMU_LUT536H Graphic MMU LUT entry 536 high **/
#define GFXMMU_LUT536H			MMIO32(GFXMMU_BASE + 0x20c4)
/** GFXMMU_LUT537L Graphic MMU LUT entry 537 low **/
#define GFXMMU_LUT537L			MMIO32(GFXMMU_BASE + 0x20c8)
/** GFXMMU_LUT537H Graphic MMU LUT entry 537 high **/
#define GFXMMU_LUT537H			MMIO32(GFXMMU_BASE + 0x20cc)
/** GFXMMU_LUT538L Graphic MMU LUT entry 538 low **/
#define GFXMMU_LUT538L			MMIO32(GFXMMU_BASE + 0x20d0)
/** GFXMMU_LUT538H Graphic MMU LUT entry 538 high **/
#define GFXMMU_LUT538H			MMIO32(GFXMMU_BASE + 0x20d4)
/** GFXMMU_LUT539L Graphic MMU LUT entry 539 low **/
#define GFXMMU_LUT539L			MMIO32(GFXMMU_BASE + 0x20d8)
/** GFXMMU_LUT539H Graphic MMU LUT entry 539 high **/
#define GFXMMU_LUT539H			MMIO32(GFXMMU_BASE + 0x20dc)
/** GFXMMU_LUT540L Graphic MMU LUT entry 540 low **/
#define GFXMMU_LUT540L			MMIO32(GFXMMU_BASE + 0x20e0)
/** GFXMMU_LUT540H Graphic MMU LUT entry 540 high **/
#define GFXMMU_LUT540H			MMIO32(GFXMMU_BASE + 0x20e4)
/** GFXMMU_LUT541L Graphic MMU LUT entry 541 low **/
#define GFXMMU_LUT541L			MMIO32(GFXMMU_BASE + 0x20e8)
/** GFXMMU_LUT541H Graphic MMU LUT entry 541 high **/
#define GFXMMU_LUT541H			MMIO32(GFXMMU_BASE + 0x20ec)
/** GFXMMU_LUT542L Graphic MMU LUT entry 542 low **/
#define GFXMMU_LUT542L			MMIO32(GFXMMU_BASE + 0x20f0)
/** GFXMMU_LUT542H Graphic MMU LUT entry 542 high **/
#define GFXMMU_LUT542H			MMIO32(GFXMMU_BASE + 0x20f4)
/** GFXMMU_LUT543L Graphic MMU LUT entry 543 low **/
#define GFXMMU_LUT543L			MMIO32(GFXMMU_BASE + 0x20f8)
/** GFXMMU_LUT543H Graphic MMU LUT entry 543 high **/
#define GFXMMU_LUT543H			MMIO32(GFXMMU_BASE + 0x20fc)
/** GFXMMU_LUT544L Graphic MMU LUT entry 544 low **/
#define GFXMMU_LUT544L			MMIO32(GFXMMU_BASE + 0x2100)
/** GFXMMU_LUT544H Graphic MMU LUT entry 544 high **/
#define GFXMMU_LUT544H			MMIO32(GFXMMU_BASE + 0x2104)
/** GFXMMU_LUT545L Graphic MMU LUT entry 545 low **/
#define GFXMMU_LUT545L			MMIO32(GFXMMU_BASE + 0x2108)
/** GFXMMU_LUT545H Graphic MMU LUT entry 545 high **/
#define GFXMMU_LUT545H			MMIO32(GFXMMU_BASE + 0x210c)
/** GFXMMU_LUT546L Graphic MMU LUT entry 546 low **/
#define GFXMMU_LUT546L			MMIO32(GFXMMU_BASE + 0x2110)
/** GFXMMU_LUT546H Graphic MMU LUT entry 546 high **/
#define GFXMMU_LUT546H			MMIO32(GFXMMU_BASE + 0x2114)
/** GFXMMU_LUT547L Graphic MMU LUT entry 547 low **/
#define GFXMMU_LUT547L			MMIO32(GFXMMU_BASE + 0x2118)
/** GFXMMU_LUT547H Graphic MMU LUT entry 547 high **/
#define GFXMMU_LUT547H			MMIO32(GFXMMU_BASE + 0x211c)
/** GFXMMU_LUT548L Graphic MMU LUT entry 548 low **/
#define GFXMMU_LUT548L			MMIO32(GFXMMU_BASE + 0x2120)
/** GFXMMU_LUT548H Graphic MMU LUT entry 548 high **/
#define GFXMMU_LUT548H			MMIO32(GFXMMU_BASE + 0x2124)
/** GFXMMU_LUT549L Graphic MMU LUT entry 549 low **/
#define GFXMMU_LUT549L			MMIO32(GFXMMU_BASE + 0x2128)
/** GFXMMU_LUT549H Graphic MMU LUT entry 549 high **/
#define GFXMMU_LUT549H			MMIO32(GFXMMU_BASE + 0x212c)
/** GFXMMU_LUT550L Graphic MMU LUT entry 550 low **/
#define GFXMMU_LUT550L			MMIO32(GFXMMU_BASE + 0x2130)
/** GFXMMU_LUT550H Graphic MMU LUT entry 550 high **/
#define GFXMMU_LUT550H			MMIO32(GFXMMU_BASE + 0x2134)
/** GFXMMU_LUT551L Graphic MMU LUT entry 551 low **/
#define GFXMMU_LUT551L			MMIO32(GFXMMU_BASE + 0x2138)
/** GFXMMU_LUT551H Graphic MMU LUT entry 551 high **/
#define GFXMMU_LUT551H			MMIO32(GFXMMU_BASE + 0x213c)
/** GFXMMU_LUT552L Graphic MMU LUT entry 552 low **/
#define GFXMMU_LUT552L			MMIO32(GFXMMU_BASE + 0x2140)
/** GFXMMU_LUT552H Graphic MMU LUT entry 552 high **/
#define GFXMMU_LUT552H			MMIO32(GFXMMU_BASE + 0x2144)
/** GFXMMU_LUT553L Graphic MMU LUT entry 553 low **/
#define GFXMMU_LUT553L			MMIO32(GFXMMU_BASE + 0x2148)
/** GFXMMU_LUT553H Graphic MMU LUT entry 553 high **/
#define GFXMMU_LUT553H			MMIO32(GFXMMU_BASE + 0x214c)
/** GFXMMU_LUT554L Graphic MMU LUT entry 554 low **/
#define GFXMMU_LUT554L			MMIO32(GFXMMU_BASE + 0x2150)
