grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT554H Graphic MMU LUT entry 554 high **/
#define GFXMMU_LUT554H			MMIO32(GFXMMU_BASE + 0x2154)
/** GFXMMU_LUT555L Graphic MMU LUT entry 555 low **/
#define GFXMMU_LUT555L			MMIO32(GFXMMU_BASE + 0x2158)
/** GFXMMU_LUT555H Graphic MMU LUT entry 555 high **/
#define GFXMMU_LUT555H			MMIO32(GFXMMU_BASE + 0x215c)
/** GFXMMU_LUT556L Graphic MMU LUT entry 556 low **/
#define GFXMMU_LUT556L			MMIO32(GFXMMU_BASE + 0x2160)
/** GFXMMU_LUT556H Graphic MMU LUT entry 556 high **/
#define GFXMMU_LUT556H			MMIO32(GFXMMU_BASE + 0x2164)
/** GFXMMU_LUT557L Graphic MMU LUT entry 557 low **/
#define GFXMMU_LUT557L			MMIO32(GFXMMU_BASE + 0x2168)
/** GFXMMU_LUT557H Graphic MMU LUT entry 557 high **/
#define GFXMMU_LUT557H			MMIO32(GFXMMU_BASE + 0x216c)
/** GFXMMU_LUT558L Graphic MMU LUT entry 558 low **/
#define GFXMMU_LUT558L			MMIO32(GFXMMU_BASE + 0x2170)
/** GFXMMU_LUT558H Graphic MMU LUT entry 558 high **/
#define GFXMMU_LUT558H			MMIO32(GFXMMU_BASE + 0x2174)
/** GFXMMU_LUT559L Graphic MMU LUT entry 559 low **/
#define GFXMMU_LUT559L			MMIO32(GFXMMU_BASE + 0x2178)
/** GFXMMU_LUT559H Graphic MMU LUT entry 559 high **/
#define GFXMMU_LUT559H			MMIO32(GFXMMU_BASE + 0x217c)
/** GFXMMU_LUT560L Graphic MMU LUT entry 560 low **/
#define GFXMMU_LUT560L			MMIO32(GFXMMU_BASE + 0x2180)
/** GFXMMU_LUT560H Graphic MMU LUT entry 560 high **/
#define GFXMMU_LUT560H			MMIO32(GFXMMU_BASE + 0x2184)
/** GFXMMU_LUT561L Graphic MMU LUT entry 561 low **/
#define GFXMMU_LUT561L			MMIO32(GFXMMU_BASE + 0x2188)
/** GFXMMU_LUT561H Graphic MMU LUT entry 561 high **/
#define GFXMMU_LUT561H			MMIO32(GFXMMU_BASE + 0x218c)
/** GFXMMU_LUT562L Graphic MMU LUT entry 562 low **/
#define GFXMMU_LUT562L			MMIO32(GFXMMU_BASE + 0x2190)
/** GFXMMU_LUT562H Graphic MMU LUT entry 562 high **/
#define GFXMMU_LUT562H			MMIO32(GFXMMU_BASE + 0x2194)
/** GFXMMU_LUT563L Graphic MMU LUT entry 563 low **/
#define GFXMMU_LUT563L			MMIO32(GFXMMU_BASE + 0x2198)
/** GFXMMU_LUT563H Graphic MMU LUT entry 563 high **/
#define GFXMMU_LUT563H			MMIO32(GFXMMU_BASE + 0x219c)
/** GFXMMU_LUT564L Graphic MMU LUT entry 564 low **/
#define GFXMMU_LUT564L			MMIO32(GFXMMU_BASE + 0x21a0)
/** GFXMMU_LUT564H Graphic MMU LUT entry 564 high **/
#define GFXMMU_LUT564H			MMIO32(GFXMMU_BASE + 0x21a4)
/** GFXMMU_LUT565L Graphic MMU LUT entry 565 low **/
#define GFXMMU_LUT565L			MMIO32(GFXMMU_BASE + 0x21a8)
/** GFXMMU_LUT565H Graphic MMU LUT entry 565 high **/
#define GFXMMU_LUT565H			MMIO32(GFXMMU_BASE + 0x21ac)
/** GFXMMU_LUT566L Graphic MMU LUT entry 566 low **/
#define GFXMMU_LUT566L			MMIO32(GFXMMU_BASE + 0x21b0)
/** GFXMMU_LUT566H Graphic MMU LUT entry 566 high **/
#define GFXMMU_LUT566H			MMIO32(GFXMMU_BASE + 0x21b4)
/** GFXMMU_LUT567L Graphic MMU LUT entry 567 low **/
#define GFXMMU_LUT567L			MMIO32(GFXMMU_BASE + 0x21b8)
/** GFXMMU_LUT567H Graphic MMU LUT entry 567 high **/
#define GFXMMU_LUT567H			MMIO32(GFXMMU_BASE + 0x21bc)
/** GFXMMU_LUT568L Graphic MMU LUT entry 568 low **/
#define GFXMMU_LUT568L			MMIO32(GFXMMU_BASE + 0x21c0)
/** GFXMMU_LUT568H Graphic MMU LUT entry 568 high **/
#define GFXMMU_LUT568H			MMIO32(GFXMMU_BASE + 0x21c4)
/** GFXMMU_LUT569L Graphic MMU LUT entry 569 low **/
#define GFXMMU_LUT569L			MMIO32(GFXMMU_BASE + 0x21c8)
/** GFXMMU_LUT569H Graphic MMU LUT entry 569 high **/
#define GFXMMU_LUT569H			MMIO32(GFXMMU_BASE + 0x21cc)
/** GFXMMU_LUT570L Graphic MMU LUT entry 570 low **/
#define GFXMMU_LUT570L			MMIO32(GFXMMU_BASE + 0x21d0)
/** GFXMMU_LUT570H Graphic MMU LUT entry 570 high **/
#define GFXMMU_LUT570H			MMIO32(GFXMMU_BASE + 0x21d4)
/** GFXMMU_LUT571L Graphic MMU LUT entry 571 low **/
#define GFXMMU_LUT571L			MMIO32(GFXMMU_BASE + 0x21d8)
/** GFXMMU_LUT571H Graphic MMU LUT entry 571 high **/
#define GFXMMU_LUT571H			MMIO32(GFXMMU_BASE + 0x21dc)
/** GFXMMU_LUT572L Graphic MMU LUT entry 572 low **/
#define GFXMMU_LUT572L			MMIO32(GFXMMU_BASE + 0x21e0)
/** GFXMMU_LUT572H Graphic MMU LUT entry 572 high **/
#define GFXMMU_LUT572H			MMIO32(GFXMMU_BASE + 0x21e4)
/** GFXMMU_LUT573L Graphic MMU LUT entry 573 low **/
#define GFXMMU_LUT573L			MMIO32(GFXMMU_BASE + 0x21e8)
/** GFXMMU_LUT573H Graphic MMU LUT entry 573 high **/
#define GFXMMU_LUT573H			MMIO32(GFXMMU_BASE + 0x21ec)
/** GFXMMU_LUT574L Graphic MMU LUT entry 574 low **/
#define GFXMMU_LUT574L			MMIO32(GFXMMU_BASE + 0x21f0)
/** GFXMMU_LUT574H Graphic MMU LUT entry 574 high **/
#define GFXMMU_LUT574H			MMIO32(GFXMMU_BASE + 0x21f4)
/** GFXMMU_LUT575L Graphic MMU LUT entry 575 low **/
#define GFXMMU_LUT575L			MMIO32(GFXMMU_BASE + 0x21f8)
/** GFXMMU_LUT575H Graphic MMU LUT entry 575 high **/
#define GFXMMU_LUT575H			MMIO32(GFXMMU_BASE + 0x21fc)
/** GFXMMU_LUT576L Graphic MMU LUT entry 576 low **/
#define GFXMMU_LUT576L			MMIO32(GFXMMU_BASE + 0x2200)
/** GFXMMU_LUT576H Graphic MMU LUT entry 576 high **/
#define GFXMMU_LUT576H			MMIO32(GFXMMU_BASE + 0x2204)
/** GFXMMU_LUT577L Graphic MMU LUT entry 577 low **/
#define GFXMMU_LUT577L			MMIO32(GFXMMU_BASE + 0x2208)
/** GFXMMU_LUT577H Graphic MMU LUT entry 577 high **/
#define GFXMMU_LUT577H			MMIO32(GFXMMU_BASE + 0x220c)
/** GFXMMU_LUT578L Graphic MMU LUT entry 578 low **/
#define GFXMMU_LUT578L			MMIO32(GFXMMU_BASE + 0x2210)
/** GFXMMU_LUT578H Graphic MMU LUT entry 578 high **/
#define GFXMMU_LUT578H			MMIO32(GFXMMU_BASE + 0x2214)
/** GFXMMU_LUT579L Graphic MMU LUT entry 579 low **/
#define GFXMMU_LUT579L			MMIO32(GFXMMU_BASE + 0x2218)
/** GFXMMU_LUT579H Graphic MMU LUT entry 579 high **/
#define GFXMMU_LUT579H			MMIO32(GFXMMU_BASE + 0x221c)
/** GFXMMU_LUT580L Graphic MMU LUT entry 580 low **/
#define GFXMMU_LUT580L			MMIO32(GFXMMU_BASE + 0x2220)
/** GFXMMU_LUT580H Graphic MMU LUT entry 580 high **/
#define GFXMMU_LUT580H			MMIO32(GFXMMU_BASE + 0x2224)
/** GFXMMU_LUT581L Graphic MMU LUT entry 581 low **/
#define GFXMMU_LUT581L			MMIO32(GFXMMU_BASE + 0x2228)
/** GFXMMU_LUT581H Graphic MMU LUT entry 581 high **/
#define GFXMMU_LUT581H			MMIO32(GFXMMU_BASE + 0x222c)
/** GFXMMU_LUT582L Graphic MMU LUT entry 582 low **/
#define GFXMMU_LUT582L			MMIO32(GFXMMU_BASE + 0x2230)
/** GFXMMU_LUT582H Graphic MMU LUT entry 582 high **/
#define GFXMMU_LUT582H			MMIO32(GFXMMU_BASE + 0x2234)
/** GFXMMU_LUT583L Graphic MMU LUT entry 583 low **/
#define GFXMMU_LUT583L			MMIO32(GFXMMU_BASE + 0x2238)
/** GFXMMU_LUT583H Graphic MMU LUT entry 583 high **/
#define GFXMMU_LUT583H			MMIO32(GFXMMU_BASE + 0x223c)
/** GFXMMU_LUT584L Graphic MMU LUT entry 584 low **/
#define GFXMMU_LUT584L			MMIO32(GFXMMU_BASE + 0x2240)
/** GFXMMU_LUT584H Graphic MMU LUT entry 584 high **/
#define GFXMMU_LUT584H			MMIO32(GFXMMU_BASE + 0x2244)
/** GFXMMU_LUT585L Graphic MMU LUT entry 585 low **/
#define GFXMMU_LUT585L			MMIO32(GFXMMU_BASE + 0x2248)
/** GFXMMU_LUT585H Graphic MMU LUT entry 585 high **/
#define GFXMMU_LUT585H			MMIO32(GFXMMU_BASE + 0x224c)
/** GFXMMU_LUT586L Graphic MMU LUT entry 586 low **/
#define GFXMMU_LUT586L			MMIO32(GFXMMU_BASE + 0x2250)
/** GFXMMU_LUT586H Graphic MMU LUT entry 586 high **/
#define GFXMMU_LUT586H			MMIO32(GFXMMU_BASE + 0x2254)
/** GFXMMU_LUT587L Graphic MMU LUT entry 587 low **/
#define GFXMMU_LUT587L			MMIO32(GFXMMU_BASE + 0x2258)
/** GFXMMU_LUT587H Graphic MMU LUT entry 587 high **/
#define GFXMMU_LUT587H			MMIO32(GFXMMU_BASE + 0x225c)
/** GFXMMU_LUT588L Graphic MMU LUT entry 588 low **/
#define GFXMMU_LUT588L			MMIO32(GFXMMU_BASE + 0x2260)
/** GFXMMU_LUT588H Graphic MMU LUT entry 588 high **/
#define GFXMMU_LUT588H			MMIO32(GFXMMU_BASE + 0x2264)
/** GFXMMU_LUT589L Graphic MMU LUT entry 589 low **/
#define GFXMMU_LUT589L			MMIO32(GFXMMU_BASE + 0x2268)
/** GFXMMU_LUT589H Graphic MMU LUT entry 589 high **/
#define GFXMMU_LUT589H			MMIO32(GFXMMU_BASE + 0x226c)
/** GFXMMU_LUT590L Graphic MMU LUT entry 590 low **/
#define GFXMMU_LUT590L			MMIO32(GFXMMU_BASE + 0x2270)
/** GFXMMU_LUT590H Graphic MMU LUT entry 590 high **/
#define GFXMMU_LUT590H			MMIO32(GFXMMU_BASE + 0x2274)
/** GFXMMU_LUT591L Graphic MMU LUT entry 591 low **/
#define GFXMMU_LUT591L			MMIO32(GFXMMU_BASE + 0x2278)
/** GFXMMU_LUT591H Graphic MMU LUT entry 591 high **/
#define GFXMMU_LUT591H			MMIO32(GFXMMU_BASE + 0x227c)
/** GFXMMU_LUT592L Graphic MMU LUT entry 592 low **/
#define GFXMMU_LUT592L			MMIO32(GFXMMU_BASE + 0x2280)
/** GFXMMU_LUT592H Graphic MMU LUT entry 592 high **/
#define GFXMMU_LUT592H			MMIO32(GFXMMU_BASE + 0x2284)
/** GFXMMU_LUT593L Graphic MMU LUT entry 593 low **/
#define GFXMMU_LUT593L			MMIO32(GFXMMU_BASE + 0x2288)
/** GFXMMU_LUT593H Graphic MMU LUT entry 593 high **/
#define GFXMMU_LUT593H			MMIO32(GFXMMU_BASE + 0x228c)
/** GFXMMU_LUT594L Graphic MMU LUT entry 594 low **/
#define GFXMMU_LUT594L			MMIO32(GFXMMU_BASE + 0x2290)
/** GFXMMU_LUT594H Graphic MMU LUT entry 594 high **/
#define GFXMMU_LUT594H			MMIO32(GFXMMU_BASE + 0x2294)
/** GFXMMU_LUT595L Graphic MMU LUT entry 595 low **/
#define GFXMMU_LUT595L			MMIO32(GFXMMU_BASE + 0x2298)
/** GFXMMU_LUT595H Graphic MMU LUT entry 595 high **/
#define GFXMMU_LUT595H			MMIO32(GFXMMU_BASE + 0x229c)
/** GFXMMU_LUT596L Graphic MMU LUT entry 596 low **/
#define GFXMMU_LUT596L			MMIO32(GFXMMU_BASE + 0x22a0)
/** GFXMMU_LUT596H Graphic MMU LUT entry 596 high **/
#define GFXMMU_LUT596H			MMIO32(GFXMMU_BASE + 0x22a4)
/** GFXMMU_LUT597L Graphic MMU LUT entry 597 low **/
#define GFXMMU_LUT597L			MMIO32(GFXMMU_BASE + 0x22a8)
/** GFXMMU_LUT597H Graphic MMU LUT entry 597 high **/
#define GFXMMU_LUT597H			MMIO32(GFXMMU_BASE + 0x22ac)
/** GFXMMU_LUT598L Graphic MMU LUT entry 598 low **/
#define GFXMMU_LUT598L			MMIO32(GFXMMU_BASE + 0x22b0)
/** GFXMMU_LUT598H Graphic MMU LUT entry 598 high **/
#define GFXMMU_LUT598H			MMIO32(GFXMMU_BASE + 0x22b4)
/** GFXMMU_LUT599L Graphic MMU LUT entry 599 low **/
#define GFXMMU_LUT599L			MMIO32(GFXMMU_BASE + 0x22b8)
/** GFXMMU_LUT599H Graphic MMU LUT entry 599 high **/
#define GFXMMU_LUT599H			MMIO32(GFXMMU_BASE + 0x22bc)
/** GFXMMU_LUT600L Graphic MMU LUT entry 600 low **/
#define GFXMMU_LUT600L			MMIO32(GFXMMU_BASE + 0x22c0)
/** GFXMMU_LUT600H Graphic MMU LUT entry 600 high **/
#define GFXMMU_LUT600H			MMIO32(GFXMMU_BASE + 0x22c4)
/** GFXMMU_LUT601L Graphic MMU LUT entry 601 low **/
#define GFXMMU_LUT601L			MMIO32(GFXMMU_BASE + 0x22c8)
/** GFXMMU_LUT601H Graphic MMU LUT entry 601 high **/
#define GFXMMU_LUT601H			MMIO32(GFXMMU_BASE + 0x22cc)
/** GFXMMU_LUT602L Graphic MMU LUT entry 602 low **/
#define GFXMMU_LUT602L			MMIO32(GFXMMU_BASE + 0x22d0)
/** GFXMMU_LUT602H Graphic MMU LUT entry 602 high **/
#define GFXMMU_LUT602H			MMIO32(GFXMMU_BASE + 0x22d4)
/** GFXMMU_LUT603L Graphic MMU LUT entry 603 low **/
#define GFXMMU_LUT603L			MMIO32(GFXMMU_BASE + 0x22d8)
/** GFXMMU_LUT603H Graphic MMU LUT entry 603 high **/
#define GFXMMU_LUT603H			MMIO32(GFXMMU_BASE + 0x22dc)
/** GFXMMU_LUT604L Graphic MMU LUT entry 604 low **/
#define GFXMMU_LUT604L			MMIO32(GFXMMU_BASE + 0x22e0)
/** GFXMMU_LUT604H Graphic MMU LUT entry 604 high **/
#define GFXMMU_LUT604H			MMIO32(GFXMMU_BASE + 0x22e4)
/** GFXMMU_LUT605L Graphic MMU LUT entry 605 low **/
#define GFXMMU_LUT605L			MMIO32(GFXMMU_BASE + 0x22e8)
/** GFXMMU_LUT605H Graphic MMU LUT entry 605 high **/
#define GFXMMU_LUT605H			MMIO32(GFXMMU_BASE + 0x22ec)
/** GFXMMU_LUT606L Graphic MMU LUT entry 606 low **/
#define GFXMMU_LUT606L			MMIO32(GFXMMU_BASE + 0x22f0)
/** GFXMMU_LUT606H Graphic MMU LUT entry 606 high **/
#define GFXMMU_LUT606H			MMIO32(GFXMMU_BASE + 0x22f4)
/** GFXMMU_LUT607L Graphic MMU LUT entry 607 low **/
#define GFXMMU_LUT607L			MMIO32(GFXMMU_BASE + 0x22f8)
/** GFXMMU_LUT607H Graphic MMU LUT entry 607 high **/
#define GFXMMU_LUT607H			MMIO32(GFXMMU_BASE + 0x22fc)
/** GFXMMU_LUT608L Graphic MMU LUT entry 608 low **/
#define GFXMMU_LUT608L			MMIO32(GFXMMU_BASE + 0x2300)
/** GFXMMU_LUT608H Graphic MMU LUT entry 608 high **/
#define GFXMMU_LUT608H			MMIO32(GFXMMU_BASE + 0x2304)
/** GFXMMU_LUT609L Graphic MMU LUT entry 609 low **/
#define GFXMMU_LUT609L			MMIO32(GFXMMU_BASE + 0x2308)
/** GFXMMU_LUT609H Graphic MMU LUT entry 609 high **/
#define GFXMMU_LUT609H			MMIO32(GFXMMU_BASE + 0x230c)
/** GFXMMU_LUT610L Graphic MMU LUT entry 610 low **/
#define GFXMMU_LUT610L			MMIO32(GFXMMU_BASE + 0x2310)
/** GFXMMU_LUT610H Graphic MMU LUT entry 610 high **/
#define GFXMMU_LUT610H			MMIO32(GFXMMU_BASE + 0x2314)
/** GFXMMU_LUT611L Graphic MMU LUT entry 611 low **/
#define GFXMMU_LUT611L			MMIO32(GFXMMU_BASE + 0x2318)
/** GFXMMU_LUT611H Graphic MMU LUT entry 611 high **/
#define GFXMMU_LUT611H			MMIO32(GFXMMU_BASE + 0x231c)
/** GFXMMU_LUT612L Graphic MMU LUT entry 612 low **/
#define GFXMMU_LUT612L			MMIO32(GFXMMU_BASE + 0x2320)
/** GFXMMU_LUT612H Graphic MMU LUT entry 612 high **/
#define GFXMMU_LUT612H			MMIO32(GFXMMU_BASE + 0x2324)
/** GFXMMU_LUT613L Graphic MMU LUT entry 613 low **/
#define GFXMMU_LUT613L			MMIO32(GFXMMU_BASE + 0x2328)
/** GFXMMU_LUT613H Graphic MMU LUT entry 613 high **/
#define GFXMMU_LUT613H			MMIO32(GFXMMU_BASE + 0x232c)
/** GFXMMU_LUT614L Graphic MMU LUT entry 614 low **/
#define GFXMMU_LUT614L			MMIO32(GFXMMU_BASE + 0x2330)
/** GFXMMU_LUT614H Graphic MMU LUT entry 614 high **/
#define GFXMMU_LUT614H			MMIO32(GFXMMU_BASE + 0x2334)
/** GFXMMU_LUT615L Graphic MMU LUT entry 615 low **/
#define GFXMMU_LUT615L			MMIO32(GFXMMU_BASE + 0x2338)
/** GFXMMU_LUT615H Graphic MMU LUT entry 615 high **/
#define GFXMMU_LUT615H			MMIO32(GFXMMU_BASE + 0x233c)
/** GFXMMU_LUT616L Graphic MMU LUT entry 616 low **/
#define GFXMMU_LUT616L			MMIO32(GFXMMU_BASE + 0x2340)
/** GFXMMU_LUT616H Graphic MMU LUT entry 616 high **/
#define GFXMMU_LUT616H			MMIO32(GFXMMU_BASE + 0x2344)
/** GFXMMU_LUT617L Graphic MMU LUT entry 617 low **/
#define GFXMMU_LUT617L			MMIO32(GFXMMU_BASE + 0x2348)
/** GFXMMU_LUT617H Graphic MMU LUT entry 617 high **/
#define GFXMMU_LUT617H			MMIO32(GFXMMU_BASE + 0x234c)
/** GFXMMU_LUT618L Graphic MMU LUT entry 618 low **/
#define GFXMMU_LUT618L			MMIO32(GFXMMU_BASE + 0x2350)
/** GFXMMU_LUT618H Graphic MMU LUT entry 618 high **/
#define GFXMMU_LUT618H			MMIO32(GFXMMU_BASE + 0x2354)
/** GFXMMU_LUT619L Graphic MMU LUT entry 619 low **/
#define GFXMMU_LUT619L			MMIO32(GFXMMU_BASE + 0x2358)
/** GFXMMU_LUT619H Graphic MMU LUT entry 619 high **/
#define GFXMMU_LUT619H			MMIO32(GFXMMU_BASE + 0x235c)
/** GFXMMU_LUT620L Graphic MMU LUT entry 620 low **/
#define GFXMMU_LUT620L			MMIO32(GFXMMU_BASE + 0x2360)
/** GFXMMU_LUT620H Graphic MMU LUT entry 620 high **/
#define GFXMMU_LUT620H			MMIO32(GFXMMU_BASE + 0x2364)
/** GFXMMU_LUT621L Graphic MMU LUT entry 621 low **/
#define GFXMMU_LUT621L			MMIO32(GFXMMU_BASE + 0x2368)
/** GFXMMU_LUT621H Graphic MMU LUT entry 621 high **/
#define GFXMMU_LUT621H			MMIO32(GFXMMU_BASE + 0x236c)
/** GFXMMU_LUT622L Graphic MMU LUT entry 622 low **/
#define GFXMMU_LUT622L			MMIO32(GFXMMU_BASE + 0x2370)
/** GFXMMU_LUT622H Graphic MMU LUT entry 622 high **/
#define GFXMMU_LUT622H			MMIO32(GFXMMU_BASE + 0x2374)
/** GFXMMU_LUT623L Graphic MMU LUT entry 623 low **/
#define GFXMMU_LUT623L			MMIO32(GFXMMU_BASE + 0x2378)
/** GFXMMU_LUT623H Graphic MMU LUT entry 623 high **/
#define GFXMMU_LUT623H			MMIO32(GFXMMU_BASE + 0x237c)
/** GFXMMU_LUT624L Graphic MMU LUT entry 624 low **/
#define GFXMMU_LUT624L			MMIO32(GFXMMU_BASE + 0x2380)
/** GFXMMU_LUT624H Graphic MMU LUT entry 624 high **/
#define GFXMMU_LUT624H			MMIO32(GFXMMU_BASE + 0x2384)
/** GFXMMU_LUT625L Graphic MMU LUT entry 625 low **/
#define GFXMMU_LUT625L			MMIO32(GFXMMU_BASE + 0x2388)
/** GFXMMU_LUT625H Graphic MMU LUT entry 625 high **/
#define GFXMMU_LUT625H			MMIO32(GFXMMU_BASE + 0x238c)
/** GFXMMU_LUT626L Graphic MMU LUT entry 626 low **/
#define GFXMMU_LUT626L			MMIO32(GFXMMU_BASE + 0x2390)
/** GFXMMU_LUT626H Graphic MMU LUT entry 626 high **/
#define GFXMMU_LUT626H			MMIO32(GFXMMU_BASE + 0x2394)
/** GFXMMU_LUT627L Graphic MMU LUT entry 627 low **/
#define GFXMMU_LUT627L			MMIO32(GFXMMU_BASE + 0x2398)
/** GFXMMU_LUT627H Graphic MMU LUT entry 627 high **/
#define GFXMMU_LUT627H			MMIO32(GFXMMU_BASE + 0x239c)
/** GFXMMU_LUT628L Graphic MMU LUT entry 628 low **/
#define GFXMMU_LUT628L			MMIO32(GFXMMU_BASE + 0x23a0)
/** GFXMMU_LUT628H Graphic MMU LUT entry 628 high **/
#define GFXMMU_LUT628H			MMIO32(GFXMMU_BASE + 0x23a4)
/** GFXMMU_LUT629L Graphic MMU LUT entry 629 low **/
#define GFXMMU_LUT629L			MMIO32(GFXMMU_BASE + 0x23a8)
/** GFXMMU_LUT629H Graphic MMU LUT entry 629 high **/
#define GFXMMU_LUT629H			MMIO32(GFXMMU_BASE + 0x23ac)
/** GFXMMU_LUT630L Graphic MMU LUT entry 630 low **/
#define GFXMMU_LUT630L			MMIO32(GFXMMU_BASE + 0x23b0)
/** GFXMMU_LUT630H Graphic MMU LUT entry 630 high **/
#define GFXMMU_LUT630H			MMIO32(GFXMMU_BASE + 0x23b4)
/** GFXMMU_LUT631L Graphic MMU LUT entry 631 low **/
#define GFXMMU_LUT631L			MMIO32(GFXMMU_BASE + 0x23b8)
/** GFXMMU_LUT631H Graphic MMU LUT entry 631 high **/
#define GFXMMU_LUT631H			MMIO32(GFXMMU_BASE + 0x23bc)
/** GFXMMU_LUT632L Graphic MMU LUT entry 632 low **/
#define GFXMMU_LUT632L			MMIO32(GFXMMU_BASE + 0x23c0)
/** GFXMMU_LUT632H Graphic MMU LUT entry 632 high **/
#define GFXMMU_LUT632H			MMIO32(GFXMMU_BASE + 0x23c4)
/** GFXMMU_LUT633L Graphic MMU LUT entry 633 low **/
#define GFXMMU_LUT633L			MMIO32(GFXMMU_BASE + 0x23c8)
/** GFXMMU_LUT633H Graphic MMU LUT entry 633 high **/
#define GFXMMU_LUT633H			MMIO32(GFXMMU_BASE + 0x23cc)
/** GFXMMU_LUT634L Graphic MMU LUT entry 634 low **/
#define GFXMMU_LUT634L			MMIO32(GFXMMU_BASE + 0x23d0)
/** GFXMMU_LUT634H Graphic MMU LUT entry 634 high **/
#define GFXMMU_LUT634H			MMIO32(GFXMMU_BASE + 0x23d4)
/** GFXMMU_LUT635L Graphic MMU LUT entry 635 low **/
#define GFXMMU_LUT635L			MMIO32(GFXMMU_BASE + 0x23d8)
/** GFXMMU_LUT635H Graphic MMU LUT entry 635 high **/
#define GFXMMU_LUT635H			MMIO32(GFXMMU_BASE + 0x23dc)
/** GFXMMU_LUT636L Graphic MMU LUT entry 636 low **/
#define GFXMMU_LUT636L			MMIO32(GFXMMU_BASE + 0x23e0)
/** GFXMMU_LUT636H Graphic MMU LUT entry 636 high **/
#define GFXMMU_LUT636H			MMIO32(GFXMMU_BASE + 0x23e4)
/** GFXMMU_LUT637L Graphic MMU LUT entry 637 low **/
#define GFXMMU_LUT637L			MMIO32(GFXMMU_BASE + 0x23e8)
/** GFXMMU_LUT637H Graphic MMU LUT entry 637 high **/
#define GFXMMU_LUT637H			MMIO32(GFXMMU_BASE + 0x23ec)
/** GFXMMU_LUT638L Graphic MMU LUT entry 638 low **/
#define GFXMMU_LUT638L			MMIO32(GFXMMU_BASE + 0x23f0)
/** GFXMMU_LUT638H Graphic MMU LUT entry 638 high **/
#define GFXMMU_LUT638H			MMIO32(GFXMMU_BASE + 0x23f4)
/** GFXMMU_LUT639L Graphic MMU LUT entry 639 low **/
#define GFXMMU_LUT639L			MMIO32(GFXMMU_BASE + 0x23f8)
/** GFXMMU_LUT639H Graphic MMU LUT entry 639 high **/
#define GFXMMU_LUT639H			MMIO32(GFXMMU_BASE + 0x23fc)
/** GFXMMU_LUT640L Graphic MMU LUT entry 640 low **/
#define GFXMMU_LUT640L			MMIO32(GFXMMU_BASE + 0x2400)
/** GFXMMU_LUT640H Graphic MMU LUT entry 640 high **/
#define GFXMMU_LUT640H			MMIO32(GFXMMU_BASE + 0x2404)
/** GFXMMU_LUT641L Graphic MMU LUT entry 641 low **/
#define GFXMMU_LUT641L			MMIO32(GFXMMU_BASE + 0x2408)
/** GFXMMU_LUT641H Graphic MMU LUT entry 641 high **/
#define GFXMMU_LUT641H			MMIO32(GFXMMU_BASE + 0x240c)
/** GFXMMU_LUT642L Graphic MMU LUT entry 642 low **/
#define GFXMMU_LUT642L			MMIO32(GFXMMU_BASE + 0x2410)
/** GFXMMU_LUT642H Graphic MMU LUT entry 642 high **/
#define GFXMMU_LUT642H			MMIO32(GFXMMU_BASE + 0x2414)
/** GFXMMU_LUT643L Graphic MMU LUT entry 643 low **/
#define GFXMMU_LUT643L			MMIO32(GFXMMU_BASE + 0x2418)
/** GFXMMU_LUT643H Graphic MMU LUT entry 643 high **/
#define GFXMMU_LUT643H			MMIO32(GFXMMU_BASE + 0x241c)
/** GFXMMU_LUT644L Graphic MMU LUT entry 644 low **/
#define GFXMMU_LUT644L			MMIO32(GFXMMU_BASE + 0x2420)
/** GFXMMU_LUT644H Graphic MMU LUT entry 644 high **/
#define GFXMMU_LUT644H			MMIO32(GFXMMU_BASE + 0x2424)
/** GFXMMU_LUT645L Graphic MMU LUT entry 645 low **/
#define GFXMMU_LUT645L			MMIO32(GFXMMU_BASE + 0x2428)
/** GFXMMU_LUT645H Graphic MMU LUT entry 645 high **/
#define GFXMMU_LUT645H			MMIO32(GFXMMU_BASE + 0x242c)
/** GFXMMU_LUT646L Graphic MMU LUT entry 646 low **/
#define GFXMMU_LUT646L			MMIO32(GFXMMU_BASE + 0x2430)
/** GFXMMU_LUT646H Graphic MMU LUT entry 646 high **/
#define GFXMMU_LUT646H			MMIO32(GFXMMU_BASE + 0x2434)
/** GFXMMU_LUT647L Graphic MMU LUT entry 647 low **/
#define GFXMMU_LUT647L			MMIO32(GFXMMU_BASE + 0x2438)
/** GFXMMU_LUT647H Graphic MMU LUT entry 647 high **/
#define GFXMMU_LUT647H			MMIO32(GFXMMU_BASE + 0x243c)
/** GFXMMU_LUT648L Graphic MMU LUT entry 648 low **/
#define GFXMMU_LUT648L			MMIO32(GFXMMU_BASE + 0x2440)
/** GFXMMU_LUT648H Graphic MMU LUT entry 648 high **/
#define GFXMMU_LUT648H			MMIO32(GFXMMU_BASE + 0x2444)
/** GFXMMU_LUT649L Graphic MMU LUT entry 649 low **/
#define GFXMMU_LUT649L			MMIO32(GFXMMU_BASE + 0x2448)
/** GFXMMU_LUT649H Graphic MMU LUT entry 649 high **/
#define GFXMMU_LUT649H			MMIO32(GFXMMU_BASE + 0x244c)
/** GFXMMU_LUT650L Graphic MMU LUT entry 650 low **/
#define GFXMMU_LUT650L			MMIO32(GFXMMU_BASE + 0x2450)
/** GFXMMU_LUT650H Graphic MMU LUT entry 650 high **/
#define GFXMMU_LUT650H			MMIO32(GFXMMU_BASE + 0x2454)
/** GFXMMU_LUT651L Graphic MMU LUT entry 651 low **/
#define GFXMMU_LUT651L			MMIO32(GFXMMU_BASE + 0x2458)
/** GFXMMU_LUT651H Graphic MMU LUT entry 651 high **/
#define GFXMMU_LUT651H			MMIO32(GFXMMU_BASE + 0x245c)
/** GFXMMU_LUT652L Graphic MMU LUT entry 652 low **/
#define GFXMMU_LUT652L			MMIO32(GFXMMU_BASE + 0x2460)
/** GFXMMU_LUT652H Graphic MMU LUT entry 652 high **/
#define GFXMMU_LUT652H			MMIO32(GFXMMU_BASE + 0x2464)
/** GFXMMU_LUT653L Graphic MMU LUT entry 653 low **/
#define GFXMMU_LUT653L			MMIO32(GFXMMU_BASE + 0x2468)
/** GFXMMU_LUT653H Graphic MMU LUT entry 653 high **/
#define GFXMMU_LUT653H			MMIO32(GFXMMU_BASE + 0x246c)
/** GFXMMU_LUT654L Graphic MMU LUT entry 654 low **/
#define GFXMMU_LUT654L			MMIO32(GFXMMU_BASE + 0x2470)
/** GFXMMU_LUT654H Graphic MMU LUT entry 654 high **/
#define GFXMMU_LUT654H			MMIO32(GFXMMU_BASE + 0x2474)
/** GFXMMU_LUT655L Graphic MMU LUT entry 655 low **/
#define GFXMMU_LUT655L			MMIO32(GFXMMU_BASE + 0x2478)
/** GFXMMU_LUT655H Graphic MMU LUT entry 655 high **/
#define GFXMMU_LUT655H			MMIO32(GFXMMU_BASE + 0x247c)
/** GFXMMU_LUT656L Graphic MMU LUT entry 656 low **/
#define GFXMMU_LUT656L			MMIO32(GFXMMU_BASE + 0x2480)
/** GFXMMU_LUT656H Graphic MMU LUT entry 656 high **/
#define GFXMMU_LUT656H			MMIO32(GFXMMU_BASE + 0x2484)
/** GFXMMU_LUT657L Graphic MMU LUT entry 657 low **/
#define GFXMMU_LUT657L			MMIO32(GFXMMU_BASE + 0x2488)
/** GFXMMU_LUT657H Graphic MMU LUT entry 657 high **/
#define GFXMMU_LUT657H			MMIO32(GFXMMU_BASE + 0x248c)
/** GFXMMU_LUT658L Graphic MMU LUT entry 658 low **/
#define GFXMMU_LUT658L			MMIO32(GFXMMU_BASE + 0x2490)
/** GFXMMU_LUT658H Graphic MMU LUT entry 658 high **/
#define GFXMMU_LUT658H			MMIO32(GFXMMU_BASE + 0x2494)
/** GFXMMU_LUT659L Graphic MMU LUT entry 659 low **/
#define GFXMMU_LUT659L			MMIO32(GFXMMU_BASE + 0x2498)
/** GFXMMU_LUT659H Graphic MMU LUT entry 659 high **/
#define GFXMMU_LUT659H			MMIO32(GFXMMU_BASE + 0x249c)
/** GFXMMU_LUT660L Graphic MMU LUT entry 660 low **/
#define GFXMMU_LUT660L			MMIO32(GFXMMU_BASE + 0x24a0)
/** GFXMMU_LUT660H Graphic MMU LUT entry 660 high **/
#define GFXMMU_LUT660H			MMIO32(GFXMMU_BASE + 0x24a4)
/** GFXMMU_LUT661L Graphic MMU LUT entry 661 low **/
#define GFXMMU_LUT661L			MMIO32(GFXMMU_BASE + 0x24a8)
/** GFXMMU_LUT661H Graphic MMU LUT entry 661 high **/
#define GFXMMU_LUT661H			MMIO32(GFXMMU_BASE + 0x24ac)
/** GFXMMU_LUT662L Graphic MMU LUT entry 662 low **/
#define GFXMMU_LUT662L			MMIO32(GFXMMU_BASE + 0x24b0)
/** GFXMMU_LUT662H Graphic MMU LUT entry 662 high **/
#define GFXMMU_LUT662H			MMIO32(GFXMMU_BASE + 0x24b4)
/** GFXMMU_LUT663L Graphic MMU LUT entry 663 low **/
#define GFXMMU_LUT663L			MMIO32(GFXMMU_BASE + 0x24b8)
/** GFXMMU_LUT663H Graphic MMU LUT entry 663 high **/
#define GFXMMU_LUT663H			MMIO32(GFXMMU_BASE + 0x24bc)
/** GFXMMU_LUT664L Graphic MMU LUT entry 664 low **/
#define GFXMMU_LUT664L			MMIO32(GFXMMU_BASE + 0x24c0)
/** GFXMMU_LUT664H Graphic MMU LUT entry 664 high **/
#define GFXMMU_LUT664H			MMIO32(GFXMMU_BASE + 0x24c4)
/** GFXMMU_LUT665L Graphic MMU LUT entry 665 low **/
#define GFXMMU_LUT665L			MMIO32(GFXMMU_BASE + 0x24c8)
/** GFXMMU_LUT665H Graphic MMU LUT entry 665 high **/
#define GFXMMU_LUT665H			MMIO32(GFXMMU_BASE + 0x24cc)
