grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT666L Graphic MMU LUT entry 666 low **/
#define GFXMMU_LUT666L			MMIO32(GFXMMU_BASE + 0x24d0)
/** GFXMMU_LUT666H Graphic MMU LUT entry 666 high **/
#define GFXMMU_LUT666H			MMIO32(GFXMMU_BASE + 0x24d4)
/** GFXMMU_LUT667L Graphic MMU LUT entry 667 low **/
#define GFXMMU_LUT667L			MMIO32(GFXMMU_BASE + 0x24d8)
/** GFXMMU_LUT667H Graphic MMU LUT entry 667 high **/
#define GFXMMU_LUT667H			MMIO32(GFXMMU_BASE + 0x24dc)
/** GFXMMU_LUT668L Graphic MMU LUT entry 668 low **/
#define GFXMMU_LUT668L			MMIO32(GFXMMU_BASE + 0x24e0)
/** GFXMMU_LUT668H Graphic MMU LUT entry 668 high **/
#define GFXMMU_LUT668H			MMIO32(GFXMMU_BASE + 0x24e4)
/** GFXMMU_LUT669L Graphic MMU LUT entry 669 low **/
#define GFXMMU_LUT669L			MMIO32(GFXMMU_BASE + 0x24e8)
/** GFXMMU_LUT669H Graphic MMU LUT entry 669 high **/
#define GFXMMU_LUT669H			MMIO32(GFXMMU_BASE + 0x24ec)
/** GFXMMU_LUT670L Graphic MMU LUT entry 670 low **/
#define GFXMMU_LUT670L			MMIO32(GFXMMU_BASE + 0x24f0)
/** GFXMMU_LUT670H Graphic MMU LUT entry 670 high **/
#define GFXMMU_LUT670H			MMIO32(GFXMMU_BASE + 0x24f4)
/** GFXMMU_LUT671L Graphic MMU LUT entry 671 low **/
#define GFXMMU_LUT671L			MMIO32(GFXMMU_BASE + 0x24f8)
/** GFXMMU_LUT671H Graphic MMU LUT entry 671 high **/
#define GFXMMU_LUT671H			MMIO32(GFXMMU_BASE + 0x24fc)
/** GFXMMU_LUT672L Graphic MMU LUT entry 672 low **/
#define GFXMMU_LUT672L			MMIO32(GFXMMU_BASE + 0x2500)
/** GFXMMU_LUT672H Graphic MMU LUT entry 672 high **/
#define GFXMMU_LUT672H			MMIO32(GFXMMU_BASE + 0x2504)
/** GFXMMU_LUT673L Graphic MMU LUT entry 673 low **/
#define GFXMMU_LUT673L			MMIO32(GFXMMU_BASE + 0x2508)
/** GFXMMU_LUT673H Graphic MMU LUT entry 673 high **/
#define GFXMMU_LUT673H			MMIO32(GFXMMU_BASE + 0x250c)
/** GFXMMU_LUT674L Graphic MMU LUT entry 674 low **/
#define GFXMMU_LUT674L			MMIO32(GFXMMU_BASE + 0x2510)
/** GFXMMU_LUT674H Graphic MMU LUT entry 674 high **/
#define GFXMMU_LUT674H			MMIO32(GFXMMU_BASE + 0x2514)
/** GFXMMU_LUT675L Graphic MMU LUT entry 675 low **/
#define GFXMMU_LUT675L			MMIO32(GFXMMU_BASE + 0x2518)
/** GFXMMU_LUT675H Graphic MMU LUT entry 675 high **/
#define GFXMMU_LUT675H			MMIO32(GFXMMU_BASE + 0x251c)
/** GFXMMU_LUT676L Graphic MMU LUT entry 676 low **/
#define GFXMMU_LUT676L			MMIO32(GFXMMU_BASE + 0x2520)
/** GFXMMU_LUT676H Graphic MMU LUT entry 676 high **/
#define GFXMMU_LUT676H			MMIO32(GFXMMU_BASE + 0x2524)
/** GFXMMU_LUT677L Graphic MMU LUT entry 677 low **/
#define GFXMMU_LUT677L			MMIO32(GFXMMU_BASE + 0x2528)
/** GFXMMU_LUT677H Graphic MMU LUT entry 677 high **/
#define GFXMMU_LUT677H			MMIO32(GFXMMU_BASE + 0x252c)
/** GFXMMU_LUT678L Graphic MMU LUT entry 678 low **/
#define GFXMMU_LUT678L			MMIO32(GFXMMU_BASE + 0x2530)
/** GFXMMU_LUT678H Graphic MMU LUT entry 678 high **/
#define GFXMMU_LUT678H			MMIO32(GFXMMU_BASE + 0x2534)
/** GFXMMU_LUT679L Graphic MMU LUT entry 679 low **/
#define GFXMMU_LUT679L			MMIO32(GFXMMU_BASE + 0x2538)
/** GFXMMU_LUT679H Graphic MMU LUT entry 679 high **/
#define GFXMMU_LUT679H			MMIO32(GFXMMU_BASE + 0x253c)
/** GFXMMU_LUT680L Graphic MMU LUT entry 680 low **/
#define GFXMMU_LUT680L			MMIO32(GFXMMU_BASE + 0x2540)
/** GFXMMU_LUT680H Graphic MMU LUT entry 680 high **/
#define GFXMMU_LUT680H			MMIO32(GFXMMU_BASE + 0x2544)
/** GFXMMU_LUT681L Graphic MMU LUT entry 681 low **/
#define GFXMMU_LUT681L			MMIO32(GFXMMU_BASE + 0x2548)
/** GFXMMU_LUT681H Graphic MMU LUT entry 681 high **/
#define GFXMMU_LUT681H			MMIO32(GFXMMU_BASE + 0x254c)
/** GFXMMU_LUT682L Graphic MMU LUT entry 682 low **/
#define GFXMMU_LUT682L			MMIO32(GFXMMU_BASE + 0x2550)
/** GFXMMU_LUT682H Graphic MMU LUT entry 682 high **/
#define GFXMMU_LUT682H			MMIO32(GFXMMU_BASE + 0x2554)
/** GFXMMU_LUT683L Graphic MMU LUT entry 683 low **/
#define GFXMMU_LUT683L			MMIO32(GFXMMU_BASE + 0x2558)
/** GFXMMU_LUT683H Graphic MMU LUT entry 683 high **/
#define GFXMMU_LUT683H			MMIO32(GFXMMU_BASE + 0x255c)
/** GFXMMU_LUT684L Graphic MMU LUT entry 684 low **/
#define GFXMMU_LUT684L			MMIO32(GFXMMU_BASE + 0x2560)
/** GFXMMU_LUT684H Graphic MMU LUT entry 684 high **/
#define GFXMMU_LUT684H			MMIO32(GFXMMU_BASE + 0x2564)
/** GFXMMU_LUT685L Graphic MMU LUT entry 685 low **/
#define GFXMMU_LUT685L			MMIO32(GFXMMU_BASE + 0x2568)
/** GFXMMU_LUT685H Graphic MMU LUT entry 685 high **/
#define GFXMMU_LUT685H			MMIO32(GFXMMU_BASE + 0x256c)
/** GFXMMU_LUT686L Graphic MMU LUT entry 686 low **/
#define GFXMMU_LUT686L			MMIO32(GFXMMU_BASE + 0x2570)
/** GFXMMU_LUT686H Graphic MMU LUT entry 686 high **/
#define GFXMMU_LUT686H			MMIO32(GFXMMU_BASE + 0x2574)
/** GFXMMU_LUT687L Graphic MMU LUT entry 687 low **/
#define GFXMMU_LUT687L			MMIO32(GFXMMU_BASE + 0x2578)
/** GFXMMU_LUT687H Graphic MMU LUT entry 687 high **/
#define GFXMMU_LUT687H			MMIO32(GFXMMU_BASE + 0x257c)
/** GFXMMU_LUT688L Graphic MMU LUT entry 688 low **/
#define GFXMMU_LUT688L			MMIO32(GFXMMU_BASE + 0x2580)
/** GFXMMU_LUT688H Graphic MMU LUT entry 688 high **/
#define GFXMMU_LUT688H			MMIO32(GFXMMU_BASE + 0x2584)
/** GFXMMU_LUT689L Graphic MMU LUT entry 689 low **/
#define GFXMMU_LUT689L			MMIO32(GFXMMU_BASE + 0x2588)
/** GFXMMU_LUT689H Graphic MMU LUT entry 689 high **/
#define GFXMMU_LUT689H			MMIO32(GFXMMU_BASE + 0x258c)
/** GFXMMU_LUT690L Graphic MMU LUT entry 690 low **/
#define GFXMMU_LUT690L			MMIO32(GFXMMU_BASE + 0x2590)
/** GFXMMU_LUT690H Graphic MMU LUT entry 690 high **/
#define GFXMMU_LUT690H			MMIO32(GFXMMU_BASE + 0x2594)
/** GFXMMU_LUT691L Graphic MMU LUT entry 691 low **/
#define GFXMMU_LUT691L			MMIO32(GFXMMU_BASE + 0x2598)
/** GFXMMU_LUT691H Graphic MMU LUT entry 691 high **/
#define GFXMMU_LUT691H			MMIO32(GFXMMU_BASE + 0x259c)
/** GFXMMU_LUT692L Graphic MMU LUT entry 692 low **/
#define GFXMMU_LUT692L			MMIO32(GFXMMU_BASE + 0x25a0)
/** GFXMMU_LUT692H Graphic MMU LUT entry 692 high **/
#define GFXMMU_LUT692H			MMIO32(GFXMMU_BASE + 0x25a4)
/** GFXMMU_LUT693L Graphic MMU LUT entry 693 low **/
#define GFXMMU_LUT693L			MMIO32(GFXMMU_BASE + 0x25a8)
/** GFXMMU_LUT693H Graphic MMU LUT entry 693 high **/
#define GFXMMU_LUT693H			MMIO32(GFXMMU_BASE + 0x25ac)
/** GFXMMU_LUT694L Graphic MMU LUT entry 694 low **/
#define GFXMMU_LUT694L			MMIO32(GFXMMU_BASE + 0x25b0)
/** GFXMMU_LUT694H Graphic MMU LUT entry 694 high **/
#define GFXMMU_LUT694H			MMIO32(GFXMMU_BASE + 0x25b4)
/** GFXMMU_LUT695L Graphic MMU LUT entry 695 low **/
#define GFXMMU_LUT695L			MMIO32(GFXMMU_BASE + 0x25b8)
/** GFXMMU_LUT695H Graphic MMU LUT entry 695 high **/
#define GFXMMU_LUT695H			MMIO32(GFXMMU_BASE + 0x25bc)
/** GFXMMU_LUT696L Graphic MMU LUT entry 696 low **/
#define GFXMMU_LUT696L			MMIO32(GFXMMU_BASE + 0x25c0)
/** GFXMMU_LUT696H Graphic MMU LUT entry 696 high **/
#define GFXMMU_LUT696H			MMIO32(GFXMMU_BASE + 0x25c4)
/** GFXMMU_LUT697L Graphic MMU LUT entry 697 low **/
#define GFXMMU_LUT697L			MMIO32(GFXMMU_BASE + 0x25c8)
/** GFXMMU_LUT697H Graphic MMU LUT entry 697 high **/
#define GFXMMU_LUT697H			MMIO32(GFXMMU_BASE + 0x25cc)
/** GFXMMU_LUT698L Graphic MMU LUT entry 698 low **/
#define GFXMMU_LUT698L			MMIO32(GFXMMU_BASE + 0x25d0)
/** GFXMMU_LUT698H Graphic MMU LUT entry 698 high **/
#define GFXMMU_LUT698H			MMIO32(GFXMMU_BASE + 0x25d4)
/** GFXMMU_LUT699L Graphic MMU LUT entry 699 low **/
#define GFXMMU_LUT699L			MMIO32(GFXMMU_BASE + 0x25d8)
/** GFXMMU_LUT699H Graphic MMU LUT entry 699 high **/
#define GFXMMU_LUT699H			MMIO32(GFXMMU_BASE + 0x25dc)
/** GFXMMU_LUT700L Graphic MMU LUT entry 700 low **/
#define GFXMMU_LUT700L			MMIO32(GFXMMU_BASE + 0x25e0)
/** GFXMMU_LUT700H Graphic MMU LUT entry 700 high **/
#define GFXMMU_LUT700H			MMIO32(GFXMMU_BASE + 0x25e4)
/** GFXMMU_LUT701L Graphic MMU LUT entry 701 low **/
#define GFXMMU_LUT701L			MMIO32(GFXMMU_BASE + 0x25e8)
/** GFXMMU_LUT701H Graphic MMU LUT entry 701 high **/
#define GFXMMU_LUT701H			MMIO32(GFXMMU_BASE + 0x25ec)
/** GFXMMU_LUT702L Graphic MMU LUT entry 702 low **/
#define GFXMMU_LUT702L			MMIO32(GFXMMU_BASE + 0x25f0)
/** GFXMMU_LUT702H Graphic MMU LUT entry 702 high **/
#define GFXMMU_LUT702H			MMIO32(GFXMMU_BASE + 0x25f4)
/** GFXMMU_LUT703L Graphic MMU LUT entry 703 low **/
#define GFXMMU_LUT703L			MMIO32(GFXMMU_BASE + 0x25f8)
/** GFXMMU_LUT703H Graphic MMU LUT entry 703 high **/
#define GFXMMU_LUT703H			MMIO32(GFXMMU_BASE + 0x25fc)
/** GFXMMU_LUT704L Graphic MMU LUT entry 704 low **/
#define GFXMMU_LUT704L			MMIO32(GFXMMU_BASE + 0x2600)
/** GFXMMU_LUT704H Graphic MMU LUT entry 704 high **/
#define GFXMMU_LUT704H			MMIO32(GFXMMU_BASE + 0x2604)
/** GFXMMU_LUT705L Graphic MMU LUT entry 705 low **/
#define GFXMMU_LUT705L			MMIO32(GFXMMU_BASE + 0x2608)
/** GFXMMU_LUT705H Graphic MMU LUT entry 705 high **/
#define GFXMMU_LUT705H			MMIO32(GFXMMU_BASE + 0x260c)
/** GFXMMU_LUT706L Graphic MMU LUT entry 706 low **/
#define GFXMMU_LUT706L			MMIO32(GFXMMU_BASE + 0x2610)
/** GFXMMU_LUT706H Graphic MMU LUT entry 706 high **/
#define GFXMMU_LUT706H			MMIO32(GFXMMU_BASE + 0x2614)
/** GFXMMU_LUT707L Graphic MMU LUT entry 707 low **/
#define GFXMMU_LUT707L			MMIO32(GFXMMU_BASE + 0x2618)
/** GFXMMU_LUT707H Graphic MMU LUT entry 707 high **/
#define GFXMMU_LUT707H			MMIO32(GFXMMU_BASE + 0x261c)
/** GFXMMU_LUT708L Graphic MMU LUT entry 708 low **/
#define GFXMMU_LUT708L			MMIO32(GFXMMU_BASE + 0x2620)
/** GFXMMU_LUT708H Graphic MMU LUT entry 708 high **/
#define GFXMMU_LUT708H			MMIO32(GFXMMU_BASE + 0x2624)
/** GFXMMU_LUT709L Graphic MMU LUT entry 709 low **/
#define GFXMMU_LUT709L			MMIO32(GFXMMU_BASE + 0x2628)
/** GFXMMU_LUT709H Graphic MMU LUT entry 709 high **/
#define GFXMMU_LUT709H			MMIO32(GFXMMU_BASE + 0x262c)
/** GFXMMU_LUT710L Graphic MMU LUT entry 710 low **/
#define GFXMMU_LUT710L			MMIO32(GFXMMU_BASE + 0x2630)
/** GFXMMU_LUT710H Graphic MMU LUT entry 710 high **/
#define GFXMMU_LUT710H			MMIO32(GFXMMU_BASE + 0x2634)
/** GFXMMU_LUT711L Graphic MMU LUT entry 711 low **/
#define GFXMMU_LUT711L			MMIO32(GFXMMU_BASE + 0x2638)
/** GFXMMU_LUT711H Graphic MMU LUT entry 711 high **/
#define GFXMMU_LUT711H			MMIO32(GFXMMU_BASE + 0x263c)
/** GFXMMU_LUT712L Graphic MMU LUT entry 712 low **/
#define GFXMMU_LUT712L			MMIO32(GFXMMU_BASE + 0x2640)
/** GFXMMU_LUT712H Graphic MMU LUT entry 712 high **/
#define GFXMMU_LUT712H			MMIO32(GFXMMU_BASE + 0x2644)
/** GFXMMU_LUT713L Graphic MMU LUT entry 713 low **/
#define GFXMMU_LUT713L			MMIO32(GFXMMU_BASE + 0x2648)
/** GFXMMU_LUT713H Graphic MMU LUT entry 713 high **/
#define GFXMMU_LUT713H			MMIO32(GFXMMU_BASE + 0x264c)
/** GFXMMU_LUT714L Graphic MMU LUT entry 714 low **/
#define GFXMMU_LUT714L			MMIO32(GFXMMU_BASE + 0x2650)
/** GFXMMU_LUT714H Graphic MMU LUT entry 714 high **/
#define GFXMMU_LUT714H			MMIO32(GFXMMU_BASE + 0x2654)
/** GFXMMU_LUT715L Graphic MMU LUT entry 715 low **/
#define GFXMMU_LUT715L			MMIO32(GFXMMU_BASE + 0x2658)
/** GFXMMU_LUT715H Graphic MMU LUT entry 715 high **/
#define GFXMMU_LUT715H			MMIO32(GFXMMU_BASE + 0x265c)
/** GFXMMU_LUT716L Graphic MMU LUT entry 716 low **/
#define GFXMMU_LUT716L			MMIO32(GFXMMU_BASE + 0x2660)
/** GFXMMU_LUT716H Graphic MMU LUT entry 716 high **/
#define GFXMMU_LUT716H			MMIO32(GFXMMU_BASE + 0x2664)
/** GFXMMU_LUT717L Graphic MMU LUT entry 717 low **/
#define GFXMMU_LUT717L			MMIO32(GFXMMU_BASE + 0x2668)
/** GFXMMU_LUT717H Graphic MMU LUT entry 717 high **/
#define GFXMMU_LUT717H			MMIO32(GFXMMU_BASE + 0x266c)
/** GFXMMU_LUT718L Graphic MMU LUT entry 718 low **/
#define GFXMMU_LUT718L			MMIO32(GFXMMU_BASE + 0x2670)
/** GFXMMU_LUT718H Graphic MMU LUT entry 718 high **/
#define GFXMMU_LUT718H			MMIO32(GFXMMU_BASE + 0x2674)
/** GFXMMU_LUT719L Graphic MMU LUT entry 719 low **/
#define GFXMMU_LUT719L			MMIO32(GFXMMU_BASE + 0x2678)
/** GFXMMU_LUT719H Graphic MMU LUT entry 719 high **/
#define GFXMMU_LUT719H			MMIO32(GFXMMU_BASE + 0x267c)
/** GFXMMU_LUT720L Graphic MMU LUT entry 720 low **/
#define GFXMMU_LUT720L			MMIO32(GFXMMU_BASE + 0x2680)
/** GFXMMU_LUT720H Graphic MMU LUT entry 720 high **/
#define GFXMMU_LUT720H			MMIO32(GFXMMU_BASE + 0x2684)
/** GFXMMU_LUT721L Graphic MMU LUT entry 721 low **/
#define GFXMMU_LUT721L			MMIO32(GFXMMU_BASE + 0x2688)
/** GFXMMU_LUT721H Graphic MMU LUT entry 721 high **/
#define GFXMMU_LUT721H			MMIO32(GFXMMU_BASE + 0x268c)
/** GFXMMU_LUT722L Graphic MMU LUT entry 722 low **/
#define GFXMMU_LUT722L			MMIO32(GFXMMU_BASE + 0x2690)
/** GFXMMU_LUT722H Graphic MMU LUT entry 722 high **/
#define GFXMMU_LUT722H			MMIO32(GFXMMU_BASE + 0x2694)
/** GFXMMU_LUT723L Graphic MMU LUT entry 723 low **/
#define GFXMMU_LUT723L			MMIO32(GFXMMU_BASE + 0x2698)
/** GFXMMU_LUT723H Graphic MMU LUT entry 723 high **/
#define GFXMMU_LUT723H			MMIO32(GFXMMU_BASE + 0x269c)
/** GFXMMU_LUT724L Graphic MMU LUT entry 724 low **/
#define GFXMMU_LUT724L			MMIO32(GFXMMU_BASE + 0x26a0)
/** GFXMMU_LUT724H Graphic MMU LUT entry 724 high **/
#define GFXMMU_LUT724H			MMIO32(GFXMMU_BASE + 0x26a4)
/** GFXMMU_LUT725L Graphic MMU LUT entry 725 low **/
#define GFXMMU_LUT725L			MMIO32(GFXMMU_BASE + 0x26a8)
/** GFXMMU_LUT725H Graphic MMU LUT entry 725 high **/
#define GFXMMU_LUT725H			MMIO32(GFXMMU_BASE + 0x26ac)
/** GFXMMU_LUT726L Graphic MMU LUT entry 726 low **/
#define GFXMMU_LUT726L			MMIO32(GFXMMU_BASE + 0x26b0)
/** GFXMMU_LUT726H Graphic MMU LUT entry 726 high **/
#define GFXMMU_LUT726H			MMIO32(GFXMMU_BASE + 0x26b4)
/** GFXMMU_LUT727L Graphic MMU LUT entry 727 low **/
#define GFXMMU_LUT727L			MMIO32(GFXMMU_BASE + 0x26b8)
/** GFXMMU_LUT727H Graphic MMU LUT entry 727 high **/
#define GFXMMU_LUT727H			MMIO32(GFXMMU_BASE + 0x26bc)
/** GFXMMU_LUT728L Graphic MMU LUT entry 728 low **/
#define GFXMMU_LUT728L			MMIO32(GFXMMU_BASE + 0x26c0)
/** GFXMMU_LUT728H Graphic MMU LUT entry 728 high **/
#define GFXMMU_LUT728H			MMIO32(GFXMMU_BASE + 0x26c4)
/** GFXMMU_LUT729L Graphic MMU LUT entry 729 low **/
#define GFXMMU_LUT729L			MMIO32(GFXMMU_BASE + 0x26c8)
/** GFXMMU_LUT729H Graphic MMU LUT entry 729 high **/
#define GFXMMU_LUT729H			MMIO32(GFXMMU_BASE + 0x26cc)
/** GFXMMU_LUT730L Graphic MMU LUT entry 730 low **/
#define GFXMMU_LUT730L			MMIO32(GFXMMU_BASE + 0x26d0)
/** GFXMMU_LUT730H Graphic MMU LUT entry 730 high **/
#define GFXMMU_LUT730H			MMIO32(GFXMMU_BASE + 0x26d4)
/** GFXMMU_LUT731L Graphic MMU LUT entry 731 low **/
#define GFXMMU_LUT731L			MMIO32(GFXMMU_BASE + 0x26d8)
/** GFXMMU_LUT731H Graphic MMU LUT entry 731 high **/
#define GFXMMU_LUT731H			MMIO32(GFXMMU_BASE + 0x26dc)
/** GFXMMU_LUT732L Graphic MMU LUT entry 732 low **/
#define GFXMMU_LUT732L			MMIO32(GFXMMU_BASE + 0x26e0)
/** GFXMMU_LUT732H Graphic MMU LUT entry 732 high **/
#define GFXMMU_LUT732H			MMIO32(GFXMMU_BASE + 0x26e4)
/** GFXMMU_LUT733L Graphic MMU LUT entry 733 low **/
#define GFXMMU_LUT733L			MMIO32(GFXMMU_BASE + 0x26e8)
/** GFXMMU_LUT733H Graphic MMU LUT entry 733 high **/
#define GFXMMU_LUT733H			MMIO32(GFXMMU_BASE + 0x26ec)
/** GFXMMU_LUT734L Graphic MMU LUT entry 734 low **/
#define GFXMMU_LUT734L			MMIO32(GFXMMU_BASE + 0x26f0)
/** GFXMMU_LUT734H Graphic MMU LUT entry 734 high **/
#define GFXMMU_LUT734H			MMIO32(GFXMMU_BASE + 0x26f4)
/** GFXMMU_LUT735L Graphic MMU LUT entry 735 low **/
#define GFXMMU_LUT735L			MMIO32(GFXMMU_BASE + 0x26f8)
/** GFXMMU_LUT735H Graphic MMU LUT entry 735 high **/
#define GFXMMU_LUT735H			MMIO32(GFXMMU_BASE + 0x26fc)
/** GFXMMU_LUT736L Graphic MMU LUT entry 736 low **/
#define GFXMMU_LUT736L			MMIO32(GFXMMU_BASE + 0x2700)
/** GFXMMU_LUT736H Graphic MMU LUT entry 736 high **/
#define GFXMMU_LUT736H			MMIO32(GFXMMU_BASE + 0x2704)
/** GFXMMU_LUT737L Graphic MMU LUT entry 737 low **/
#define GFXMMU_LUT737L			MMIO32(GFXMMU_BASE + 0x2708)
/** GFXMMU_LUT737H Graphic MMU LUT entry 737 high **/
#define GFXMMU_LUT737H			MMIO32(GFXMMU_BASE + 0x270c)
/** GFXMMU_LUT738L Graphic MMU LUT entry 738 low **/
#define GFXMMU_LUT738L			MMIO32(GFXMMU_BASE + 0x2710)
/** GFXMMU_LUT738H Graphic MMU LUT entry 738 high **/
#define GFXMMU_LUT738H			MMIO32(GFXMMU_BASE + 0x2714)
/** GFXMMU_LUT739L Graphic MMU LUT entry 739 low **/
#define GFXMMU_LUT739L			MMIO32(GFXMMU_BASE + 0x2718)
/** GFXMMU_LUT739H Graphic MMU LUT entry 739 high **/
#define GFXMMU_LUT739H			MMIO32(GFXMMU_BASE + 0x271c)
/** GFXMMU_LUT740L Graphic MMU LUT entry 740 low **/
#define GFXMMU_LUT740L			MMIO32(GFXMMU_BASE + 0x2720)
/** GFXMMU_LUT740H Graphic MMU LUT entry 740 high **/
#define GFXMMU_LUT740H			MMIO32(GFXMMU_BASE + 0x2724)
/** GFXMMU_LUT741L Graphic MMU LUT entry 741 low **/
#define GFXMMU_LUT741L			MMIO32(GFXMMU_BASE + 0x2728)
/** GFXMMU_LUT741H Graphic MMU LUT entry 741 high **/
#define GFXMMU_LUT741H			MMIO32(GFXMMU_BASE + 0x272c)
/** GFXMMU_LUT742L Graphic MMU LUT entry 742 low **/
#define GFXMMU_LUT742L			MMIO32(GFXMMU_BASE + 0x2730)
/** GFXMMU_LUT742H Graphic MMU LUT entry 742 high **/
#define GFXMMU_LUT742H			MMIO32(GFXMMU_BASE + 0x2734)
/** GFXMMU_LUT743L Graphic MMU LUT entry 743 low **/
#define GFXMMU_LUT743L			MMIO32(GFXMMU_BASE + 0x2738)
/** GFXMMU_LUT743H Graphic MMU LUT entry 743 high **/
#define GFXMMU_LUT743H			MMIO32(GFXMMU_BASE + 0x273c)
/** GFXMMU_LUT744L Graphic MMU LUT entry 744 low **/
#define GFXMMU_LUT744L			MMIO32(GFXMMU_BASE + 0x2740)
/** GFXMMU_LUT744H Graphic MMU LUT entry 744 high **/
#define GFXMMU_LUT744H			MMIO32(GFXMMU_BASE + 0x2744)
/** GFXMMU_LUT745L Graphic MMU LUT entry 745 low **/
#define GFXMMU_LUT745L			MMIO32(GFXMMU_BASE + 0x2748)
/** GFXMMU_LUT745H Graphic MMU LUT entry 745 high **/
#define GFXMMU_LUT745H			MMIO32(GFXMMU_BASE + 0x274c)
/** GFXMMU_LUT746L Graphic MMU LUT entry 746 low **/
#define GFXMMU_LUT746L			MMIO32(GFXMMU_BASE + 0x2750)
/** GFXMMU_LUT746H Graphic MMU LUT entry 746 high **/
#define GFXMMU_LUT746H			MMIO32(GFXMMU_BASE + 0x2754)
/** GFXMMU_LUT747L Graphic MMU LUT entry 747 low **/
#define GFXMMU_LUT747L			MMIO32(GFXMMU_BASE + 0x2758)
/** GFXMMU_LUT747H Graphic MMU LUT entry 747 high **/
#define GFXMMU_LUT747H			MMIO32(GFXMMU_BASE + 0x275c)
/** GFXMMU_LUT748L Graphic MMU LUT entry 748 low **/
#define GFXMMU_LUT748L			MMIO32(GFXMMU_BASE + 0x2760)
/** GFXMMU_LUT748H Graphic MMU LUT entry 748 high **/
#define GFXMMU_LUT748H			MMIO32(GFXMMU_BASE + 0x2764)
/** GFXMMU_LUT749L Graphic MMU LUT entry 749 low **/
#define GFXMMU_LUT749L			MMIO32(GFXMMU_BASE + 0x2768)
/** GFXMMU_LUT749H Graphic MMU LUT entry 749 high **/
#define GFXMMU_LUT749H			MMIO32(GFXMMU_BASE + 0x276c)
/** GFXMMU_LUT750L Graphic MMU LUT entry 750 low **/
#define GFXMMU_LUT750L			MMIO32(GFXMMU_BASE + 0x2770)
/** GFXMMU_LUT750H Graphic MMU LUT entry 750 high **/
#define GFXMMU_LUT750H			MMIO32(GFXMMU_BASE + 0x2774)
/** GFXMMU_LUT751L Graphic MMU LUT entry 751 low **/
#define GFXMMU_LUT751L			MMIO32(GFXMMU_BASE + 0x2778)
/** GFXMMU_LUT751H Graphic MMU LUT entry 751 high **/
#define GFXMMU_LUT751H			MMIO32(GFXMMU_BASE + 0x277c)
/** GFXMMU_LUT752L Graphic MMU LUT entry 752 low **/
#define GFXMMU_LUT752L			MMIO32(GFXMMU_BASE + 0x2780)
/** GFXMMU_LUT752H Graphic MMU LUT entry 752 high **/
#define GFXMMU_LUT752H			MMIO32(GFXMMU_BASE + 0x2784)
/** GFXMMU_LUT753L Graphic MMU LUT entry 753 low **/
#define GFXMMU_LUT753L			MMIO32(GFXMMU_BASE + 0x2788)
/** GFXMMU_LUT753H Graphic MMU LUT entry 753 high **/
#define GFXMMU_LUT753H			MMIO32(GFXMMU_BASE + 0x278c)
/** GFXMMU_LUT754L Graphic MMU LUT entry 754 low **/
#define GFXMMU_LUT754L			MMIO32(GFXMMU_BASE + 0x2790)
/** GFXMMU_LUT754H Graphic MMU LUT entry 754 high **/
#define GFXMMU_LUT754H			MMIO32(GFXMMU_BASE + 0x2794)
/** GFXMMU_LUT755L Graphic MMU LUT entry 755 low **/
#define GFXMMU_LUT755L			MMIO32(GFXMMU_BASE + 0x2798)
/** GFXMMU_LUT755H Graphic MMU LUT entry 755 high **/
#define GFXMMU_LUT755H			MMIO32(GFXMMU_BASE + 0x279c)
/** GFXMMU_LUT756L Graphic MMU LUT entry 756 low **/
#define GFXMMU_LUT756L			MMIO32(GFXMMU_BASE + 0x27a0)
/** GFXMMU_LUT756H Graphic MMU LUT entry 756 high **/
#define GFXMMU_LUT756H			MMIO32(GFXMMU_BASE + 0x27a4)
/** GFXMMU_LUT757L Graphic MMU LUT entry 757 low **/
#define GFXMMU_LUT757L			MMIO32(GFXMMU_BASE + 0x27a8)
/** GFXMMU_LUT757H Graphic MMU LUT entry 757 high **/
#define GFXMMU_LUT757H			MMIO32(GFXMMU_BASE + 0x27ac)
/** GFXMMU_LUT758L Graphic MMU LUT entry 758 low **/
#define GFXMMU_LUT758L			MMIO32(GFXMMU_BASE + 0x27b0)
/** GFXMMU_LUT758H Graphic MMU LUT entry 758 high **/
#define GFXMMU_LUT758H			MMIO32(GFXMMU_BASE + 0x27b4)
/** GFXMMU_LUT759L Graphic MMU LUT entry 759 low **/
#define GFXMMU_LUT759L			MMIO32(GFXMMU_BASE + 0x27b8)
/** GFXMMU_LUT759H Graphic MMU LUT entry 759 high **/
#define GFXMMU_LUT759H			MMIO32(GFXMMU_BASE + 0x27bc)
/** GFXMMU_LUT760L Graphic MMU LUT entry 760 low **/
#define GFXMMU_LUT760L			MMIO32(GFXMMU_BASE + 0x27c0)
/** GFXMMU_LUT760H Graphic MMU LUT entry 760 high **/
#define GFXMMU_LUT760H			MMIO32(GFXMMU_BASE + 0x27c4)
/** GFXMMU_LUT761L Graphic MMU LUT entry 761 low **/
#define GFXMMU_LUT761L			MMIO32(GFXMMU_BASE + 0x27c8)
/** GFXMMU_LUT761H Graphic MMU LUT entry 761 high **/
#define GFXMMU_LUT761H			MMIO32(GFXMMU_BASE + 0x27cc)
/** GFXMMU_LUT762L Graphic MMU LUT entry 762 low **/
#define GFXMMU_LUT762L			MMIO32(GFXMMU_BASE + 0x27d0)
/** GFXMMU_LUT762H Graphic MMU LUT entry 762 high **/
#define GFXMMU_LUT762H			MMIO32(GFXMMU_BASE + 0x27d4)
/** GFXMMU_LUT763L Graphic MMU LUT entry 763 low **/
#define GFXMMU_LUT763L			MMIO32(GFXMMU_BASE + 0x27d8)
/** GFXMMU_LUT763H Graphic MMU LUT entry 763 high **/
#define GFXMMU_LUT763H			MMIO32(GFXMMU_BASE + 0x27dc)
/** GFXMMU_LUT764L Graphic MMU LUT entry 764 low **/
#define GFXMMU_LUT764L			MMIO32(GFXMMU_BASE + 0x27e0)
/** GFXMMU_LUT764H Graphic MMU LUT entry 764 high **/
#define GFXMMU_LUT764H			MMIO32(GFXMMU_BASE + 0x27e4)
/** GFXMMU_LUT765L Graphic MMU LUT entry 765 low **/
#define GFXMMU_LUT765L			MMIO32(GFXMMU_BASE + 0x27e8)
/** GFXMMU_LUT765H Graphic MMU LUT entry 765 high **/
#define GFXMMU_LUT765H			MMIO32(GFXMMU_BASE + 0x27ec)
/** GFXMMU_LUT766L Graphic MMU LUT entry 766 low **/
#define GFXMMU_LUT766L			MMIO32(GFXMMU_BASE + 0x27f0)
/** GFXMMU_LUT766H Graphic MMU LUT entry 766 high **/
#define GFXMMU_LUT766H			MMIO32(GFXMMU_BASE + 0x27f4)
/** GFXMMU_LUT767L Graphic MMU LUT entry 767 low **/
#define GFXMMU_LUT767L			MMIO32(GFXMMU_BASE + 0x27f8)
/** GFXMMU_LUT767H Graphic MMU LUT entry 767 high **/
#define GFXMMU_LUT767H			MMIO32(GFXMMU_BASE + 0x27fc)
/** GFXMMU_LUT768L Graphic MMU LUT entry 768 low **/
#define GFXMMU_LUT768L			MMIO32(GFXMMU_BASE + 0x2800)
/** GFXMMU_LUT768H Graphic MMU LUT entry 768 high **/
#define GFXMMU_LUT768H			MMIO32(GFXMMU_BASE + 0x2804)
/** GFXMMU_LUT769L Graphic MMU LUT entry 769 low **/
#define GFXMMU_LUT769L			MMIO32(GFXMMU_BASE + 0x2808)
/** GFXMMU_LUT769H Graphic MMU LUT entry 769 high **/
#define GFXMMU_LUT769H			MMIO32(GFXMMU_BASE + 0x280c)
/** GFXMMU_LUT770L Graphic MMU LUT entry 770 low **/
#define GFXMMU_LUT770L			MMIO32(GFXMMU_BASE + 0x2810)
/** GFXMMU_LUT770H Graphic MMU LUT entry 770 high **/
#define GFXMMU_LUT770H			MMIO32(GFXMMU_BASE + 0x2814)
/** GFXMMU_LUT771L Graphic MMU LUT entry 771 low **/
#define GFXMMU_LUT771L			MMIO32(GFXMMU_BASE + 0x2818)
/** GFXMMU_LUT771H Graphic MMU LUT entry 771 high **/
#define GFXMMU_LUT771H			MMIO32(GFXMMU_BASE + 0x281c)
/** GFXMMU_LUT772L Graphic MMU LUT entry 772 low **/
#define GFXMMU_LUT772L			MMIO32(GFXMMU_BASE + 0x2820)
/** GFXMMU_LUT772H Graphic MMU LUT entry 772 high **/
#define GFXMMU_LUT772H			MMIO32(GFXMMU_BASE + 0x2824)
/** GFXMMU_LUT773L Graphic MMU LUT entry 773 low **/
#define GFXMMU_LUT773L			MMIO32(GFXMMU_BASE + 0x2828)
/** GFXMMU_LUT773H Graphic MMU LUT entry 773 high **/
#define GFXMMU_LUT773H			MMIO32(GFXMMU_BASE + 0x282c)
/** GFXMMU_LUT774L Graphic MMU LUT entry 774 low **/
#define GFXMMU_LUT774L			MMIO32(GFXMMU_BASE + 0x2830)
/** GFXMMU_LUT774H Graphic MMU LUT entry 774 high **/
#define GFXMMU_LUT774H			MMIO32(GFXMMU_BASE + 0x2834)
/** GFXMMU_LUT775L Graphic MMU LUT entry 775 low **/
#define GFXMMU_LUT775L			MMIO32(GFXMMU_BASE + 0x2838)
/** GFXMMU_LUT775H Graphic MMU LUT entry 775 high **/
#define GFXMMU_LUT775H			MMIO32(GFXMMU_BASE + 0x283c)
/** GFXMMU_LUT776L Graphic MMU LUT entry 776 low **/
#define GFXMMU_LUT776L			MMIO32(GFXMMU_BASE + 0x2840)
/** GFXMMU_LUT776H Graphic MMU LUT entry 776 high **/
#define GFXMMU_LUT776H			MMIO32(GFXMMU_BASE + 0x2844)
/** GFXMMU_LUT777L Graphic MMU LUT entry 777 low **/
#define GFXMMU_LUT777L			MMIO32(GFXMMU_BASE + 0x2848)
