grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT777H Graphic MMU LUT entry 777 high **/
#define GFXMMU_LUT777H			MMIO32(GFXMMU_BASE + 0x284c)
/** GFXMMU_LUT778L Graphic MMU LUT entry 778 low **/
#define GFXMMU_LUT778L			MMIO32(GFXMMU_BASE + 0x2850)
/** GFXMMU_LUT778H Graphic MMU LUT entry 778 high **/
#define GFXMMU_LUT778H			MMIO32(GFXMMU_BASE + 0x2854)
/** GFXMMU_LUT779L Graphic MMU LUT entry 779 low **/
#define GFXMMU_LUT779L			MMIO32(GFXMMU_BASE + 0x2858)
/** GFXMMU_LUT779H Graphic MMU LUT entry 779 high **/
#define GFXMMU_LUT779H			MMIO32(GFXMMU_BASE + 0x285c)
/** GFXMMU_LUT780L Graphic MMU LUT entry 780 low **/
#define GFXMMU_LUT780L			MMIO32(GFXMMU_BASE + 0x2860)
/** GFXMMU_LUT780H Graphic MMU LUT entry 780 high **/
#define GFXMMU_LUT780H			MMIO32(GFXMMU_BASE + 0x2864)
/** GFXMMU_LUT781L Graphic MMU LUT entry 781 low **/
#define GFXMMU_LUT781L			MMIO32(GFXMMU_BASE + 0x2868)
/** GFXMMU_LUT781H Graphic MMU LUT entry 781 high **/
#define GFXMMU_LUT781H			MMIO32(GFXMMU_BASE + 0x286c)
/** GFXMMU_LUT782L Graphic MMU LUT entry 782 low **/
#define GFXMMU_LUT782L			MMIO32(GFXMMU_BASE + 0x2870)
/** GFXMMU_LUT782H Graphic MMU LUT entry 782 high **/
#define GFXMMU_LUT782H			MMIO32(GFXMMU_BASE + 0x2874)
/** GFXMMU_LUT783L Graphic MMU LUT entry 783 low **/
#define GFXMMU_LUT783L			MMIO32(GFXMMU_BASE + 0x2878)
/** GFXMMU_LUT783H Graphic MMU LUT entry 783 high **/
#define GFXMMU_LUT783H			MMIO32(GFXMMU_BASE + 0x287c)
/** GFXMMU_LUT784L Graphic MMU LUT entry 784 low **/
#define GFXMMU_LUT784L			MMIO32(GFXMMU_BASE + 0x2880)
/** GFXMMU_LUT784H Graphic MMU LUT entry 784 high **/
#define GFXMMU_LUT784H			MMIO32(GFXMMU_BASE + 0x2884)
/** GFXMMU_LUT785L Graphic MMU LUT entry 785 low **/
#define GFXMMU_LUT785L			MMIO32(GFXMMU_BASE + 0x2888)
/** GFXMMU_LUT785H Graphic MMU LUT entry 785 high **/
#define GFXMMU_LUT785H			MMIO32(GFXMMU_BASE + 0x288c)
/** GFXMMU_LUT786L Graphic MMU LUT entry 786 low **/
#define GFXMMU_LUT786L			MMIO32(GFXMMU_BASE + 0x2890)
/** GFXMMU_LUT786H Graphic MMU LUT entry 786 high **/
#define GFXMMU_LUT786H			MMIO32(GFXMMU_BASE + 0x2894)
/** GFXMMU_LUT787L Graphic MMU LUT entry 787 low **/
#define GFXMMU_LUT787L			MMIO32(GFXMMU_BASE + 0x2898)
/** GFXMMU_LUT787H Graphic MMU LUT entry 787 high **/
#define GFXMMU_LUT787H			MMIO32(GFXMMU_BASE + 0x289c)
/** GFXMMU_LUT788L Graphic MMU LUT entry 788 low **/
#define GFXMMU_LUT788L			MMIO32(GFXMMU_BASE + 0x28a0)
/** GFXMMU_LUT788H Graphic MMU LUT entry 788 high **/
#define GFXMMU_LUT788H			MMIO32(GFXMMU_BASE + 0x28a4)
/** GFXMMU_LUT789L Graphic MMU LUT entry 789 low **/
#define GFXMMU_LUT789L			MMIO32(GFXMMU_BASE + 0x28a8)
/** GFXMMU_LUT789H Graphic MMU LUT entry 789 high **/
#define GFXMMU_LUT789H			MMIO32(GFXMMU_BASE + 0x28ac)
/** GFXMMU_LUT790L Graphic MMU LUT entry 790 low **/
#define GFXMMU_LUT790L			MMIO32(GFXMMU_BASE + 0x28b0)
/** GFXMMU_LUT790H Graphic MMU LUT entry 790 high **/
#define GFXMMU_LUT790H			MMIO32(GFXMMU_BASE + 0x28b4)
/** GFXMMU_LUT791L Graphic MMU LUT entry 791 low **/
#define GFXMMU_LUT791L			MMIO32(GFXMMU_BASE + 0x28b8)
/** GFXMMU_LUT791H Graphic MMU LUT entry 791 high **/
#define GFXMMU_LUT791H			MMIO32(GFXMMU_BASE + 0x28bc)
/** GFXMMU_LUT792L Graphic MMU LUT entry 792 low **/
#define GFXMMU_LUT792L			MMIO32(GFXMMU_BASE + 0x28c0)
/** GFXMMU_LUT792H Graphic MMU LUT entry 792 high **/
#define GFXMMU_LUT792H			MMIO32(GFXMMU_BASE + 0x28c4)
/** GFXMMU_LUT793L Graphic MMU LUT entry 793 low **/
#define GFXMMU_LUT793L			MMIO32(GFXMMU_BASE + 0x28c8)
/** GFXMMU_LUT793H Graphic MMU LUT entry 793 high **/
#define GFXMMU_LUT793H			MMIO32(GFXMMU_BASE + 0x28cc)
/** GFXMMU_LUT794L Graphic MMU LUT entry 794 low **/
#define GFXMMU_LUT794L			MMIO32(GFXMMU_BASE + 0x28d0)
/** GFXMMU_LUT794H Graphic MMU LUT entry 794 high **/
#define GFXMMU_LUT794H			MMIO32(GFXMMU_BASE + 0x28d4)
/** GFXMMU_LUT795L Graphic MMU LUT entry 795 low **/
#define GFXMMU_LUT795L			MMIO32(GFXMMU_BASE + 0x28d8)
/** GFXMMU_LUT795H Graphic MMU LUT entry 795 high **/
#define GFXMMU_LUT795H			MMIO32(GFXMMU_BASE + 0x28dc)
/** GFXMMU_LUT796L Graphic MMU LUT entry 796 low **/
#define GFXMMU_LUT796L			MMIO32(GFXMMU_BASE + 0x28e0)
/** GFXMMU_LUT796H Graphic MMU LUT entry 796 high **/
#define GFXMMU_LUT796H			MMIO32(GFXMMU_BASE + 0x28e4)
/** GFXMMU_LUT797L Graphic MMU LUT entry 797 low **/
#define GFXMMU_LUT797L			MMIO32(GFXMMU_BASE + 0x28e8)
/** GFXMMU_LUT797H Graphic MMU LUT entry 797 high **/
#define GFXMMU_LUT797H			MMIO32(GFXMMU_BASE + 0x28ec)
/** GFXMMU_LUT798L Graphic MMU LUT entry 798 low **/
#define GFXMMU_LUT798L			MMIO32(GFXMMU_BASE + 0x28f0)
/** GFXMMU_LUT798H Graphic MMU LUT entry 798 high **/
#define GFXMMU_LUT798H			MMIO32(GFXMMU_BASE + 0x28f4)
/** GFXMMU_LUT799L Graphic MMU LUT entry 799 low **/
#define GFXMMU_LUT799L			MMIO32(GFXMMU_BASE + 0x28f8)
/** GFXMMU_LUT799H Graphic MMU LUT entry 799 high **/
#define GFXMMU_LUT799H			MMIO32(GFXMMU_BASE + 0x28fc)
/** GFXMMU_LUT800L Graphic MMU LUT entry 800 low **/
#define GFXMMU_LUT800L			MMIO32(GFXMMU_BASE + 0x2900)
/** GFXMMU_LUT800H Graphic MMU LUT entry 800 high **/
#define GFXMMU_LUT800H			MMIO32(GFXMMU_BASE + 0x2904)
/** GFXMMU_LUT801L Graphic MMU LUT entry 801 low **/
#define GFXMMU_LUT801L			MMIO32(GFXMMU_BASE + 0x2908)
/** GFXMMU_LUT801H Graphic MMU LUT entry 801 high **/
#define GFXMMU_LUT801H			MMIO32(GFXMMU_BASE + 0x290c)
/** GFXMMU_LUT802L Graphic MMU LUT entry 802 low **/
#define GFXMMU_LUT802L			MMIO32(GFXMMU_BASE + 0x2910)
/** GFXMMU_LUT802H Graphic MMU LUT entry 802 high **/
#define GFXMMU_LUT802H			MMIO32(GFXMMU_BASE + 0x2914)
/** GFXMMU_LUT803L Graphic MMU LUT entry 803 low **/
#define GFXMMU_LUT803L			MMIO32(GFXMMU_BASE + 0x2918)
/** GFXMMU_LUT803H Graphic MMU LUT entry 803 high **/
#define GFXMMU_LUT803H			MMIO32(GFXMMU_BASE + 0x291c)
/** GFXMMU_LUT804L Graphic MMU LUT entry 804 low **/
#define GFXMMU_LUT804L			MMIO32(GFXMMU_BASE + 0x2920)
/** GFXMMU_LUT804H Graphic MMU LUT entry 804 high **/
#define GFXMMU_LUT804H			MMIO32(GFXMMU_BASE + 0x2924)
/** GFXMMU_LUT805L Graphic MMU LUT entry 805 low **/
#define GFXMMU_LUT805L			MMIO32(GFXMMU_BASE + 0x2928)
/** GFXMMU_LUT805H Graphic MMU LUT entry 805 high **/
#define GFXMMU_LUT805H			MMIO32(GFXMMU_BASE + 0x292c)
/** GFXMMU_LUT806L Graphic MMU LUT entry 806 low **/
#define GFXMMU_LUT806L			MMIO32(GFXMMU_BASE + 0x2930)
/** GFXMMU_LUT806H Graphic MMU LUT entry 806 high **/
#define GFXMMU_LUT806H			MMIO32(GFXMMU_BASE + 0x2934)
/** GFXMMU_LUT807L Graphic MMU LUT entry 807 low **/
#define GFXMMU_LUT807L			MMIO32(GFXMMU_BASE + 0x2938)
/** GFXMMU_LUT807H Graphic MMU LUT entry 807 high **/
#define GFXMMU_LUT807H			MMIO32(GFXMMU_BASE + 0x293c)
/** GFXMMU_LUT808L Graphic MMU LUT entry 808 low **/
#define GFXMMU_LUT808L			MMIO32(GFXMMU_BASE + 0x2940)
/** GFXMMU_LUT808H Graphic MMU LUT entry 808 high **/
#define GFXMMU_LUT808H			MMIO32(GFXMMU_BASE + 0x2944)
/** GFXMMU_LUT809L Graphic MMU LUT entry 809 low **/
#define GFXMMU_LUT809L			MMIO32(GFXMMU_BASE + 0x2948)
/** GFXMMU_LUT809H Graphic MMU LUT entry 809 high **/
#define GFXMMU_LUT809H			MMIO32(GFXMMU_BASE + 0x294c)
/** GFXMMU_LUT810L Graphic MMU LUT entry 810 low **/
#define GFXMMU_LUT810L			MMIO32(GFXMMU_BASE + 0x2950)
/** GFXMMU_LUT810H Graphic MMU LUT entry 810 high **/
#define GFXMMU_LUT810H			MMIO32(GFXMMU_BASE + 0x2954)
/** GFXMMU_LUT811L Graphic MMU LUT entry 811 low **/
#define GFXMMU_LUT811L			MMIO32(GFXMMU_BASE + 0x2958)
/** GFXMMU_LUT811H Graphic MMU LUT entry 811 high **/
#define GFXMMU_LUT811H			MMIO32(GFXMMU_BASE + 0x295c)
/** GFXMMU_LUT812L Graphic MMU LUT entry 812 low **/
#define GFXMMU_LUT812L			MMIO32(GFXMMU_BASE + 0x2960)
/** GFXMMU_LUT812H Graphic MMU LUT entry 812 high **/
#define GFXMMU_LUT812H			MMIO32(GFXMMU_BASE + 0x2964)
/** GFXMMU_LUT813L Graphic MMU LUT entry 813 low **/
#define GFXMMU_LUT813L			MMIO32(GFXMMU_BASE + 0x2968)
/** GFXMMU_LUT813H Graphic MMU LUT entry 813 high **/
#define GFXMMU_LUT813H			MMIO32(GFXMMU_BASE + 0x296c)
/** GFXMMU_LUT814L Graphic MMU LUT entry 814 low **/
#define GFXMMU_LUT814L			MMIO32(GFXMMU_BASE + 0x2970)
/** GFXMMU_LUT814H Graphic MMU LUT entry 814 high **/
#define GFXMMU_LUT814H			MMIO32(GFXMMU_BASE + 0x2974)
/** GFXMMU_LUT815L Graphic MMU LUT entry 815 low **/
#define GFXMMU_LUT815L			MMIO32(GFXMMU_BASE + 0x2978)
/** GFXMMU_LUT815H Graphic MMU LUT entry 815 high **/
#define GFXMMU_LUT815H			MMIO32(GFXMMU_BASE + 0x297c)
/** GFXMMU_LUT816L Graphic MMU LUT entry 816 low **/
#define GFXMMU_LUT816L			MMIO32(GFXMMU_BASE + 0x2980)
/** GFXMMU_LUT816H Graphic MMU LUT entry 816 high **/
#define GFXMMU_LUT816H			MMIO32(GFXMMU_BASE + 0x2984)
/** GFXMMU_LUT817L Graphic MMU LUT entry 817 low **/
#define GFXMMU_LUT817L			MMIO32(GFXMMU_BASE + 0x2988)
/** GFXMMU_LUT817H Graphic MMU LUT entry 817 high **/
#define GFXMMU_LUT817H			MMIO32(GFXMMU_BASE + 0x298c)
/** GFXMMU_LUT818L Graphic MMU LUT entry 818 low **/
#define GFXMMU_LUT818L			MMIO32(GFXMMU_BASE + 0x2990)
/** GFXMMU_LUT818H Graphic MMU LUT entry 818 high **/
#define GFXMMU_LUT818H			MMIO32(GFXMMU_BASE + 0x2994)
/** GFXMMU_LUT819L Graphic MMU LUT entry 819 low **/
#define GFXMMU_LUT819L			MMIO32(GFXMMU_BASE + 0x2998)
/** GFXMMU_LUT819H Graphic MMU LUT entry 819 high **/
#define GFXMMU_LUT819H			MMIO32(GFXMMU_BASE + 0x299c)
/** GFXMMU_LUT820L Graphic MMU LUT entry 820 low **/
#define GFXMMU_LUT820L			MMIO32(GFXMMU_BASE + 0x29a0)
/** GFXMMU_LUT820H Graphic MMU LUT entry 820 high **/
#define GFXMMU_LUT820H			MMIO32(GFXMMU_BASE + 0x29a4)
/** GFXMMU_LUT821L Graphic MMU LUT entry 821 low **/
#define GFXMMU_LUT821L			MMIO32(GFXMMU_BASE + 0x29a8)
/** GFXMMU_LUT821H Graphic MMU LUT entry 821 high **/
#define GFXMMU_LUT821H			MMIO32(GFXMMU_BASE + 0x29ac)
/** GFXMMU_LUT822L Graphic MMU LUT entry 822 low **/
#define GFXMMU_LUT822L			MMIO32(GFXMMU_BASE + 0x29b0)
/** GFXMMU_LUT822H Graphic MMU LUT entry 822 high **/
#define GFXMMU_LUT822H			MMIO32(GFXMMU_BASE + 0x29b4)
/** GFXMMU_LUT823L Graphic MMU LUT entry 823 low **/
#define GFXMMU_LUT823L			MMIO32(GFXMMU_BASE + 0x29b8)
/** GFXMMU_LUT823H Graphic MMU LUT entry 823 high **/
#define GFXMMU_LUT823H			MMIO32(GFXMMU_BASE + 0x29bc)
/** GFXMMU_LUT824L Graphic MMU LUT entry 824 low **/
#define GFXMMU_LUT824L			MMIO32(GFXMMU_BASE + 0x29c0)
/** GFXMMU_LUT824H Graphic MMU LUT entry 824 high **/
#define GFXMMU_LUT824H			MMIO32(GFXMMU_BASE + 0x29c4)
/** GFXMMU_LUT825L Graphic MMU LUT entry 825 low **/
#define GFXMMU_LUT825L			MMIO32(GFXMMU_BASE + 0x29c8)
/** GFXMMU_LUT825H Graphic MMU LUT entry 825 high **/
#define GFXMMU_LUT825H			MMIO32(GFXMMU_BASE + 0x29cc)
/** GFXMMU_LUT826L Graphic MMU LUT entry 826 low **/
#define GFXMMU_LUT826L			MMIO32(GFXMMU_BASE + 0x29d0)
/** GFXMMU_LUT826H Graphic MMU LUT entry 826 high **/
#define GFXMMU_LUT826H			MMIO32(GFXMMU_BASE + 0x29d4)
/** GFXMMU_LUT827L Graphic MMU LUT entry 827 low **/
#define GFXMMU_LUT827L			MMIO32(GFXMMU_BASE + 0x29d8)
/** GFXMMU_LUT827H Graphic MMU LUT entry 827 high **/
#define GFXMMU_LUT827H			MMIO32(GFXMMU_BASE + 0x29dc)
/** GFXMMU_LUT828L Graphic MMU LUT entry 828 low **/
#define GFXMMU_LUT828L			MMIO32(GFXMMU_BASE + 0x29e0)
/** GFXMMU_LUT828H Graphic MMU LUT entry 828 high **/
#define GFXMMU_LUT828H			MMIO32(GFXMMU_BASE + 0x29e4)
/** GFXMMU_LUT829L Graphic MMU LUT entry 829 low **/
#define GFXMMU_LUT829L			MMIO32(GFXMMU_BASE + 0x29e8)
/** GFXMMU_LUT829H Graphic MMU LUT entry 829 high **/
#define GFXMMU_LUT829H			MMIO32(GFXMMU_BASE + 0x29ec)
/** GFXMMU_LUT830L Graphic MMU LUT entry 830 low **/
#define GFXMMU_LUT830L			MMIO32(GFXMMU_BASE + 0x29f0)
/** GFXMMU_LUT830H Graphic MMU LUT entry 830 high **/
#define GFXMMU_LUT830H			MMIO32(GFXMMU_BASE + 0x29f4)
/** GFXMMU_LUT831L Graphic MMU LUT entry 831 low **/
#define GFXMMU_LUT831L			MMIO32(GFXMMU_BASE + 0x29f8)
/** GFXMMU_LUT831H Graphic MMU LUT entry 831 high **/
#define GFXMMU_LUT831H			MMIO32(GFXMMU_BASE + 0x29fc)
/** GFXMMU_LUT832L Graphic MMU LUT entry 832 low **/
#define GFXMMU_LUT832L			MMIO32(GFXMMU_BASE + 0x2a00)
/** GFXMMU_LUT832H Graphic MMU LUT entry 832 high **/
#define GFXMMU_LUT832H			MMIO32(GFXMMU_BASE + 0x2a04)
/** GFXMMU_LUT833L Graphic MMU LUT entry 833 low **/
#define GFXMMU_LUT833L			MMIO32(GFXMMU_BASE + 0x2a08)
/** GFXMMU_LUT833H Graphic MMU LUT entry 833 high **/
#define GFXMMU_LUT833H			MMIO32(GFXMMU_BASE + 0x2a0c)
/** GFXMMU_LUT834L Graphic MMU LUT entry 834 low **/
#define GFXMMU_LUT834L			MMIO32(GFXMMU_BASE + 0x2a10)
/** GFXMMU_LUT834H Graphic MMU LUT entry 834 high **/
#define GFXMMU_LUT834H			MMIO32(GFXMMU_BASE + 0x2a14)
/** GFXMMU_LUT835L Graphic MMU LUT entry 835 low **/
#define GFXMMU_LUT835L			MMIO32(GFXMMU_BASE + 0x2a18)
/** GFXMMU_LUT835H Graphic MMU LUT entry 835 high **/
#define GFXMMU_LUT835H			MMIO32(GFXMMU_BASE + 0x2a1c)
/** GFXMMU_LUT836L Graphic MMU LUT entry 836 low **/
#define GFXMMU_LUT836L			MMIO32(GFXMMU_BASE + 0x2a20)
/** GFXMMU_LUT836H Graphic MMU LUT entry 836 high **/
#define GFXMMU_LUT836H			MMIO32(GFXMMU_BASE + 0x2a24)
/** GFXMMU_LUT837L Graphic MMU LUT entry 837 low **/
#define GFXMMU_LUT837L			MMIO32(GFXMMU_BASE + 0x2a28)
/** GFXMMU_LUT837H Graphic MMU LUT entry 837 high **/
#define GFXMMU_LUT837H			MMIO32(GFXMMU_BASE + 0x2a2c)
/** GFXMMU_LUT838L Graphic MMU LUT entry 838 low **/
#define GFXMMU_LUT838L			MMIO32(GFXMMU_BASE + 0x2a30)
/** GFXMMU_LUT838H Graphic MMU LUT entry 838 high **/
#define GFXMMU_LUT838H			MMIO32(GFXMMU_BASE + 0x2a34)
/** GFXMMU_LUT839L Graphic MMU LUT entry 839 low **/
#define GFXMMU_LUT839L			MMIO32(GFXMMU_BASE + 0x2a38)
/** GFXMMU_LUT839H Graphic MMU LUT entry 839 high **/
#define GFXMMU_LUT839H			MMIO32(GFXMMU_BASE + 0x2a3c)
/** GFXMMU_LUT840L Graphic MMU LUT entry 840 low **/
#define GFXMMU_LUT840L			MMIO32(GFXMMU_BASE + 0x2a40)
/** GFXMMU_LUT840H Graphic MMU LUT entry 840 high **/
#define GFXMMU_LUT840H			MMIO32(GFXMMU_BASE + 0x2a44)
/** GFXMMU_LUT841L Graphic MMU LUT entry 841 low **/
#define GFXMMU_LUT841L			MMIO32(GFXMMU_BASE + 0x2a48)
/** GFXMMU_LUT841H Graphic MMU LUT entry 841 high **/
#define GFXMMU_LUT841H			MMIO32(GFXMMU_BASE + 0x2a4c)
/** GFXMMU_LUT842L Graphic MMU LUT entry 842 low **/
#define GFXMMU_LUT842L			MMIO32(GFXMMU_BASE + 0x2a50)
/** GFXMMU_LUT842H Graphic MMU LUT entry 842 high **/
#define GFXMMU_LUT842H			MMIO32(GFXMMU_BASE + 0x2a54)
/** GFXMMU_LUT843L Graphic MMU LUT entry 843 low **/
#define GFXMMU_LUT843L			MMIO32(GFXMMU_BASE + 0x2a58)
/** GFXMMU_LUT843H Graphic MMU LUT entry 843 high **/
#define GFXMMU_LUT843H			MMIO32(GFXMMU_BASE + 0x2a5c)
/** GFXMMU_LUT844L Graphic MMU LUT entry 844 low **/
#define GFXMMU_LUT844L			MMIO32(GFXMMU_BASE + 0x2a60)
/** GFXMMU_LUT844H Graphic MMU LUT entry 844 high **/
#define GFXMMU_LUT844H			MMIO32(GFXMMU_BASE + 0x2a64)
/** GFXMMU_LUT845L Graphic MMU LUT entry 845 low **/
#define GFXMMU_LUT845L			MMIO32(GFXMMU_BASE + 0x2a68)
/** GFXMMU_LUT845H Graphic MMU LUT entry 845 high **/
#define GFXMMU_LUT845H			MMIO32(GFXMMU_BASE + 0x2a6c)
/** GFXMMU_LUT846L Graphic MMU LUT entry 846 low **/
#define GFXMMU_LUT846L			MMIO32(GFXMMU_BASE + 0x2a70)
/** GFXMMU_LUT846H Graphic MMU LUT entry 846 high **/
#define GFXMMU_LUT846H			MMIO32(GFXMMU_BASE + 0x2a74)
/** GFXMMU_LUT847L Graphic MMU LUT entry 847 low **/
#define GFXMMU_LUT847L			MMIO32(GFXMMU_BASE + 0x2a78)
/** GFXMMU_LUT847H Graphic MMU LUT entry 847 high **/
#define GFXMMU_LUT847H			MMIO32(GFXMMU_BASE + 0x2a7c)
/** GFXMMU_LUT848L Graphic MMU LUT entry 848 low **/
#define GFXMMU_LUT848L			MMIO32(GFXMMU_BASE + 0x2a80)
/** GFXMMU_LUT848H Graphic MMU LUT entry 848 high **/
#define GFXMMU_LUT848H			MMIO32(GFXMMU_BASE + 0x2a84)
/** GFXMMU_LUT849L Graphic MMU LUT entry 849 low **/
#define GFXMMU_LUT849L			MMIO32(GFXMMU_BASE + 0x2a88)
/** GFXMMU_LUT849H Graphic MMU LUT entry 849 high **/
#define GFXMMU_LUT849H			MMIO32(GFXMMU_BASE + 0x2a8c)
/** GFXMMU_LUT850L Graphic MMU LUT entry 850 low **/
#define GFXMMU_LUT850L			MMIO32(GFXMMU_BASE + 0x2a90)
/** GFXMMU_LUT850H Graphic MMU LUT entry 850 high **/
#define GFXMMU_LUT850H			MMIO32(GFXMMU_BASE + 0x2a94)
/** GFXMMU_LUT851L Graphic MMU LUT entry 851 low **/
#define GFXMMU_LUT851L			MMIO32(GFXMMU_BASE + 0x2a98)
/** GFXMMU_LUT851H Graphic MMU LUT entry 851 high **/
#define GFXMMU_LUT851H			MMIO32(GFXMMU_BASE + 0x2a9c)
/** GFXMMU_LUT852L Graphic MMU LUT entry 852 low **/
#define GFXMMU_LUT852L			MMIO32(GFXMMU_BASE + 0x2aa0)
/** GFXMMU_LUT852H Graphic MMU LUT entry 852 high **/
#define GFXMMU_LUT852H			MMIO32(GFXMMU_BASE + 0x2aa4)
/** GFXMMU_LUT853L Graphic MMU LUT entry 853 low **/
#define GFXMMU_LUT853L			MMIO32(GFXMMU_BASE + 0x2aa8)
/** GFXMMU_LUT853H Graphic MMU LUT entry 853 high **/
#define GFXMMU_LUT853H			MMIO32(GFXMMU_BASE + 0x2aac)
/** GFXMMU_LUT854L Graphic MMU LUT entry 854 low **/
#define GFXMMU_LUT854L			MMIO32(GFXMMU_BASE + 0x2ab0)
/** GFXMMU_LUT854H Graphic MMU LUT entry 854 high **/
#define GFXMMU_LUT854H			MMIO32(GFXMMU_BASE + 0x2ab4)
/** GFXMMU_LUT855L Graphic MMU LUT entry 855 low **/
#define GFXMMU_LUT855L			MMIO32(GFXMMU_BASE + 0x2ab8)
/** GFXMMU_LUT855H Graphic MMU LUT entry 855 high **/
#define GFXMMU_LUT855H			MMIO32(GFXMMU_BASE + 0x2abc)
/** GFXMMU_LUT856L Graphic MMU LUT entry 856 low **/
#define GFXMMU_LUT856L			MMIO32(GFXMMU_BASE + 0x2ac0)
/** GFXMMU_LUT856H Graphic MMU LUT entry 856 high **/
#define GFXMMU_LUT856H			MMIO32(GFXMMU_BASE + 0x2ac4)
/** GFXMMU_LUT857L Graphic MMU LUT entry 857 low **/
#define GFXMMU_LUT857L			MMIO32(GFXMMU_BASE + 0x2ac8)
/** GFXMMU_LUT857H Graphic MMU LUT entry 857 high **/
#define GFXMMU_LUT857H			MMIO32(GFXMMU_BASE + 0x2acc)
/** GFXMMU_LUT858L Graphic MMU LUT entry 858 low **/
#define GFXMMU_LUT858L			MMIO32(GFXMMU_BASE + 0x2ad0)
/** GFXMMU_LUT858H Graphic MMU LUT entry 858 high **/
#define GFXMMU_LUT858H			MMIO32(GFXMMU_BASE + 0x2ad4)
/** GFXMMU_LUT859L Graphic MMU LUT entry 859 low **/
#define GFXMMU_LUT859L			MMIO32(GFXMMU_BASE + 0x2ad8)
/** GFXMMU_LUT859H Graphic MMU LUT entry 859 high **/
#define GFXMMU_LUT859H			MMIO32(GFXMMU_BASE + 0x2adc)
/** GFXMMU_LUT860L Graphic MMU LUT entry 860 low **/
#define GFXMMU_LUT860L			MMIO32(GFXMMU_BASE + 0x2ae0)
/** GFXMMU_LUT860H Graphic MMU LUT entry 860 high **/
#define GFXMMU_LUT860H			MMIO32(GFXMMU_BASE + 0x2ae4)
/** GFXMMU_LUT861L Graphic MMU LUT entry 861 low **/
#define GFXMMU_LUT861L			MMIO32(GFXMMU_BASE + 0x2ae8)
/** GFXMMU_LUT861H Graphic MMU LUT entry 861 high **/
#define GFXMMU_LUT861H			MMIO32(GFXMMU_BASE + 0x2aec)
/** GFXMMU_LUT862L Graphic MMU LUT entry 862 low **/
#define GFXMMU_LUT862L			MMIO32(GFXMMU_BASE + 0x2af0)
/** GFXMMU_LUT862H Graphic MMU LUT entry 862 high **/
#define GFXMMU_LUT862H			MMIO32(GFXMMU_BASE + 0x2af4)
/** GFXMMU_LUT863L Graphic MMU LUT entry 863 low **/
#define GFXMMU_LUT863L			MMIO32(GFXMMU_BASE + 0x2af8)
/** GFXMMU_LUT863H Graphic MMU LUT entry 863 high **/
#define GFXMMU_LUT863H			MMIO32(GFXMMU_BASE + 0x2afc)
/** GFXMMU_LUT864L Graphic MMU LUT entry 864 low **/
#define GFXMMU_LUT864L			MMIO32(GFXMMU_BASE + 0x2b00)
/** GFXMMU_LUT864H Graphic MMU LUT entry 864 high **/
#define GFXMMU_LUT864H			MMIO32(GFXMMU_BASE + 0x2b04)
/** GFXMMU_LUT865L Graphic MMU LUT entry 865 low **/
#define GFXMMU_LUT865L			MMIO32(GFXMMU_BASE + 0x2b08)
/** GFXMMU_LUT865H Graphic MMU LUT entry 865 high **/
#define GFXMMU_LUT865H			MMIO32(GFXMMU_BASE + 0x2b0c)
/** GFXMMU_LUT866L Graphic MMU LUT entry 866 low **/
#define GFXMMU_LUT866L			MMIO32(GFXMMU_BASE + 0x2b10)
/** GFXMMU_LUT866H Graphic MMU LUT entry 866 high **/
#define GFXMMU_LUT866H			MMIO32(GFXMMU_BASE + 0x2b14)
/** GFXMMU_LUT867L Graphic MMU LUT entry 867 low **/
#define GFXMMU_LUT867L			MMIO32(GFXMMU_BASE + 0x2b18)
/** GFXMMU_LUT867H Graphic MMU LUT entry 867 high **/
#define GFXMMU_LUT867H			MMIO32(GFXMMU_BASE + 0x2b1c)
/** GFXMMU_LUT868L Graphic MMU LUT entry 868 low **/
#define GFXMMU_LUT868L			MMIO32(GFXMMU_BASE + 0x2b20)
/** GFXMMU_LUT868H Graphic MMU LUT entry 868 high **/
#define GFXMMU_LUT868H			MMIO32(GFXMMU_BASE + 0x2b24)
/** GFXMMU_LUT869L Graphic MMU LUT entry 869 low **/
#define GFXMMU_LUT869L			MMIO32(GFXMMU_BASE + 0x2b28)
/** GFXMMU_LUT869H Graphic MMU LUT entry 869 high **/
#define GFXMMU_LUT869H			MMIO32(GFXMMU_BASE + 0x2b2c)
/** GFXMMU_LUT870L Graphic MMU LUT entry 870 low **/
#define GFXMMU_LUT870L			MMIO32(GFXMMU_BASE + 0x2b30)
/** GFXMMU_LUT870H Graphic MMU LUT entry 870 high **/
#define GFXMMU_LUT870H			MMIO32(GFXMMU_BASE + 0x2b34)
/** GFXMMU_LUT871L Graphic MMU LUT entry 871 low **/
#define GFXMMU_LUT871L			MMIO32(GFXMMU_BASE + 0x2b38)
/** GFXMMU_LUT871H Graphic MMU LUT entry 871 high **/
#define GFXMMU_LUT871H			MMIO32(GFXMMU_BASE + 0x2b3c)
/** GFXMMU_LUT872L Graphic MMU LUT entry 872 low **/
#define GFXMMU_LUT872L			MMIO32(GFXMMU_BASE + 0x2b40)
/** GFXMMU_LUT872H Graphic MMU LUT entry 872 high **/
#define GFXMMU_LUT872H			MMIO32(GFXMMU_BASE + 0x2b44)
/** GFXMMU_LUT873L Graphic MMU LUT entry 873 low **/
#define GFXMMU_LUT873L			MMIO32(GFXMMU_BASE + 0x2b48)
/** GFXMMU_LUT873H Graphic MMU LUT entry 873 high **/
#define GFXMMU_LUT873H			MMIO32(GFXMMU_BASE + 0x2b4c)
/** GFXMMU_LUT874L Graphic MMU LUT entry 874 low **/
#define GFXMMU_LUT874L			MMIO32(GFXMMU_BASE + 0x2b50)
/** GFXMMU_LUT874H Graphic MMU LUT entry 874 high **/
#define GFXMMU_LUT874H			MMIO32(GFXMMU_BASE + 0x2b54)
/** GFXMMU_LUT875L Graphic MMU LUT entry 875 low **/
#define GFXMMU_LUT875L			MMIO32(GFXMMU_BASE + 0x2b58)
/** GFXMMU_LUT875H Graphic MMU LUT entry 875 high **/
#define GFXMMU_LUT875H			MMIO32(GFXMMU_BASE + 0x2b5c)
/** GFXMMU_LUT876L Graphic MMU LUT entry 876 low **/
#define GFXMMU_LUT876L			MMIO32(GFXMMU_BASE + 0x2b60)
/** GFXMMU_LUT876H Graphic MMU LUT entry 876 high **/
#define GFXMMU_LUT876H			MMIO32(GFXMMU_BASE + 0x2b64)
/** GFXMMU_LUT877L Graphic MMU LUT entry 877 low **/
#define GFXMMU_LUT877L			MMIO32(GFXMMU_BASE + 0x2b68)
/** GFXMMU_LUT877H Graphic MMU LUT entry 877 high **/
#define GFXMMU_LUT877H			MMIO32(GFXMMU_BASE + 0x2b6c)
/** GFXMMU_LUT878L Graphic MMU LUT entry 878 low **/
#define GFXMMU_LUT878L			MMIO32(GFXMMU_BASE + 0x2b70)
/** GFXMMU_LUT878H Graphic MMU LUT entry 878 high **/
#define GFXMMU_LUT878H			MMIO32(GFXMMU_BASE + 0x2b74)
/** GFXMMU_LUT879L Graphic MMU LUT entry 879 low **/
#define GFXMMU_LUT879L			MMIO32(GFXMMU_BASE + 0x2b78)
/** GFXMMU_LUT879H Graphic MMU LUT entry 879 high **/
#define GFXMMU_LUT879H			MMIO32(GFXMMU_BASE + 0x2b7c)
/** GFXMMU_LUT880L Graphic MMU LUT entry 880 low **/
#define GFXMMU_LUT880L			MMIO32(GFXMMU_BASE + 0x2b80)
/** GFXMMU_LUT880H Graphic MMU LUT entry 880 high **/
#define GFXMMU_LUT880H			MMIO32(GFXMMU_BASE + 0x2b84)
/** GFXMMU_LUT881L Graphic MMU LUT entry 881 low **/
#define GFXMMU_LUT881L			MMIO32(GFXMMU_BASE + 0x2b88)
/** GFXMMU_LUT881H Graphic MMU LUT entry 881 high **/
#define GFXMMU_LUT881H			MMIO32(GFXMMU_BASE + 0x2b8c)
/** GFXMMU_LUT882L Graphic MMU LUT entry 882 low **/
#define GFXMMU_LUT882L			MMIO32(GFXMMU_BASE + 0x2b90)
/** GFXMMU_LUT882H Graphic MMU LUT entry 882 high **/
#define GFXMMU_LUT882H			MMIO32(GFXMMU_BASE + 0x2b94)
/** GFXMMU_LUT883L Graphic MMU LUT entry 883 low **/
#define GFXMMU_LUT883L			MMIO32(GFXMMU_BASE + 0x2b98)
/** GFXMMU_LUT883H Graphic MMU LUT entry 883 high **/
#define GFXMMU_LUT883H			MMIO32(GFXMMU_BASE + 0x2b9c)
/** GFXMMU_LUT884L Graphic MMU LUT entry 884 low **/
#define GFXMMU_LUT884L			MMIO32(GFXMMU_BASE + 0x2ba0)
/** GFXMMU_LUT884H Graphic MMU LUT entry 884 high **/
#define GFXMMU_LUT884H			MMIO32(GFXMMU_BASE + 0x2ba4)
/** GFXMMU_LUT885L Graphic MMU LUT entry 885 low **/
#define GFXMMU_LUT885L			MMIO32(GFXMMU_BASE + 0x2ba8)
/** GFXMMU_LUT885H Graphic MMU LUT entry 885 high **/
#define GFXMMU_LUT885H			MMIO32(GFXMMU_BASE + 0x2bac)
/** GFXMMU_LUT886L Graphic MMU LUT entry 886 low **/
#define GFXMMU_LUT886L			MMIO32(GFXMMU_BASE + 0x2bb0)
/** GFXMMU_LUT886H Graphic MMU LUT entry 886 high **/
#define GFXMMU_LUT886H			MMIO32(GFXMMU_BASE + 0x2bb4)
/** GFXMMU_LUT887L Graphic MMU LUT entry 887 low **/
#define GFXMMU_LUT887L			MMIO32(GFXMMU_BASE + 0x2bb8)
/** GFXMMU_LUT887H Graphic MMU LUT entry 887 high **/
#define GFXMMU_LUT887H			MMIO32(GFXMMU_BASE + 0x2bbc)
/** GFXMMU_LUT888L Graphic MMU LUT entry 888 low **/
#define GFXMMU_LUT888L			MMIO32(GFXMMU_BASE + 0x2bc0)
/** GFXMMU_LUT888H Graphic MMU LUT entry 888 high **/
#define GFXMMU_LUT888H			MMIO32(GFXMMU_BASE + 0x2bc4)
