grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT889L Graphic MMU LUT entry 889 low **/
#define GFXMMU_LUT889L			MMIO32(GFXMMU_BASE + 0x2bc8)
/** GFXMMU_LUT889H Graphic MMU LUT entry 889 high **/
#define GFXMMU_LUT889H			MMIO32(GFXMMU_BASE + 0x2bcc)
/** GFXMMU_LUT890L Graphic MMU LUT entry 890 low **/
#define GFXMMU_LUT890L			MMIO32(GFXMMU_BASE + 0x2bd0)
/** GFXMMU_LUT890H Graphic MMU LUT entry 890 high **/
#define GFXMMU_LUT890H			MMIO32(GFXMMU_BASE + 0x2bd4)
/** GFXMMU_LUT891L Graphic MMU LUT entry 891 low **/
#define GFXMMU_LUT891L			MMIO32(GFXMMU_BASE + 0x2bd8)
/** GFXMMU_LUT891H Graphic MMU LUT entry 891 high **/
#define GFXMMU_LUT891H			MMIO32(GFXMMU_BASE + 0x2bdc)
/** GFXMMU_LUT892L Graphic MMU LUT entry 892 low **/
#define GFXMMU_LUT892L			MMIO32(GFXMMU_BASE + 0x2be0)
/** GFXMMU_LUT892H Graphic MMU LUT entry 892 high **/
#define GFXMMU_LUT892H			MMIO32(GFXMMU_BASE + 0x2be4)
/** GFXMMU_LUT893L Graphic MMU LUT entry 893 low **/
#define GFXMMU_LUT893L			MMIO32(GFXMMU_BASE + 0x2be8)
/** GFXMMU_LUT893H Graphic MMU LUT entry 893 high **/
#define GFXMMU_LUT893H			MMIO32(GFXMMU_BASE + 0x2bec)
/** GFXMMU_LUT894L Graphic MMU LUT entry 894 low **/
#define GFXMMU_LUT894L			MMIO32(GFXMMU_BASE + 0x2bf0)
/** GFXMMU_LUT894H Graphic MMU LUT entry 894 high **/
#define GFXMMU_LUT894H			MMIO32(GFXMMU_BASE + 0x2bf4)
/** GFXMMU_LUT895L Graphic MMU LUT entry 895 low **/
#define GFXMMU_LUT895L			MMIO32(GFXMMU_BASE + 0x2bf8)
/** GFXMMU_LUT895H Graphic MMU LUT entry 895 high **/
#define GFXMMU_LUT895H			MMIO32(GFXMMU_BASE + 0x2bfc)
/** GFXMMU_LUT896L Graphic MMU LUT entry 896 low **/
#define GFXMMU_LUT896L			MMIO32(GFXMMU_BASE + 0x2c00)
/** GFXMMU_LUT896H Graphic MMU LUT entry 896 high **/
#define GFXMMU_LUT896H			MMIO32(GFXMMU_BASE + 0x2c04)
/** GFXMMU_LUT897L Graphic MMU LUT entry 897 low **/
#define GFXMMU_LUT897L			MMIO32(GFXMMU_BASE + 0x2c08)
/** GFXMMU_LUT897H Graphic MMU LUT entry 897 high **/
#define GFXMMU_LUT897H			MMIO32(GFXMMU_BASE + 0x2c0c)
/** GFXMMU_LUT898L Graphic MMU LUT entry 898 low **/
#define GFXMMU_LUT898L			MMIO32(GFXMMU_BASE + 0x2c10)
/** GFXMMU_LUT898H Graphic MMU LUT entry 898 high **/
#define GFXMMU_LUT898H			MMIO32(GFXMMU_BASE + 0x2c14)
/** GFXMMU_LUT899L Graphic MMU LUT entry 899 low **/
#define GFXMMU_LUT899L			MMIO32(GFXMMU_BASE + 0x2c18)
/** GFXMMU_LUT899H Graphic MMU LUT entry 899 high **/
#define GFXMMU_LUT899H			MMIO32(GFXMMU_BASE + 0x2c1c)
/** GFXMMU_LUT900L Graphic MMU LUT entry 900 low **/
#define GFXMMU_LUT900L			MMIO32(GFXMMU_BASE + 0x2c20)
/** GFXMMU_LUT900H Graphic MMU LUT entry 900 high **/
#define GFXMMU_LUT900H			MMIO32(GFXMMU_BASE + 0x2c24)
/** GFXMMU_LUT901L Graphic MMU LUT entry 901 low **/
#define GFXMMU_LUT901L			MMIO32(GFXMMU_BASE + 0x2c28)
/** GFXMMU_LUT901H Graphic MMU LUT entry 901 high **/
#define GFXMMU_LUT901H			MMIO32(GFXMMU_BASE + 0x2c2c)
/** GFXMMU_LUT902L Graphic MMU LUT entry 902 low **/
#define GFXMMU_LUT902L			MMIO32(GFXMMU_BASE + 0x2c30)
/** GFXMMU_LUT902H Graphic MMU LUT entry 902 high **/
#define GFXMMU_LUT902H			MMIO32(GFXMMU_BASE + 0x2c34)
/** GFXMMU_LUT903L Graphic MMU LUT entry 903 low **/
#define GFXMMU_LUT903L			MMIO32(GFXMMU_BASE + 0x2c38)
/** GFXMMU_LUT903H Graphic MMU LUT entry 903 high **/
#define GFXMMU_LUT903H			MMIO32(GFXMMU_BASE + 0x2c3c)
/** GFXMMU_LUT904L Graphic MMU LUT entry 904 low **/
#define GFXMMU_LUT904L			MMIO32(GFXMMU_BASE + 0x2c40)
/** GFXMMU_LUT904H Graphic MMU LUT entry 904 high **/
#define GFXMMU_LUT904H			MMIO32(GFXMMU_BASE + 0x2c44)
/** GFXMMU_LUT905L Graphic MMU LUT entry 905 low **/
#define GFXMMU_LUT905L			MMIO32(GFXMMU_BASE + 0x2c48)
/** GFXMMU_LUT905H Graphic MMU LUT entry 905 high **/
#define GFXMMU_LUT905H			MMIO32(GFXMMU_BASE + 0x2c4c)
/** GFXMMU_LUT906L Graphic MMU LUT entry 906 low **/
#define GFXMMU_LUT906L			MMIO32(GFXMMU_BASE + 0x2c50)
/** GFXMMU_LUT906H Graphic MMU LUT entry 906 high **/
#define GFXMMU_LUT906H			MMIO32(GFXMMU_BASE + 0x2c54)
/** GFXMMU_LUT907L Graphic MMU LUT entry 907 low **/
#define GFXMMU_LUT907L			MMIO32(GFXMMU_BASE + 0x2c58)
/** GFXMMU_LUT907H Graphic MMU LUT entry 907 high **/
#define GFXMMU_LUT907H			MMIO32(GFXMMU_BASE + 0x2c5c)
/** GFXMMU_LUT908L Graphic MMU LUT entry 908 low **/
#define GFXMMU_LUT908L			MMIO32(GFXMMU_BASE + 0x2c60)
/** GFXMMU_LUT908H Graphic MMU LUT entry 908 high **/
#define GFXMMU_LUT908H			MMIO32(GFXMMU_BASE + 0x2c64)
/** GFXMMU_LUT909L Graphic MMU LUT entry 909 low **/
#define GFXMMU_LUT909L			MMIO32(GFXMMU_BASE + 0x2c68)
/** GFXMMU_LUT909H Graphic MMU LUT entry 909 high **/
#define GFXMMU_LUT909H			MMIO32(GFXMMU_BASE + 0x2c6c)
/** GFXMMU_LUT910L Graphic MMU LUT entry 910 low **/
#define GFXMMU_LUT910L			MMIO32(GFXMMU_BASE + 0x2c70)
/** GFXMMU_LUT910H Graphic MMU LUT entry 910 high **/
#define GFXMMU_LUT910H			MMIO32(GFXMMU_BASE + 0x2c74)
/** GFXMMU_LUT911L Graphic MMU LUT entry 911 low **/
#define GFXMMU_LUT911L			MMIO32(GFXMMU_BASE + 0x2c78)
/** GFXMMU_LUT911H Graphic MMU LUT entry 911 high **/
#define GFXMMU_LUT911H			MMIO32(GFXMMU_BASE + 0x2c7c)
/** GFXMMU_LUT912L Graphic MMU LUT entry 912 low **/
#define GFXMMU_LUT912L			MMIO32(GFXMMU_BASE + 0x2c80)
/** GFXMMU_LUT912H Graphic MMU LUT entry 912 high **/
#define GFXMMU_LUT912H			MMIO32(GFXMMU_BASE + 0x2c84)
/** GFXMMU_LUT913L Graphic MMU LUT entry 913 low **/
#define GFXMMU_LUT913L			MMIO32(GFXMMU_BASE + 0x2c88)
/** GFXMMU_LUT913H Graphic MMU LUT entry 913 high **/
#define GFXMMU_LUT913H			MMIO32(GFXMMU_BASE + 0x2c8c)
/** GFXMMU_LUT914L Graphic MMU LUT entry 914 low **/
#define GFXMMU_LUT914L			MMIO32(GFXMMU_BASE + 0x2c90)
/** GFXMMU_LUT914H Graphic MMU LUT entry 914 high **/
#define GFXMMU_LUT914H			MMIO32(GFXMMU_BASE + 0x2c94)
/** GFXMMU_LUT915L Graphic MMU LUT entry 915 low **/
#define GFXMMU_LUT915L			MMIO32(GFXMMU_BASE + 0x2c98)
/** GFXMMU_LUT915H Graphic MMU LUT entry 915 high **/
#define GFXMMU_LUT915H			MMIO32(GFXMMU_BASE + 0x2c9c)
/** GFXMMU_LUT916L Graphic MMU LUT entry 916 low **/
#define GFXMMU_LUT916L			MMIO32(GFXMMU_BASE + 0x2ca0)
/** GFXMMU_LUT916H Graphic MMU LUT entry 916 high **/
#define GFXMMU_LUT916H			MMIO32(GFXMMU_BASE + 0x2ca4)
/** GFXMMU_LUT917L Graphic MMU LUT entry 917 low **/
#define GFXMMU_LUT917L			MMIO32(GFXMMU_BASE + 0x2ca8)
/** GFXMMU_LUT917H Graphic MMU LUT entry 917 high **/
#define GFXMMU_LUT917H			MMIO32(GFXMMU_BASE + 0x2cac)
/** GFXMMU_LUT918L Graphic MMU LUT entry 918 low **/
#define GFXMMU_LUT918L			MMIO32(GFXMMU_BASE + 0x2cb0)
/** GFXMMU_LUT918H Graphic MMU LUT entry 918 high **/
#define GFXMMU_LUT918H			MMIO32(GFXMMU_BASE + 0x2cb4)
/** GFXMMU_LUT919L Graphic MMU LUT entry 919 low **/
#define GFXMMU_LUT919L			MMIO32(GFXMMU_BASE + 0x2cb8)
/** GFXMMU_LUT919H Graphic MMU LUT entry 919 high **/
#define GFXMMU_LUT919H			MMIO32(GFXMMU_BASE + 0x2cbc)
/** GFXMMU_LUT920L Graphic MMU LUT entry 920 low **/
#define GFXMMU_LUT920L			MMIO32(GFXMMU_BASE + 0x2cc0)
/** GFXMMU_LUT920H Graphic MMU LUT entry 920 high **/
#define GFXMMU_LUT920H			MMIO32(GFXMMU_BASE + 0x2cc4)
/** GFXMMU_LUT921L Graphic MMU LUT entry 921 low **/
#define GFXMMU_LUT921L			MMIO32(GFXMMU_BASE + 0x2cc8)
/** GFXMMU_LUT921H Graphic MMU LUT entry 921 high **/
#define GFXMMU_LUT921H			MMIO32(GFXMMU_BASE + 0x2ccc)
/** GFXMMU_LUT922L Graphic MMU LUT entry 922 low **/
#define GFXMMU_LUT922L			MMIO32(GFXMMU_BASE + 0x2cd0)
/** GFXMMU_LUT922H Graphic MMU LUT entry 922 high **/
#define GFXMMU_LUT922H			MMIO32(GFXMMU_BASE + 0x2cd4)
/** GFXMMU_LUT923L Graphic MMU LUT entry 923 low **/
#define GFXMMU_LUT923L			MMIO32(GFXMMU_BASE + 0x2cd8)
/** GFXMMU_LUT923H Graphic MMU LUT entry 923 high **/
#define GFXMMU_LUT923H			MMIO32(GFXMMU_BASE + 0x2cdc)
/** GFXMMU_LUT924L Graphic MMU LUT entry 924 low **/
#define GFXMMU_LUT924L			MMIO32(GFXMMU_BASE + 0x2ce0)
/** GFXMMU_LUT924H Graphic MMU LUT entry 924 high **/
#define GFXMMU_LUT924H			MMIO32(GFXMMU_BASE + 0x2ce4)
/** GFXMMU_LUT925L Graphic MMU LUT entry 925 low **/
#define GFXMMU_LUT925L			MMIO32(GFXMMU_BASE + 0x2ce8)
/** GFXMMU_LUT925H Graphic MMU LUT entry 925 high **/
#define GFXMMU_LUT925H			MMIO32(GFXMMU_BASE + 0x2cec)
/** GFXMMU_LUT926L Graphic MMU LUT entry 926 low **/
#define GFXMMU_LUT926L			MMIO32(GFXMMU_BASE + 0x2cf0)
/** GFXMMU_LUT926H Graphic MMU LUT entry 926 high **/
#define GFXMMU_LUT926H			MMIO32(GFXMMU_BASE + 0x2cf4)
/** GFXMMU_LUT927L Graphic MMU LUT entry 927 low **/
#define GFXMMU_LUT927L			MMIO32(GFXMMU_BASE + 0x2cf8)
/** GFXMMU_LUT927H Graphic MMU LUT entry 927 high **/
#define GFXMMU_LUT927H			MMIO32(GFXMMU_BASE + 0x2cfc)
/** GFXMMU_LUT928L Graphic MMU LUT entry 928 low **/
#define GFXMMU_LUT928L			MMIO32(GFXMMU_BASE + 0x2d00)
/** GFXMMU_LUT928H Graphic MMU LUT entry 928 high **/
#define GFXMMU_LUT928H			MMIO32(GFXMMU_BASE + 0x2d04)
/** GFXMMU_LUT929L Graphic MMU LUT entry 929 low **/
#define GFXMMU_LUT929L			MMIO32(GFXMMU_BASE + 0x2d08)
/** GFXMMU_LUT929H Graphic MMU LUT entry 929 high **/
#define GFXMMU_LUT929H			MMIO32(GFXMMU_BASE + 0x2d0c)
/** GFXMMU_LUT930L Graphic MMU LUT entry 930 low **/
#define GFXMMU_LUT930L			MMIO32(GFXMMU_BASE + 0x2d10)
/** GFXMMU_LUT930H Graphic MMU LUT entry 930 high **/
#define GFXMMU_LUT930H			MMIO32(GFXMMU_BASE + 0x2d14)
/** GFXMMU_LUT931L Graphic MMU LUT entry 931 low **/
#define GFXMMU_LUT931L			MMIO32(GFXMMU_BASE + 0x2d18)
/** GFXMMU_LUT931H Graphic MMU LUT entry 931 high **/
#define GFXMMU_LUT931H			MMIO32(GFXMMU_BASE + 0x2d1c)
/** GFXMMU_LUT932L Graphic MMU LUT entry 932 low **/
#define GFXMMU_LUT932L			MMIO32(GFXMMU_BASE + 0x2d20)
/** GFXMMU_LUT932H Graphic MMU LUT entry 932 high **/
#define GFXMMU_LUT932H			MMIO32(GFXMMU_BASE + 0x2d24)
/** GFXMMU_LUT933L Graphic MMU LUT entry 933 low **/
#define GFXMMU_LUT933L			MMIO32(GFXMMU_BASE + 0x2d28)
/** GFXMMU_LUT933H Graphic MMU LUT entry 933 high **/
#define GFXMMU_LUT933H			MMIO32(GFXMMU_BASE + 0x2d2c)
/** GFXMMU_LUT934L Graphic MMU LUT entry 934 low **/
#define GFXMMU_LUT934L			MMIO32(GFXMMU_BASE + 0x2d30)
/** GFXMMU_LUT934H Graphic MMU LUT entry 934 high **/
#define GFXMMU_LUT934H			MMIO32(GFXMMU_BASE + 0x2d34)
/** GFXMMU_LUT935L Graphic MMU LUT entry 935 low **/
#define GFXMMU_LUT935L			MMIO32(GFXMMU_BASE + 0x2d38)
/** GFXMMU_LUT935H Graphic MMU LUT entry 935 high **/
#define GFXMMU_LUT935H			MMIO32(GFXMMU_BASE + 0x2d3c)
/** GFXMMU_LUT936L Graphic MMU LUT entry 936 low **/
#define GFXMMU_LUT936L			MMIO32(GFXMMU_BASE + 0x2d40)
/** GFXMMU_LUT936H Graphic MMU LUT entry 936 high **/
#define GFXMMU_LUT936H			MMIO32(GFXMMU_BASE + 0x2d44)
/** GFXMMU_LUT937L Graphic MMU LUT entry 937 low **/
#define GFXMMU_LUT937L			MMIO32(GFXMMU_BASE + 0x2d48)
/** GFXMMU_LUT937H Graphic MMU LUT entry 937 high **/
#define GFXMMU_LUT937H			MMIO32(GFXMMU_BASE + 0x2d4c)
/** GFXMMU_LUT938L Graphic MMU LUT entry 938 low **/
#define GFXMMU_LUT938L			MMIO32(GFXMMU_BASE + 0x2d50)
/** GFXMMU_LUT938H Graphic MMU LUT entry 938 high **/
#define GFXMMU_LUT938H			MMIO32(GFXMMU_BASE + 0x2d54)
/** GFXMMU_LUT939L Graphic MMU LUT entry 939 low **/
#define GFXMMU_LUT939L			MMIO32(GFXMMU_BASE + 0x2d58)
/** GFXMMU_LUT939H Graphic MMU LUT entry 939 high **/
#define GFXMMU_LUT939H			MMIO32(GFXMMU_BASE + 0x2d5c)
/** GFXMMU_LUT940L Graphic MMU LUT entry 940 low **/
#define GFXMMU_LUT940L			MMIO32(GFXMMU_BASE + 0x2d60)
/** GFXMMU_LUT940H Graphic MMU LUT entry 940 high **/
#define GFXMMU_LUT940H			MMIO32(GFXMMU_BASE + 0x2d64)
/** GFXMMU_LUT941L Graphic MMU LUT entry 941 low **/
#define GFXMMU_LUT941L			MMIO32(GFXMMU_BASE + 0x2d68)
/** GFXMMU_LUT941H Graphic MMU LUT entry 941 high **/
#define GFXMMU_LUT941H			MMIO32(GFXMMU_BASE + 0x2d6c)
/** GFXMMU_LUT942L Graphic MMU LUT entry 942 low **/
#define GFXMMU_LUT942L			MMIO32(GFXMMU_BASE + 0x2d70)
/** GFXMMU_LUT942H Graphic MMU LUT entry 942 high **/
#define GFXMMU_LUT942H			MMIO32(GFXMMU_BASE + 0x2d74)
/** GFXMMU_LUT943L Graphic MMU LUT entry 943 low **/
#define GFXMMU_LUT943L			MMIO32(GFXMMU_BASE + 0x2d78)
/** GFXMMU_LUT943H Graphic MMU LUT entry 943 high **/
#define GFXMMU_LUT943H			MMIO32(GFXMMU_BASE + 0x2d7c)
/** GFXMMU_LUT944L Graphic MMU LUT entry 944 low **/
#define GFXMMU_LUT944L			MMIO32(GFXMMU_BASE + 0x2d80)
/** GFXMMU_LUT944H Graphic MMU LUT entry 944 high **/
#define GFXMMU_LUT944H			MMIO32(GFXMMU_BASE + 0x2d84)
/** GFXMMU_LUT945L Graphic MMU LUT entry 945 low **/
#define GFXMMU_LUT945L			MMIO32(GFXMMU_BASE + 0x2d88)
/** GFXMMU_LUT945H Graphic MMU LUT entry 945 high **/
#define GFXMMU_LUT945H			MMIO32(GFXMMU_BASE + 0x2d8c)
/** GFXMMU_LUT946L Graphic MMU LUT entry 946 low **/
#define GFXMMU_LUT946L			MMIO32(GFXMMU_BASE + 0x2d90)
/** GFXMMU_LUT946H Graphic MMU LUT entry 946 high **/
#define GFXMMU_LUT946H			MMIO32(GFXMMU_BASE + 0x2d94)
/** GFXMMU_LUT947L Graphic MMU LUT entry 947 low **/
#define GFXMMU_LUT947L			MMIO32(GFXMMU_BASE + 0x2d98)
/** GFXMMU_LUT947H Graphic MMU LUT entry 947 high **/
#define GFXMMU_LUT947H			MMIO32(GFXMMU_BASE + 0x2d9c)
/** GFXMMU_LUT948L Graphic MMU LUT entry 948 low **/
#define GFXMMU_LUT948L			MMIO32(GFXMMU_BASE + 0x2da0)
/** GFXMMU_LUT948H Graphic MMU LUT entry 948 high **/
#define GFXMMU_LUT948H			MMIO32(GFXMMU_BASE + 0x2da4)
/** GFXMMU_LUT949L Graphic MMU LUT entry 949 low **/
#define GFXMMU_LUT949L			MMIO32(GFXMMU_BASE + 0x2da8)
/** GFXMMU_LUT949H Graphic MMU LUT entry 949 high **/
#define GFXMMU_LUT949H			MMIO32(GFXMMU_BASE + 0x2dac)
/** GFXMMU_LUT950L Graphic MMU LUT entry 950 low **/
#define GFXMMU_LUT950L			MMIO32(GFXMMU_BASE + 0x2db0)
/** GFXMMU_LUT950H Graphic MMU LUT entry 950 high **/
#define GFXMMU_LUT950H			MMIO32(GFXMMU_BASE + 0x2db4)
/** GFXMMU_LUT951L Graphic MMU LUT entry 951 low **/
#define GFXMMU_LUT951L			MMIO32(GFXMMU_BASE + 0x2db8)
/** GFXMMU_LUT951H Graphic MMU LUT entry 951 high **/
#define GFXMMU_LUT951H			MMIO32(GFXMMU_BASE + 0x2dbc)
/** GFXMMU_LUT952L Graphic MMU LUT entry 952 low **/
#define GFXMMU_LUT952L			MMIO32(GFXMMU_BASE + 0x2dc0)
/** GFXMMU_LUT952H Graphic MMU LUT entry 952 high **/
#define GFXMMU_LUT952H			MMIO32(GFXMMU_BASE + 0x2dc4)
/** GFXMMU_LUT953L Graphic MMU LUT entry 953 low **/
#define GFXMMU_LUT953L			MMIO32(GFXMMU_BASE + 0x2dc8)
/** GFXMMU_LUT953H Graphic MMU LUT entry 953 high **/
#define GFXMMU_LUT953H			MMIO32(GFXMMU_BASE + 0x2dcc)
/** GFXMMU_LUT954L Graphic MMU LUT entry 954 low **/
#define GFXMMU_LUT954L			MMIO32(GFXMMU_BASE + 0x2dd0)
/** GFXMMU_LUT954H Graphic MMU LUT entry 954 high **/
#define GFXMMU_LUT954H			MMIO32(GFXMMU_BASE + 0x2dd4)
/** GFXMMU_LUT955L Graphic MMU LUT entry 955 low **/
#define GFXMMU_LUT955L			MMIO32(GFXMMU_BASE + 0x2dd8)
/** GFXMMU_LUT955H Graphic MMU LUT entry 955 high **/
#define GFXMMU_LUT955H			MMIO32(GFXMMU_BASE + 0x2ddc)
/** GFXMMU_LUT956L Graphic MMU LUT entry 956 low **/
#define GFXMMU_LUT956L			MMIO32(GFXMMU_BASE + 0x2de0)
/** GFXMMU_LUT956H Graphic MMU LUT entry 956 high **/
#define GFXMMU_LUT956H			MMIO32(GFXMMU_BASE + 0x2de4)
/** GFXMMU_LUT957L Graphic MMU LUT entry 957 low **/
#define GFXMMU_LUT957L			MMIO32(GFXMMU_BASE + 0x2de8)
/** GFXMMU_LUT957H Graphic MMU LUT entry 957 high **/
#define GFXMMU_LUT957H			MMIO32(GFXMMU_BASE + 0x2dec)
/** GFXMMU_LUT958L Graphic MMU LUT entry 958 low **/
#define GFXMMU_LUT958L			MMIO32(GFXMMU_BASE + 0x2df0)
/** GFXMMU_LUT958H Graphic MMU LUT entry 958 high **/
#define GFXMMU_LUT958H			MMIO32(GFXMMU_BASE + 0x2df4)
/** GFXMMU_LUT959L Graphic MMU LUT entry 959 low **/
#define GFXMMU_LUT959L			MMIO32(GFXMMU_BASE + 0x2df8)
/** GFXMMU_LUT959H Graphic MMU LUT entry 959 high **/
#define GFXMMU_LUT959H			MMIO32(GFXMMU_BASE + 0x2dfc)
/** GFXMMU_LUT960L Graphic MMU LUT entry 960 low **/
#define GFXMMU_LUT960L			MMIO32(GFXMMU_BASE + 0x2e00)
/** GFXMMU_LUT960H Graphic MMU LUT entry 960 high **/
#define GFXMMU_LUT960H			MMIO32(GFXMMU_BASE + 0x2e04)
/** GFXMMU_LUT961L Graphic MMU LUT entry 961 low **/
#define GFXMMU_LUT961L			MMIO32(GFXMMU_BASE + 0x2e08)
/** GFXMMU_LUT961H Graphic MMU LUT entry 961 high **/
#define GFXMMU_LUT961H			MMIO32(GFXMMU_BASE + 0x2e0c)
/** GFXMMU_LUT962L Graphic MMU LUT entry 962 low **/
#define GFXMMU_LUT962L			MMIO32(GFXMMU_BASE + 0x2e10)
/** GFXMMU_LUT962H Graphic MMU LUT entry 962 high **/
#define GFXMMU_LUT962H			MMIO32(GFXMMU_BASE + 0x2e14)
/** GFXMMU_LUT963L Graphic MMU LUT entry 963 low **/
#define GFXMMU_LUT963L			MMIO32(GFXMMU_BASE + 0x2e18)
/** GFXMMU_LUT963H Graphic MMU LUT entry 963 high **/
#define GFXMMU_LUT963H			MMIO32(GFXMMU_BASE + 0x2e1c)
/** GFXMMU_LUT964L Graphic MMU LUT entry 964 low **/
#define GFXMMU_LUT964L			MMIO32(GFXMMU_BASE + 0x2e20)
/** GFXMMU_LUT964H Graphic MMU LUT entry 964 high **/
#define GFXMMU_LUT964H			MMIO32(GFXMMU_BASE + 0x2e24)
/** GFXMMU_LUT965L Graphic MMU LUT entry 965 low **/
#define GFXMMU_LUT965L			MMIO32(GFXMMU_BASE + 0x2e28)
/** GFXMMU_LUT965H Graphic MMU LUT entry 965 high **/
#define GFXMMU_LUT965H			MMIO32(GFXMMU_BASE + 0x2e2c)
/** GFXMMU_LUT966L Graphic MMU LUT entry 966 low **/
#define GFXMMU_LUT966L			MMIO32(GFXMMU_BASE + 0x2e30)
/** GFXMMU_LUT966H Graphic MMU LUT entry 966 high **/
#define GFXMMU_LUT966H			MMIO32(GFXMMU_BASE + 0x2e34)
/** GFXMMU_LUT967L Graphic MMU LUT entry 967 low **/
#define GFXMMU_LUT967L			MMIO32(GFXMMU_BASE + 0x2e38)
/** GFXMMU_LUT967H Graphic MMU LUT entry 967 high **/
#define GFXMMU_LUT967H			MMIO32(GFXMMU_BASE + 0x2e3c)
/** GFXMMU_LUT968L Graphic MMU LUT entry 968 low **/
#define GFXMMU_LUT968L			MMIO32(GFXMMU_BASE + 0x2e40)
/** GFXMMU_LUT968H Graphic MMU LUT entry 968 high **/
#define GFXMMU_LUT968H			MMIO32(GFXMMU_BASE + 0x2e44)
/** GFXMMU_LUT969L Graphic MMU LUT entry 969 low **/
#define GFXMMU_LUT969L			MMIO32(GFXMMU_BASE + 0x2e48)
/** GFXMMU_LUT969H Graphic MMU LUT entry 969 high **/
#define GFXMMU_LUT969H			MMIO32(GFXMMU_BASE + 0x2e4c)
/** GFXMMU_LUT970L Graphic MMU LUT entry 970 low **/
#define GFXMMU_LUT970L			MMIO32(GFXMMU_BASE + 0x2e50)
/** GFXMMU_LUT970H Graphic MMU LUT entry 970 high **/
#define GFXMMU_LUT970H			MMIO32(GFXMMU_BASE + 0x2e54)
/** GFXMMU_LUT971L Graphic MMU LUT entry 971 low **/
#define GFXMMU_LUT971L			MMIO32(GFXMMU_BASE + 0x2e58)
/** GFXMMU_LUT971H Graphic MMU LUT entry 971 high **/
#define GFXMMU_LUT971H			MMIO32(GFXMMU_BASE + 0x2e5c)
/** GFXMMU_LUT972L Graphic MMU LUT entry 972 low **/
#define GFXMMU_LUT972L			MMIO32(GFXMMU_BASE + 0x2e60)
/** GFXMMU_LUT972H Graphic MMU LUT entry 972 high **/
#define GFXMMU_LUT972H			MMIO32(GFXMMU_BASE + 0x2e64)
/** GFXMMU_LUT973L Graphic MMU LUT entry 973 low **/
#define GFXMMU_LUT973L			MMIO32(GFXMMU_BASE + 0x2e68)
/** GFXMMU_LUT973H Graphic MMU LUT entry 973 high **/
#define GFXMMU_LUT973H			MMIO32(GFXMMU_BASE + 0x2e6c)
/** GFXMMU_LUT974L Graphic MMU LUT entry 974 low **/
#define GFXMMU_LUT974L			MMIO32(GFXMMU_BASE + 0x2e70)
/** GFXMMU_LUT974H Graphic MMU LUT entry 974 high **/
#define GFXMMU_LUT974H			MMIO32(GFXMMU_BASE + 0x2e74)
/** GFXMMU_LUT975L Graphic MMU LUT entry 975 low **/
#define GFXMMU_LUT975L			MMIO32(GFXMMU_BASE + 0x2e78)
/** GFXMMU_LUT975H Graphic MMU LUT entry 975 high **/
#define GFXMMU_LUT975H			MMIO32(GFXMMU_BASE + 0x2e7c)
/** GFXMMU_LUT976L Graphic MMU LUT entry 976 low **/
#define GFXMMU_LUT976L			MMIO32(GFXMMU_BASE + 0x2e80)
/** GFXMMU_LUT976H Graphic MMU LUT entry 976 high **/
#define GFXMMU_LUT976H			MMIO32(GFXMMU_BASE + 0x2e84)
/** GFXMMU_LUT977L Graphic MMU LUT entry 977 low **/
#define GFXMMU_LUT977L			MMIO32(GFXMMU_BASE + 0x2e88)
/** GFXMMU_LUT977H Graphic MMU LUT entry 977 high **/
#define GFXMMU_LUT977H			MMIO32(GFXMMU_BASE + 0x2e8c)
/** GFXMMU_LUT978L Graphic MMU LUT entry 978 low **/
#define GFXMMU_LUT978L			MMIO32(GFXMMU_BASE + 0x2e90)
/** GFXMMU_LUT978H Graphic MMU LUT entry 978 high **/
#define GFXMMU_LUT978H			MMIO32(GFXMMU_BASE + 0x2e94)
/** GFXMMU_LUT979L Graphic MMU LUT entry 979 low **/
#define GFXMMU_LUT979L			MMIO32(GFXMMU_BASE + 0x2e98)
/** GFXMMU_LUT979H Graphic MMU LUT entry 979 high **/
#define GFXMMU_LUT979H			MMIO32(GFXMMU_BASE + 0x2e9c)
/** GFXMMU_LUT980L Graphic MMU LUT entry 980 low **/
#define GFXMMU_LUT980L			MMIO32(GFXMMU_BASE + 0x2ea0)
/** GFXMMU_LUT980H Graphic MMU LUT entry 980 high **/
#define GFXMMU_LUT980H			MMIO32(GFXMMU_BASE + 0x2ea4)
/** GFXMMU_LUT981L Graphic MMU LUT entry 981 low **/
#define GFXMMU_LUT981L			MMIO32(GFXMMU_BASE + 0x2ea8)
/** GFXMMU_LUT981H Graphic MMU LUT entry 981 high **/
#define GFXMMU_LUT981H			MMIO32(GFXMMU_BASE + 0x2eac)
/** GFXMMU_LUT982L Graphic MMU LUT entry 982 low **/
#define GFXMMU_LUT982L			MMIO32(GFXMMU_BASE + 0x2eb0)
/** GFXMMU_LUT982H Graphic MMU LUT entry 982 high **/
#define GFXMMU_LUT982H			MMIO32(GFXMMU_BASE + 0x2eb4)
/** GFXMMU_LUT983L Graphic MMU LUT entry 983 low **/
#define GFXMMU_LUT983L			MMIO32(GFXMMU_BASE + 0x2eb8)
/** GFXMMU_LUT983H Graphic MMU LUT entry 983 high **/
#define GFXMMU_LUT983H			MMIO32(GFXMMU_BASE + 0x2ebc)
/** GFXMMU_LUT984L Graphic MMU LUT entry 984 low **/
#define GFXMMU_LUT984L			MMIO32(GFXMMU_BASE + 0x2ec0)
/** GFXMMU_LUT984H Graphic MMU LUT entry 984 high **/
#define GFXMMU_LUT984H			MMIO32(GFXMMU_BASE + 0x2ec4)
/** GFXMMU_LUT985L Graphic MMU LUT entry 985 low **/
#define GFXMMU_LUT985L			MMIO32(GFXMMU_BASE + 0x2ec8)
/** GFXMMU_LUT985H Graphic MMU LUT entry 985 high **/
#define GFXMMU_LUT985H			MMIO32(GFXMMU_BASE + 0x2ecc)
/** GFXMMU_LUT986L Graphic MMU LUT entry 986 low **/
#define GFXMMU_LUT986L			MMIO32(GFXMMU_BASE + 0x2ed0)
/** GFXMMU_LUT986H Graphic MMU LUT entry 986 high **/
#define GFXMMU_LUT986H			MMIO32(GFXMMU_BASE + 0x2ed4)
/** GFXMMU_LUT987L Graphic MMU LUT entry 987 low **/
#define GFXMMU_LUT987L			MMIO32(GFXMMU_BASE + 0x2ed8)
/** GFXMMU_LUT987H Graphic MMU LUT entry 987 high **/
#define GFXMMU_LUT987H			MMIO32(GFXMMU_BASE + 0x2edc)
/** GFXMMU_LUT988L Graphic MMU LUT entry 988 low **/
#define GFXMMU_LUT988L			MMIO32(GFXMMU_BASE + 0x2ee0)
/** GFXMMU_LUT988H Graphic MMU LUT entry 988 high **/
#define GFXMMU_LUT988H			MMIO32(GFXMMU_BASE + 0x2ee4)
/** GFXMMU_LUT989L Graphic MMU LUT entry 989 low **/
#define GFXMMU_LUT989L			MMIO32(GFXMMU_BASE + 0x2ee8)
/** GFXMMU_LUT989H Graphic MMU LUT entry 989 high **/
#define GFXMMU_LUT989H			MMIO32(GFXMMU_BASE + 0x2eec)
/** GFXMMU_LUT990L Graphic MMU LUT entry 990 low **/
#define GFXMMU_LUT990L			MMIO32(GFXMMU_BASE + 0x2ef0)
/** GFXMMU_LUT990H Graphic MMU LUT entry 990 high **/
#define GFXMMU_LUT990H			MMIO32(GFXMMU_BASE + 0x2ef4)
/** GFXMMU_LUT991L Graphic MMU LUT entry 991 low **/
#define GFXMMU_LUT991L			MMIO32(GFXMMU_BASE + 0x2ef8)
/** GFXMMU_LUT991H Graphic MMU LUT entry 991 high **/
#define GFXMMU_LUT991H			MMIO32(GFXMMU_BASE + 0x2efc)
/** GFXMMU_LUT992L Graphic MMU LUT entry 992 low **/
#define GFXMMU_LUT992L			MMIO32(GFXMMU_BASE + 0x2f00)
/** GFXMMU_LUT992H Graphic MMU LUT entry 992 high **/
#define GFXMMU_LUT992H			MMIO32(GFXMMU_BASE + 0x2f04)
/** GFXMMU_LUT993L Graphic MMU LUT entry 993 low **/
#define GFXMMU_LUT993L			MMIO32(GFXMMU_BASE + 0x2f08)
/** GFXMMU_LUT993H Graphic MMU LUT entry 993 high **/
#define GFXMMU_LUT993H			MMIO32(GFXMMU_BASE + 0x2f0c)
/** GFXMMU_LUT994L Graphic MMU LUT entry 994 low **/
#define GFXMMU_LUT994L			MMIO32(GFXMMU_BASE + 0x2f10)
/** GFXMMU_LUT994H Graphic MMU LUT entry 994 high **/
#define GFXMMU_LUT994H			MMIO32(GFXMMU_BASE + 0x2f14)
/** GFXMMU_LUT995L Graphic MMU LUT entry 995 low **/
#define GFXMMU_LUT995L			MMIO32(GFXMMU_BASE + 0x2f18)
/** GFXMMU_LUT995H Graphic MMU LUT entry 995 high **/
#define GFXMMU_LUT995H			MMIO32(GFXMMU_BASE + 0x2f1c)
/** GFXMMU_LUT996L Graphic MMU LUT entry 996 low **/
#define GFXMMU_LUT996L			MMIO32(GFXMMU_BASE + 0x2f20)
/** GFXMMU_LUT996H Graphic MMU LUT entry 996 high **/
#define GFXMMU_LUT996H			MMIO32(GFXMMU_BASE + 0x2f24)
/** GFXMMU_LUT997L Graphic MMU LUT entry 997 low **/
#define GFXMMU_LUT997L			MMIO32(GFXMMU_BASE + 0x2f28)
/** GFXMMU_LUT997H Graphic MMU LUT entry 997 high **/
#define GFXMMU_LUT997H			MMIO32(GFXMMU_BASE + 0x2f2c)
/** GFXMMU_LUT998L Graphic MMU LUT entry 998 low **/
#define GFXMMU_LUT998L			MMIO32(GFXMMU_BASE + 0x2f30)
/** GFXMMU_LUT998H Graphic MMU LUT entry 998 high **/
#define GFXMMU_LUT998H			MMIO32(GFXMMU_BASE + 0x2f34)
/** GFXMMU_LUT999L Graphic MMU LUT entry 999 low **/
#define GFXMMU_LUT999L			MMIO32(GFXMMU_BASE + 0x2f38)
/** GFXMMU_LUT999H Graphic MMU LUT entry 999 high **/
#define GFXMMU_LUT999H			MMIO32(GFXMMU_BASE + 0x2f3c)
/** GFXMMU_LUT1000L Graphic MMU LUT entry 1000 low **/
#define GFXMMU_LUT1000L			MMIO32(GFXMMU_BASE + 0x2f40)
