grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT1000H Graphic MMU LUT entry 1000 high **/
#define GFXMMU_LUT1000H			MMIO32(GFXMMU_BASE + 0x2f44)
/** GFXMMU_LUT1001L Graphic MMU LUT entry 1001 low **/
#define GFXMMU_LUT1001L			MMIO32(GFXMMU_BASE + 0x2f48)
/** GFXMMU_LUT1001H Graphic MMU LUT entry 1001 high **/
#define GFXMMU_LUT1001H			MMIO32(GFXMMU_BASE + 0x2f4c)
/** GFXMMU_LUT1002L Graphic MMU LUT entry 1002 low **/
#define GFXMMU_LUT1002L			MMIO32(GFXMMU_BASE + 0x2f50)
/** GFXMMU_LUT1002H Graphic MMU LUT entry 1002 high **/
#define GFXMMU_LUT1002H			MMIO32(GFXMMU_BASE + 0x2f54)
/** GFXMMU_LUT1003L Graphic MMU LUT entry 1003 low **/
#define GFXMMU_LUT1003L			MMIO32(GFXMMU_BASE + 0x2f58)
/** GFXMMU_LUT1003H Graphic MMU LUT entry 1003 high **/
#define GFXMMU_LUT1003H			MMIO32(GFXMMU_BASE + 0x2f5c)
/** GFXMMU_LUT1004L Graphic MMU LUT entry 1004 low **/
#define GFXMMU_LUT1004L			MMIO32(GFXMMU_BASE + 0x2f60)
/** GFXMMU_LUT1004H Graphic MMU LUT entry 1004 high **/
#define GFXMMU_LUT1004H			MMIO32(GFXMMU_BASE + 0x2f64)
/** GFXMMU_LUT1005L Graphic MMU LUT entry 1005 low **/
#define GFXMMU_LUT1005L			MMIO32(GFXMMU_BASE + 0x2f68)
/** GFXMMU_LUT1005H Graphic MMU LUT entry 1005 high **/
#define GFXMMU_LUT1005H			MMIO32(GFXMMU_BASE + 0x2f6c)
/** GFXMMU_LUT1006L Graphic MMU LUT entry 1006 low **/
#define GFXMMU_LUT1006L			MMIO32(GFXMMU_BASE + 0x2f70)
/** GFXMMU_LUT1006H Graphic MMU LUT entry 1006 high **/
#define GFXMMU_LUT1006H			MMIO32(GFXMMU_BASE + 0x2f74)
/** GFXMMU_LUT1007L Graphic MMU LUT entry 1007 low **/
#define GFXMMU_LUT1007L			MMIO32(GFXMMU_BASE + 0x2f78)
/** GFXMMU_LUT1007H Graphic MMU LUT entry 1007 high **/
#define GFXMMU_LUT1007H			MMIO32(GFXMMU_BASE + 0x2f7c)
/** GFXMMU_LUT1008L Graphic MMU LUT entry 1008 low **/
#define GFXMMU_LUT1008L			MMIO32(GFXMMU_BASE + 0x2f80)
/** GFXMMU_LUT1008H Graphic MMU LUT entry 1008 high **/
#define GFXMMU_LUT1008H			MMIO32(GFXMMU_BASE + 0x2f84)
/** GFXMMU_LUT1009L Graphic MMU LUT entry 1009 low **/
#define GFXMMU_LUT1009L			MMIO32(GFXMMU_BASE + 0x2f88)
/** GFXMMU_LUT1009H Graphic MMU LUT entry 1009 high **/
#define GFXMMU_LUT1009H			MMIO32(GFXMMU_BASE + 0x2f8c)
/** GFXMMU_LUT1010L Graphic MMU LUT entry 1010 low **/
#define GFXMMU_LUT1010L			MMIO32(GFXMMU_BASE + 0x2f90)
/** GFXMMU_LUT1010H Graphic MMU LUT entry 1010 high **/
#define GFXMMU_LUT1010H			MMIO32(GFXMMU_BASE + 0x2f94)
/** GFXMMU_LUT1011L Graphic MMU LUT entry 1011 low **/
#define GFXMMU_LUT1011L			MMIO32(GFXMMU_BASE + 0x2f98)
/** GFXMMU_LUT1011H Graphic MMU LUT entry 1011 high **/
#define GFXMMU_LUT1011H			MMIO32(GFXMMU_BASE + 0x2f9c)
/** GFXMMU_LUT1012L Graphic MMU LUT entry 1012 low **/
#define GFXMMU_LUT1012L			MMIO32(GFXMMU_BASE + 0x2fa0)
/** GFXMMU_LUT1012H Graphic MMU LUT entry 1012 high **/
#define GFXMMU_LUT1012H			MMIO32(GFXMMU_BASE + 0x2fa4)
/** GFXMMU_LUT1013L Graphic MMU LUT entry 1013 low **/
#define GFXMMU_LUT1013L			MMIO32(GFXMMU_BASE + 0x2fa8)
/** GFXMMU_LUT1013H Graphic MMU LUT entry 1013 high **/
#define GFXMMU_LUT1013H			MMIO32(GFXMMU_BASE + 0x2fac)
/** GFXMMU_LUT1014L Graphic MMU LUT entry 1014 low **/
#define GFXMMU_LUT1014L			MMIO32(GFXMMU_BASE + 0x2fb0)
/** GFXMMU_LUT1014H Graphic MMU LUT entry 1014 high **/
#define GFXMMU_LUT1014H			MMIO32(GFXMMU_BASE + 0x2fb4)
/** GFXMMU_LUT1015L Graphic MMU LUT entry 1015 low **/
#define GFXMMU_LUT1015L			MMIO32(GFXMMU_BASE + 0x2fb8)
/** GFXMMU_LUT1015H Graphic MMU LUT entry 1015 high **/
#define GFXMMU_LUT1015H			MMIO32(GFXMMU_BASE + 0x2fbc)
/** GFXMMU_LUT1016L Graphic MMU LUT entry 1016 low **/
#define GFXMMU_LUT1016L			MMIO32(GFXMMU_BASE + 0x2fc0)
/** GFXMMU_LUT1016H Graphic MMU LUT entry 1016 high **/
#define GFXMMU_LUT1016H			MMIO32(GFXMMU_BASE + 0x2fc4)
/** GFXMMU_LUT1017L Graphic MMU LUT entry 1017 low **/
#define GFXMMU_LUT1017L			MMIO32(GFXMMU_BASE + 0x2fc8)
/** GFXMMU_LUT1017H Graphic MMU LUT entry 1017 high **/
#define GFXMMU_LUT1017H			MMIO32(GFXMMU_BASE + 0x2fcc)
/** GFXMMU_LUT1018L Graphic MMU LUT entry 1018 low **/
#define GFXMMU_LUT1018L			MMIO32(GFXMMU_BASE + 0x2fd0)
/** GFXMMU_LUT1018H Graphic MMU LUT entry 1018 high **/
#define GFXMMU_LUT1018H			MMIO32(GFXMMU_BASE + 0x2fd4)
/** GFXMMU_LUT1019L Graphic MMU LUT entry 1019 low **/
#define GFXMMU_LUT1019L			MMIO32(GFXMMU_BASE + 0x2fd8)
/** GFXMMU_LUT1019H Graphic MMU LUT entry 1019 high **/
#define GFXMMU_LUT1019H			MMIO32(GFXMMU_BASE + 0x2fdc)
/** GFXMMU_LUT1020L Graphic MMU LUT entry 1020 low **/
#define GFXMMU_LUT1020L			MMIO32(GFXMMU_BASE + 0x2fe0)
/** GFXMMU_LUT1020H Graphic MMU LUT entry 1020 high **/
#define GFXMMU_LUT1020H			MMIO32(GFXMMU_BASE + 0x2fe4)
/** GFXMMU_LUT1021L Graphic MMU LUT entry 1021 low **/
#define GFXMMU_LUT1021L			MMIO32(GFXMMU_BASE + 0x2fe8)
/** GFXMMU_LUT1021H Graphic MMU LUT entry 1021 high **/
#define GFXMMU_LUT1021H			MMIO32(GFXMMU_BASE + 0x2fec)
/** GFXMMU_LUT1022L Graphic MMU LUT entry 1022 low **/
#define GFXMMU_LUT1022L			MMIO32(GFXMMU_BASE + 0x2ff0)
/** GFXMMU_LUT1022H Graphic MMU LUT entry 1022 high **/
#define GFXMMU_LUT1022H			MMIO32(GFXMMU_BASE + 0x2ff4)
/** GFXMMU_LUT1023L Graphic MMU LUT entry 1023 low **/
#define GFXMMU_LUT1023L			MMIO32(GFXMMU_BASE + 0x2ff8)
/** GFXMMU_LUT1023H Graphic MMU LUT entry 1023 high **/
#define GFXMMU_LUT1023H			MMIO32(GFXMMU_BASE + 0x2ffc)

/**@}*/


/** @defgroup gfxmmu_cr CR Graphic MMU configuration register
@{*/

/** GFXMMU_CR_BM192 192 Block mode **/
#define GFXMMU_CR_BM192		(1 << 6)
/** GFXMMU_CR_AMEIE AHB master error interrupt enable **/
#define GFXMMU_CR_AMEIE		(1 << 4)
/** GFXMMU_CR_B3OIE Buffer 3 overflow interrupt enable **/
#define GFXMMU_CR_B3OIE		(1 << 3)
/** GFXMMU_CR_B2OIE Buffer 2 overflow interrupt enable **/
#define GFXMMU_CR_B2OIE		(1 << 2)
/** GFXMMU_CR_B1OIE Buffer 1 overflow interrupt enable **/
#define GFXMMU_CR_B1OIE		(1 << 1)
/** GFXMMU_CR_B0OIE Buffer 0 overflow interrupt enable **/
#define GFXMMU_CR_B0OIE		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_sr SR Graphic MMU status register
@{*/

/** GFXMMU_SR_AMEF AHB master error flag **/
#define GFXMMU_SR_AMEF		(1 << 4)
/** GFXMMU_SR_B3OF Buffer 3 overflow flag **/
#define GFXMMU_SR_B3OF		(1 << 3)
/** GFXMMU_SR_B2OF Buffer 2 overflow flag **/
#define GFXMMU_SR_B2OF		(1 << 2)
/** GFXMMU_SR_B1OF Buffer 1 overflow flag **/
#define GFXMMU_SR_B1OF		(1 << 1)
/** GFXMMU_SR_B0OF Buffer 0 overflow flag **/
#define GFXMMU_SR_B0OF		(1 << 0)

/**@}*/

