grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_fcr FCR Graphic MMU flag clear register
@{*/

/** GFXMMU_FCR_CAMEF Clear AHB master error flag **/
#define GFXMMU_FCR_CAMEF		(1 << 4)
/** GFXMMU_FCR_CB3OF Clear buffer 3 overflow flag **/
#define GFXMMU_FCR_CB3OF		(1 << 3)
/** GFXMMU_FCR_CB2OF Clear buffer 2 overflow flag **/
#define GFXMMU_FCR_CB2OF		(1 << 2)
/** GFXMMU_FCR_CB1OF Clear buffer 1 overflow flag **/
#define GFXMMU_FCR_CB1OF		(1 << 1)
/** GFXMMU_FCR_CB0OF Clear buffer 0 overflow flag **/
#define GFXMMU_FCR_CB0OF		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_dvr DVR Graphic MMU default value register
@{*/


#define GFXMMU_DVR_DV_SHIFT		0
#define GFXMMU_DVR_DV_MASK		0xffffffff
/** @defgroup gfxmmu_dvr_dv DV Default value
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_b0cr B0CR Graphic MMU buffer 0 configuration register
@{*/


#define GFXMMU_B0CR_PBBA_SHIFT		23
#define GFXMMU_B0CR_PBBA_MASK		0x1ff
/** @defgroup gfxmmu_b0cr_pbba PBBA Physical buffer base address
@{*/
/**@}*/


#define GFXMMU_B0CR_PBO_SHIFT		4
#define GFXMMU_B0CR_PBO_MASK		0x7ffff
/** @defgroup gfxmmu_b0cr_pbo PBO Physical buffer offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_b1cr B1CR Graphic MMU buffer 1 configuration register
@{*/


#define GFXMMU_B1CR_PBBA_SHIFT		23
#define GFXMMU_B1CR_PBBA_MASK		0x1ff
/** @defgroup gfxmmu_b1cr_pbba PBBA Physical buffer base address
@{*/
/**@}*/


#define GFXMMU_B1CR_PBO_SHIFT		4
#define GFXMMU_B1CR_PBO_MASK		0x7ffff
/** @defgroup gfxmmu_b1cr_pbo PBO Physical buffer offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_b2cr B2CR Graphic MMU buffer 2 configuration register
@{*/


#define GFXMMU_B2CR_PBBA_SHIFT		23
#define GFXMMU_B2CR_PBBA_MASK		0x1ff
/** @defgroup gfxmmu_b2cr_pbba PBBA Physical buffer base address
@{*/
/**@}*/


#define GFXMMU_B2CR_PBO_SHIFT		4
#define GFXMMU_B2CR_PBO_MASK		0x7ffff
/** @defgroup gfxmmu_b2cr_pbo PBO Physical buffer offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_b3cr B3CR Graphic MMU buffer 3 configuration register
@{*/


#define GFXMMU_B3CR_PBBA_SHIFT		23
#define GFXMMU_B3CR_PBBA_MASK		0x1ff
/** @defgroup gfxmmu_b3cr_pbba PBBA Physical buffer base address
@{*/
/**@}*/


#define GFXMMU_B3CR_PBO_SHIFT		4
#define GFXMMU_B3CR_PBO_MASK		0x7ffff
/** @defgroup gfxmmu_b3cr_pbo PBO Physical buffer offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_verr VERR Graphic MMU version register
@{*/


#define GFXMMU_VERR_MAJREV_SHIFT		4
#define GFXMMU_VERR_MAJREV_MASK		0x0f
/** @defgroup gfxmmu_verr_majrev MAJREV Major revision
@{*/
/**@}*/


#define GFXMMU_VERR_MINREV_SHIFT		0
#define GFXMMU_VERR_MINREV_MASK		0x0f
/** @defgroup gfxmmu_verr_minrev MINREV Minor revision
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_ipidr IPIDR Graphic MMU identification register
@{*/


#define GFXMMU_IPIDR_ID_SHIFT		0
#define GFXMMU_IPIDR_ID_MASK		0xffffffff
/** @defgroup gfxmmu_ipidr_id ID Identification Code
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_sidr SIDR Graphic MMU size identification register
@{*/


#define GFXMMU_SIDR_SID_SHIFT		0
#define GFXMMU_SIDR_SID_MASK		0xffffffff
/** @defgroup gfxmmu_sidr_sid SID Size and ID
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut0l LUT0L Graphic MMU LUT entry 0 low
@{*/


#define GFXMMU_LUT0L_LVB_SHIFT		16
#define GFXMMU_LUT0L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut0l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT0L_FVB_SHIFT		8
#define GFXMMU_LUT0L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut0l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT0L_EN Enable **/
#define GFXMMU_LUT0L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut0h LUT0H Graphic MMU LUT entry 0 high
@{*/


#define GFXMMU_LUT0H_LO_SHIFT		4
#define GFXMMU_LUT0H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut0h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1l LUT1L Graphic MMU LUT entry 1 low
@{*/


#define GFXMMU_LUT1L_LVB_SHIFT		16
#define GFXMMU_LUT1L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1L_FVB_SHIFT		8
#define GFXMMU_LUT1L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1L_EN Enable **/
#define GFXMMU_LUT1L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1h LUT1H Graphic MMU LUT entry 1 high
@{*/


#define GFXMMU_LUT1H_LO_SHIFT		4
#define GFXMMU_LUT1H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut2l LUT2L Graphic MMU LUT entry 2 low
@{*/


#define GFXMMU_LUT2L_LVB_SHIFT		16
#define GFXMMU_LUT2L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut2l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT2L_FVB_SHIFT		8
#define GFXMMU_LUT2L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut2l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT2L_EN Enable **/
#define GFXMMU_LUT2L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut2h LUT2H Graphic MMU LUT entry 2 high
@{*/


#define GFXMMU_LUT2H_LO_SHIFT		4
#define GFXMMU_LUT2H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut2h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut3l LUT3L Graphic MMU LUT entry 3 low
@{*/


#define GFXMMU_LUT3L_LVB_SHIFT		16
#define GFXMMU_LUT3L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut3l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT3L_FVB_SHIFT		8
#define GFXMMU_LUT3L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut3l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT3L_EN Enable **/
#define GFXMMU_LUT3L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut3h LUT3H Graphic MMU LUT entry 3 high
@{*/


#define GFXMMU_LUT3H_LO_SHIFT		4
#define GFXMMU_LUT3H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut3h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut4l LUT4L Graphic MMU LUT entry 4 low
@{*/


#define GFXMMU_LUT4L_LVB_SHIFT		16
#define GFXMMU_LUT4L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut4l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT4L_FVB_SHIFT		8
#define GFXMMU_LUT4L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut4l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT4L_EN Enable **/
#define GFXMMU_LUT4L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut4h LUT4H Graphic MMU LUT entry 4 high
@{*/


