grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT4H_LO_SHIFT		4
#define GFXMMU_LUT4H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut4h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut5l LUT5L Graphic MMU LUT entry 5 low
@{*/


#define GFXMMU_LUT5L_LVB_SHIFT		16
#define GFXMMU_LUT5L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut5l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT5L_FVB_SHIFT		8
#define GFXMMU_LUT5L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut5l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT5L_EN Enable **/
#define GFXMMU_LUT5L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut5h LUT5H Graphic MMU LUT entry 5 high
@{*/


#define GFXMMU_LUT5H_LO_SHIFT		4
#define GFXMMU_LUT5H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut5h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut6l LUT6L Graphic MMU LUT entry 6 low
@{*/


#define GFXMMU_LUT6L_LVB_SHIFT		16
#define GFXMMU_LUT6L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut6l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT6L_FVB_SHIFT		8
#define GFXMMU_LUT6L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut6l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT6L_EN Enable **/
#define GFXMMU_LUT6L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut6h LUT6H Graphic MMU LUT entry 6 high
@{*/


#define GFXMMU_LUT6H_LO_SHIFT		4
#define GFXMMU_LUT6H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut6h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut7l LUT7L Graphic MMU LUT entry 7 low
@{*/


#define GFXMMU_LUT7L_LVB_SHIFT		16
#define GFXMMU_LUT7L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut7l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT7L_FVB_SHIFT		8
#define GFXMMU_LUT7L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut7l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT7L_EN Enable **/
#define GFXMMU_LUT7L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut7h LUT7H Graphic MMU LUT entry 7 high
@{*/


#define GFXMMU_LUT7H_LO_SHIFT		4
#define GFXMMU_LUT7H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut7h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut8l LUT8L Graphic MMU LUT entry 8 low
@{*/


#define GFXMMU_LUT8L_LVB_SHIFT		16
#define GFXMMU_LUT8L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut8l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT8L_FVB_SHIFT		8
#define GFXMMU_LUT8L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut8l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT8L_EN Enable **/
#define GFXMMU_LUT8L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut8h LUT8H Graphic MMU LUT entry 8 high
@{*/


#define GFXMMU_LUT8H_LO_SHIFT		4
#define GFXMMU_LUT8H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut8h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut9l LUT9L Graphic MMU LUT entry 9 low
@{*/


#define GFXMMU_LUT9L_LVB_SHIFT		16
#define GFXMMU_LUT9L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut9l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT9L_FVB_SHIFT		8
#define GFXMMU_LUT9L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut9l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT9L_EN Enable **/
#define GFXMMU_LUT9L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut9h LUT9H Graphic MMU LUT entry 9 high
@{*/


#define GFXMMU_LUT9H_LO_SHIFT		4
#define GFXMMU_LUT9H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut9h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut10l LUT10L Graphic MMU LUT entry 10 low
@{*/


#define GFXMMU_LUT10L_LVB_SHIFT		16
#define GFXMMU_LUT10L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut10l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT10L_FVB_SHIFT		8
#define GFXMMU_LUT10L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut10l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT10L_EN Enable **/
#define GFXMMU_LUT10L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut10h LUT10H Graphic MMU LUT entry 10 high
@{*/


#define GFXMMU_LUT10H_LO_SHIFT		4
#define GFXMMU_LUT10H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut10h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut11l LUT11L Graphic MMU LUT entry 11 low
@{*/


#define GFXMMU_LUT11L_LVB_SHIFT		16
#define GFXMMU_LUT11L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut11l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT11L_FVB_SHIFT		8
#define GFXMMU_LUT11L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut11l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT11L_EN Enable **/
#define GFXMMU_LUT11L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut11h LUT11H Graphic MMU LUT entry 11 high
@{*/


#define GFXMMU_LUT11H_LO_SHIFT		4
#define GFXMMU_LUT11H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut11h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut12l LUT12L Graphic MMU LUT entry 12 low
@{*/


#define GFXMMU_LUT12L_LVB_SHIFT		16
#define GFXMMU_LUT12L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut12l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT12L_FVB_SHIFT		8
#define GFXMMU_LUT12L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut12l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT12L_EN Enable **/
#define GFXMMU_LUT12L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut12h LUT12H Graphic MMU LUT entry 12 high
@{*/


#define GFXMMU_LUT12H_LO_SHIFT		4
#define GFXMMU_LUT12H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut12h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut13l LUT13L Graphic MMU LUT entry 13 low
@{*/


#define GFXMMU_LUT13L_LVB_SHIFT		16
#define GFXMMU_LUT13L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut13l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT13L_FVB_SHIFT		8
#define GFXMMU_LUT13L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut13l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT13L_EN Enable **/
#define GFXMMU_LUT13L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut13h LUT13H Graphic MMU LUT entry 13 high
@{*/


#define GFXMMU_LUT13H_LO_SHIFT		4
#define GFXMMU_LUT13H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut13h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut14l LUT14L Graphic MMU LUT entry 14 low
@{*/


#define GFXMMU_LUT14L_LVB_SHIFT		16
#define GFXMMU_LUT14L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut14l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT14L_FVB_SHIFT		8
#define GFXMMU_LUT14L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut14l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT14L_EN Enable **/
#define GFXMMU_LUT14L_EN		(1 << 0)

/**@}*/

