grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut14h LUT14H Graphic MMU LUT entry 14 high
@{*/


#define GFXMMU_LUT14H_LO_SHIFT		4
#define GFXMMU_LUT14H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut14h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut15l LUT15L Graphic MMU LUT entry 15 low
@{*/


#define GFXMMU_LUT15L_LVB_SHIFT		16
#define GFXMMU_LUT15L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut15l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT15L_FVB_SHIFT		8
#define GFXMMU_LUT15L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut15l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT15L_EN Enable **/
#define GFXMMU_LUT15L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut15h LUT15H Graphic MMU LUT entry 15 high
@{*/


#define GFXMMU_LUT15H_LO_SHIFT		4
#define GFXMMU_LUT15H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut15h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut16l LUT16L Graphic MMU LUT entry 16 low
@{*/


#define GFXMMU_LUT16L_LVB_SHIFT		16
#define GFXMMU_LUT16L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut16l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT16L_FVB_SHIFT		8
#define GFXMMU_LUT16L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut16l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT16L_EN Enable **/
#define GFXMMU_LUT16L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut16h LUT16H Graphic MMU LUT entry 16 high
@{*/


#define GFXMMU_LUT16H_LO_SHIFT		4
#define GFXMMU_LUT16H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut16h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut17l LUT17L Graphic MMU LUT entry 17 low
@{*/


#define GFXMMU_LUT17L_LVB_SHIFT		16
#define GFXMMU_LUT17L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut17l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT17L_FVB_SHIFT		8
#define GFXMMU_LUT17L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut17l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT17L_EN Enable **/
#define GFXMMU_LUT17L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut17h LUT17H Graphic MMU LUT entry 17 high
@{*/


#define GFXMMU_LUT17H_LO_SHIFT		4
#define GFXMMU_LUT17H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut17h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut18l LUT18L Graphic MMU LUT entry 18 low
@{*/


#define GFXMMU_LUT18L_LVB_SHIFT		16
#define GFXMMU_LUT18L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut18l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT18L_FVB_SHIFT		8
#define GFXMMU_LUT18L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut18l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT18L_EN Enable **/
#define GFXMMU_LUT18L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut18h LUT18H Graphic MMU LUT entry 18 high
@{*/


#define GFXMMU_LUT18H_LO_SHIFT		4
#define GFXMMU_LUT18H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut18h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut19l LUT19L Graphic MMU LUT entry 19 low
@{*/


#define GFXMMU_LUT19L_LVB_SHIFT		16
#define GFXMMU_LUT19L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut19l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT19L_FVB_SHIFT		8
#define GFXMMU_LUT19L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut19l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT19L_EN Enable **/
#define GFXMMU_LUT19L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut19h LUT19H Graphic MMU LUT entry 19 high
@{*/


#define GFXMMU_LUT19H_LO_SHIFT		4
#define GFXMMU_LUT19H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut19h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut20l LUT20L Graphic MMU LUT entry 20 low
@{*/


#define GFXMMU_LUT20L_LVB_SHIFT		16
#define GFXMMU_LUT20L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut20l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT20L_FVB_SHIFT		8
#define GFXMMU_LUT20L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut20l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT20L_EN Enable **/
#define GFXMMU_LUT20L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut20h LUT20H Graphic MMU LUT entry 20 high
@{*/


#define GFXMMU_LUT20H_LO_SHIFT		4
#define GFXMMU_LUT20H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut20h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut21l LUT21L Graphic MMU LUT entry 21 low
@{*/


#define GFXMMU_LUT21L_LVB_SHIFT		16
#define GFXMMU_LUT21L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut21l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT21L_FVB_SHIFT		8
#define GFXMMU_LUT21L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut21l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT21L_EN Enable **/
#define GFXMMU_LUT21L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut21h LUT21H Graphic MMU LUT entry 21 high
@{*/


#define GFXMMU_LUT21H_LO_SHIFT		4
#define GFXMMU_LUT21H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut21h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut22l LUT22L Graphic MMU LUT entry 22 low
@{*/


#define GFXMMU_LUT22L_LVB_SHIFT		16
#define GFXMMU_LUT22L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut22l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT22L_FVB_SHIFT		8
#define GFXMMU_LUT22L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut22l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT22L_EN Enable **/
#define GFXMMU_LUT22L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut22h LUT22H Graphic MMU LUT entry 22 high
@{*/


#define GFXMMU_LUT22H_LO_SHIFT		4
#define GFXMMU_LUT22H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut22h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut23l LUT23L Graphic MMU LUT entry 23 low
@{*/


#define GFXMMU_LUT23L_LVB_SHIFT		16
#define GFXMMU_LUT23L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut23l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT23L_FVB_SHIFT		8
#define GFXMMU_LUT23L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut23l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT23L_EN Enable **/
#define GFXMMU_LUT23L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut23h LUT23H Graphic MMU LUT entry 23 high
@{*/


#define GFXMMU_LUT23H_LO_SHIFT		4
#define GFXMMU_LUT23H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut23h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

