grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut24l LUT24L Graphic MMU LUT entry 24 low
@{*/


#define GFXMMU_LUT24L_LVB_SHIFT		16
#define GFXMMU_LUT24L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut24l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT24L_FVB_SHIFT		8
#define GFXMMU_LUT24L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut24l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT24L_EN Enable **/
#define GFXMMU_LUT24L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut24h LUT24H Graphic MMU LUT entry 24 high
@{*/


#define GFXMMU_LUT24H_LO_SHIFT		4
#define GFXMMU_LUT24H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut24h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut25l LUT25L Graphic MMU LUT entry 25 low
@{*/


#define GFXMMU_LUT25L_LVB_SHIFT		16
#define GFXMMU_LUT25L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut25l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT25L_FVB_SHIFT		8
#define GFXMMU_LUT25L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut25l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT25L_EN Enable **/
#define GFXMMU_LUT25L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut25h LUT25H Graphic MMU LUT entry 25 high
@{*/


#define GFXMMU_LUT25H_LO_SHIFT		4
#define GFXMMU_LUT25H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut25h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut26l LUT26L Graphic MMU LUT entry 26 low
@{*/


#define GFXMMU_LUT26L_LVB_SHIFT		16
#define GFXMMU_LUT26L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut26l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT26L_FVB_SHIFT		8
#define GFXMMU_LUT26L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut26l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT26L_EN Enable **/
#define GFXMMU_LUT26L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut26h LUT26H Graphic MMU LUT entry 26 high
@{*/


#define GFXMMU_LUT26H_LO_SHIFT		4
#define GFXMMU_LUT26H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut26h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut27l LUT27L Graphic MMU LUT entry 27 low
@{*/


#define GFXMMU_LUT27L_LVB_SHIFT		16
#define GFXMMU_LUT27L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut27l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT27L_FVB_SHIFT		8
#define GFXMMU_LUT27L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut27l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT27L_EN Enable **/
#define GFXMMU_LUT27L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut27h LUT27H Graphic MMU LUT entry 27 high
@{*/


#define GFXMMU_LUT27H_LO_SHIFT		4
#define GFXMMU_LUT27H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut27h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut28l LUT28L Graphic MMU LUT entry 28 low
@{*/


#define GFXMMU_LUT28L_LVB_SHIFT		16
#define GFXMMU_LUT28L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut28l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT28L_FVB_SHIFT		8
#define GFXMMU_LUT28L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut28l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT28L_EN Enable **/
#define GFXMMU_LUT28L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut28h LUT28H Graphic MMU LUT entry 28 high
@{*/


#define GFXMMU_LUT28H_LO_SHIFT		4
#define GFXMMU_LUT28H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut28h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut29l LUT29L Graphic MMU LUT entry 29 low
@{*/


#define GFXMMU_LUT29L_LVB_SHIFT		16
#define GFXMMU_LUT29L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut29l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT29L_FVB_SHIFT		8
#define GFXMMU_LUT29L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut29l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT29L_EN Enable **/
#define GFXMMU_LUT29L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut29h LUT29H Graphic MMU LUT entry 29 high
@{*/


#define GFXMMU_LUT29H_LO_SHIFT		4
#define GFXMMU_LUT29H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut29h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut30l LUT30L Graphic MMU LUT entry 30 low
@{*/


#define GFXMMU_LUT30L_LVB_SHIFT		16
#define GFXMMU_LUT30L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut30l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT30L_FVB_SHIFT		8
#define GFXMMU_LUT30L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut30l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT30L_EN Enable **/
#define GFXMMU_LUT30L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut30h LUT30H Graphic MMU LUT entry 30 high
@{*/


#define GFXMMU_LUT30H_LO_SHIFT		4
#define GFXMMU_LUT30H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut30h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut31l LUT31L Graphic MMU LUT entry 31 low
@{*/


#define GFXMMU_LUT31L_LVB_SHIFT		16
#define GFXMMU_LUT31L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut31l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT31L_FVB_SHIFT		8
#define GFXMMU_LUT31L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut31l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT31L_EN Enable **/
#define GFXMMU_LUT31L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut31h LUT31H Graphic MMU LUT entry 31 high
@{*/


#define GFXMMU_LUT31H_LO_SHIFT		4
#define GFXMMU_LUT31H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut31h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut32l LUT32L Graphic MMU LUT entry 32 low
@{*/


#define GFXMMU_LUT32L_LVB_SHIFT		16
#define GFXMMU_LUT32L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut32l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT32L_FVB_SHIFT		8
#define GFXMMU_LUT32L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut32l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT32L_EN Enable **/
#define GFXMMU_LUT32L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut32h LUT32H Graphic MMU LUT entry 32 high
@{*/


#define GFXMMU_LUT32H_LO_SHIFT		4
#define GFXMMU_LUT32H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut32h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut33l LUT33L Graphic MMU LUT entry 33 low
@{*/


#define GFXMMU_LUT33L_LVB_SHIFT		16
#define GFXMMU_LUT33L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut33l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT33L_FVB_SHIFT		8
#define GFXMMU_LUT33L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut33l_fvb FVB First Valid Block
@{*/
/**@}*/

