grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT33L_EN Enable **/
#define GFXMMU_LUT33L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut33h LUT33H Graphic MMU LUT entry 33 high
@{*/


#define GFXMMU_LUT33H_LO_SHIFT		4
#define GFXMMU_LUT33H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut33h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut34l LUT34L Graphic MMU LUT entry 34 low
@{*/


#define GFXMMU_LUT34L_LVB_SHIFT		16
#define GFXMMU_LUT34L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut34l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT34L_FVB_SHIFT		8
#define GFXMMU_LUT34L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut34l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT34L_EN Enable **/
#define GFXMMU_LUT34L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut34h LUT34H Graphic MMU LUT entry 34 high
@{*/


#define GFXMMU_LUT34H_LO_SHIFT		4
#define GFXMMU_LUT34H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut34h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut35l LUT35L Graphic MMU LUT entry 35 low
@{*/


#define GFXMMU_LUT35L_LVB_SHIFT		16
#define GFXMMU_LUT35L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut35l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT35L_FVB_SHIFT		8
#define GFXMMU_LUT35L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut35l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT35L_EN Enable **/
#define GFXMMU_LUT35L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut35h LUT35H Graphic MMU LUT entry 35 high
@{*/


#define GFXMMU_LUT35H_LO_SHIFT		4
#define GFXMMU_LUT35H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut35h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut36l LUT36L Graphic MMU LUT entry 36 low
@{*/


#define GFXMMU_LUT36L_LVB_SHIFT		16
#define GFXMMU_LUT36L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut36l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT36L_FVB_SHIFT		8
#define GFXMMU_LUT36L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut36l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT36L_EN Enable **/
#define GFXMMU_LUT36L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut36h LUT36H Graphic MMU LUT entry 36 high
@{*/


#define GFXMMU_LUT36H_LO_SHIFT		4
#define GFXMMU_LUT36H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut36h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut37l LUT37L Graphic MMU LUT entry 37 low
@{*/


#define GFXMMU_LUT37L_LVB_SHIFT		16
#define GFXMMU_LUT37L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut37l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT37L_FVB_SHIFT		8
#define GFXMMU_LUT37L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut37l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT37L_EN Enable **/
#define GFXMMU_LUT37L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut37h LUT37H Graphic MMU LUT entry 37 high
@{*/


#define GFXMMU_LUT37H_LO_SHIFT		4
#define GFXMMU_LUT37H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut37h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut38l LUT38L Graphic MMU LUT entry 38 low
@{*/


#define GFXMMU_LUT38L_LVB_SHIFT		16
#define GFXMMU_LUT38L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut38l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT38L_FVB_SHIFT		8
#define GFXMMU_LUT38L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut38l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT38L_EN Enable **/
#define GFXMMU_LUT38L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut38h LUT38H Graphic MMU LUT entry 38 high
@{*/


#define GFXMMU_LUT38H_LO_SHIFT		4
#define GFXMMU_LUT38H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut38h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut39l LUT39L Graphic MMU LUT entry 39 low
@{*/


#define GFXMMU_LUT39L_LVB_SHIFT		16
#define GFXMMU_LUT39L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut39l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT39L_FVB_SHIFT		8
#define GFXMMU_LUT39L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut39l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT39L_EN Enable **/
#define GFXMMU_LUT39L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut39h LUT39H Graphic MMU LUT entry 39 high
@{*/


#define GFXMMU_LUT39H_LO_SHIFT		4
#define GFXMMU_LUT39H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut39h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut40l LUT40L Graphic MMU LUT entry 40 low
@{*/


#define GFXMMU_LUT40L_LVB_SHIFT		16
#define GFXMMU_LUT40L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut40l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT40L_FVB_SHIFT		8
#define GFXMMU_LUT40L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut40l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT40L_EN Enable **/
#define GFXMMU_LUT40L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut40h LUT40H Graphic MMU LUT entry 40 high
@{*/


#define GFXMMU_LUT40H_LO_SHIFT		4
#define GFXMMU_LUT40H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut40h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut41l LUT41L Graphic MMU LUT entry 41 low
@{*/


#define GFXMMU_LUT41L_LVB_SHIFT		16
#define GFXMMU_LUT41L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut41l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT41L_FVB_SHIFT		8
#define GFXMMU_LUT41L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut41l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT41L_EN Enable **/
#define GFXMMU_LUT41L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut41h LUT41H Graphic MMU LUT entry 41 high
@{*/


#define GFXMMU_LUT41H_LO_SHIFT		4
#define GFXMMU_LUT41H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut41h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut42l LUT42L Graphic MMU LUT entry 42 low
@{*/


#define GFXMMU_LUT42L_LVB_SHIFT		16
#define GFXMMU_LUT42L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut42l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT42L_FVB_SHIFT		8
#define GFXMMU_LUT42L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut42l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT42L_EN Enable **/
#define GFXMMU_LUT42L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut42h LUT42H Graphic MMU LUT entry 42 high
@{*/


#define GFXMMU_LUT42H_LO_SHIFT		4
#define GFXMMU_LUT42H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut42h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut43l LUT43L Graphic MMU LUT entry 43 low
@{*/


