grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT43L_LVB_SHIFT		16
#define GFXMMU_LUT43L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut43l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT43L_FVB_SHIFT		8
#define GFXMMU_LUT43L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut43l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT43L_EN Enable **/
#define GFXMMU_LUT43L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut43h LUT43H Graphic MMU LUT entry 43 high
@{*/


#define GFXMMU_LUT43H_LO_SHIFT		4
#define GFXMMU_LUT43H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut43h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut44l LUT44L Graphic MMU LUT entry 44 low
@{*/


#define GFXMMU_LUT44L_LVB_SHIFT		16
#define GFXMMU_LUT44L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut44l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT44L_FVB_SHIFT		8
#define GFXMMU_LUT44L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut44l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT44L_EN Enable **/
#define GFXMMU_LUT44L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut44h LUT44H Graphic MMU LUT entry 44 high
@{*/


#define GFXMMU_LUT44H_LO_SHIFT		4
#define GFXMMU_LUT44H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut44h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut45l LUT45L Graphic MMU LUT entry 45 low
@{*/


#define GFXMMU_LUT45L_LVB_SHIFT		16
#define GFXMMU_LUT45L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut45l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT45L_FVB_SHIFT		8
#define GFXMMU_LUT45L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut45l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT45L_EN Enable **/
#define GFXMMU_LUT45L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut45h LUT45H Graphic MMU LUT entry 45 high
@{*/


#define GFXMMU_LUT45H_LO_SHIFT		4
#define GFXMMU_LUT45H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut45h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut46l LUT46L Graphic MMU LUT entry 46 low
@{*/


#define GFXMMU_LUT46L_LVB_SHIFT		16
#define GFXMMU_LUT46L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut46l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT46L_FVB_SHIFT		8
#define GFXMMU_LUT46L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut46l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT46L_EN Enable **/
#define GFXMMU_LUT46L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut46h LUT46H Graphic MMU LUT entry 46 high
@{*/


#define GFXMMU_LUT46H_LO_SHIFT		4
#define GFXMMU_LUT46H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut46h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut47l LUT47L Graphic MMU LUT entry 47 low
@{*/


#define GFXMMU_LUT47L_LVB_SHIFT		16
#define GFXMMU_LUT47L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut47l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT47L_FVB_SHIFT		8
#define GFXMMU_LUT47L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut47l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT47L_EN Enable **/
#define GFXMMU_LUT47L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut47h LUT47H Graphic MMU LUT entry 47 high
@{*/


#define GFXMMU_LUT47H_LO_SHIFT		4
#define GFXMMU_LUT47H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut47h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut48l LUT48L Graphic MMU LUT entry 48 low
@{*/


#define GFXMMU_LUT48L_LVB_SHIFT		16
#define GFXMMU_LUT48L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut48l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT48L_FVB_SHIFT		8
#define GFXMMU_LUT48L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut48l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT48L_EN Enable **/
#define GFXMMU_LUT48L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut48h LUT48H Graphic MMU LUT entry 48 high
@{*/


#define GFXMMU_LUT48H_LO_SHIFT		4
#define GFXMMU_LUT48H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut48h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut49l LUT49L Graphic MMU LUT entry 49 low
@{*/


#define GFXMMU_LUT49L_LVB_SHIFT		16
#define GFXMMU_LUT49L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut49l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT49L_FVB_SHIFT		8
#define GFXMMU_LUT49L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut49l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT49L_EN Enable **/
#define GFXMMU_LUT49L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut49h LUT49H Graphic MMU LUT entry 49 high
@{*/


#define GFXMMU_LUT49H_LO_SHIFT		4
#define GFXMMU_LUT49H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut49h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut50l LUT50L Graphic MMU LUT entry 50 low
@{*/


#define GFXMMU_LUT50L_LVB_SHIFT		16
#define GFXMMU_LUT50L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut50l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT50L_FVB_SHIFT		8
#define GFXMMU_LUT50L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut50l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT50L_EN Enable **/
#define GFXMMU_LUT50L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut50h LUT50H Graphic MMU LUT entry 50 high
@{*/


#define GFXMMU_LUT50H_LO_SHIFT		4
#define GFXMMU_LUT50H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut50h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut51l LUT51L Graphic MMU LUT entry 51 low
@{*/


#define GFXMMU_LUT51L_LVB_SHIFT		16
#define GFXMMU_LUT51L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut51l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT51L_FVB_SHIFT		8
#define GFXMMU_LUT51L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut51l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT51L_EN Enable **/
#define GFXMMU_LUT51L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut51h LUT51H Graphic MMU LUT entry 51 high
@{*/


#define GFXMMU_LUT51H_LO_SHIFT		4
#define GFXMMU_LUT51H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut51h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut52l LUT52L Graphic MMU LUT entry 52 low
@{*/


#define GFXMMU_LUT52L_LVB_SHIFT		16
#define GFXMMU_LUT52L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut52l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT52L_FVB_SHIFT		8
#define GFXMMU_LUT52L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut52l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT52L_EN Enable **/
#define GFXMMU_LUT52L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut52h LUT52H Graphic MMU LUT entry 52 high
@{*/


#define GFXMMU_LUT52H_LO_SHIFT		4
#define GFXMMU_LUT52H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut52h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

