grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut53l LUT53L Graphic MMU LUT entry 53 low
@{*/


#define GFXMMU_LUT53L_LVB_SHIFT		16
#define GFXMMU_LUT53L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut53l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT53L_FVB_SHIFT		8
#define GFXMMU_LUT53L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut53l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT53L_EN Enable **/
#define GFXMMU_LUT53L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut53h LUT53H Graphic MMU LUT entry 53 high
@{*/


#define GFXMMU_LUT53H_LO_SHIFT		4
#define GFXMMU_LUT53H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut53h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut54l LUT54L Graphic MMU LUT entry 54 low
@{*/


#define GFXMMU_LUT54L_LVB_SHIFT		16
#define GFXMMU_LUT54L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut54l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT54L_FVB_SHIFT		8
#define GFXMMU_LUT54L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut54l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT54L_EN Enable **/
#define GFXMMU_LUT54L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut54h LUT54H Graphic MMU LUT entry 54 high
@{*/


#define GFXMMU_LUT54H_LO_SHIFT		4
#define GFXMMU_LUT54H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut54h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut55l LUT55L Graphic MMU LUT entry 55 low
@{*/


#define GFXMMU_LUT55L_LVB_SHIFT		16
#define GFXMMU_LUT55L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut55l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT55L_FVB_SHIFT		8
#define GFXMMU_LUT55L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut55l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT55L_EN Enable **/
#define GFXMMU_LUT55L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut55h LUT55H Graphic MMU LUT entry 55 high
@{*/


#define GFXMMU_LUT55H_LO_SHIFT		4
#define GFXMMU_LUT55H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut55h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut56l LUT56L Graphic MMU LUT entry 56 low
@{*/


#define GFXMMU_LUT56L_LVB_SHIFT		16
#define GFXMMU_LUT56L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut56l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT56L_FVB_SHIFT		8
#define GFXMMU_LUT56L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut56l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT56L_EN Enable **/
#define GFXMMU_LUT56L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut56h LUT56H Graphic MMU LUT entry 56 high
@{*/


#define GFXMMU_LUT56H_LO_SHIFT		4
#define GFXMMU_LUT56H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut56h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut57l LUT57L Graphic MMU LUT entry 57 low
@{*/


#define GFXMMU_LUT57L_LVB_SHIFT		16
#define GFXMMU_LUT57L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut57l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT57L_FVB_SHIFT		8
#define GFXMMU_LUT57L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut57l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT57L_EN Enable **/
#define GFXMMU_LUT57L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut57h LUT57H Graphic MMU LUT entry 57 high
@{*/


#define GFXMMU_LUT57H_LO_SHIFT		4
#define GFXMMU_LUT57H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut57h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut58l LUT58L Graphic MMU LUT entry 58 low
@{*/


#define GFXMMU_LUT58L_LVB_SHIFT		16
#define GFXMMU_LUT58L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut58l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT58L_FVB_SHIFT		8
#define GFXMMU_LUT58L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut58l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT58L_EN Enable **/
#define GFXMMU_LUT58L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut58h LUT58H Graphic MMU LUT entry 58 high
@{*/


#define GFXMMU_LUT58H_LO_SHIFT		4
#define GFXMMU_LUT58H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut58h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut59l LUT59L Graphic MMU LUT entry 59 low
@{*/


#define GFXMMU_LUT59L_LVB_SHIFT		16
#define GFXMMU_LUT59L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut59l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT59L_FVB_SHIFT		8
#define GFXMMU_LUT59L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut59l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT59L_EN Enable **/
#define GFXMMU_LUT59L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut59h LUT59H Graphic MMU LUT entry 59 high
@{*/


#define GFXMMU_LUT59H_LO_SHIFT		4
#define GFXMMU_LUT59H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut59h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut60l LUT60L Graphic MMU LUT entry 60 low
@{*/


#define GFXMMU_LUT60L_LVB_SHIFT		16
#define GFXMMU_LUT60L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut60l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT60L_FVB_SHIFT		8
#define GFXMMU_LUT60L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut60l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT60L_EN Enable **/
#define GFXMMU_LUT60L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut60h LUT60H Graphic MMU LUT entry 60 high
@{*/


#define GFXMMU_LUT60H_LO_SHIFT		4
#define GFXMMU_LUT60H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut60h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut61l LUT61L Graphic MMU LUT entry 61 low
@{*/


#define GFXMMU_LUT61L_LVB_SHIFT		16
#define GFXMMU_LUT61L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut61l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT61L_FVB_SHIFT		8
#define GFXMMU_LUT61L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut61l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT61L_EN Enable **/
#define GFXMMU_LUT61L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut61h LUT61H Graphic MMU LUT entry 61 high
@{*/


#define GFXMMU_LUT61H_LO_SHIFT		4
#define GFXMMU_LUT61H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut61h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut62l LUT62L Graphic MMU LUT entry 62 low
@{*/


#define GFXMMU_LUT62L_LVB_SHIFT		16
#define GFXMMU_LUT62L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut62l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT62L_FVB_SHIFT		8
#define GFXMMU_LUT62L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut62l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT62L_EN Enable **/
#define GFXMMU_LUT62L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut62h LUT62H Graphic MMU LUT entry 62 high
@{*/


