grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT62H_LO_SHIFT		4
#define GFXMMU_LUT62H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut62h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut63l LUT63L Graphic MMU LUT entry 63 low
@{*/


#define GFXMMU_LUT63L_LVB_SHIFT		16
#define GFXMMU_LUT63L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut63l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT63L_FVB_SHIFT		8
#define GFXMMU_LUT63L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut63l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT63L_EN Enable **/
#define GFXMMU_LUT63L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut63h LUT63H Graphic MMU LUT entry 63 high
@{*/


#define GFXMMU_LUT63H_LO_SHIFT		4
#define GFXMMU_LUT63H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut63h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut64l LUT64L Graphic MMU LUT entry 64 low
@{*/


#define GFXMMU_LUT64L_LVB_SHIFT		16
#define GFXMMU_LUT64L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut64l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT64L_FVB_SHIFT		8
#define GFXMMU_LUT64L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut64l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT64L_EN Enable **/
#define GFXMMU_LUT64L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut64h LUT64H Graphic MMU LUT entry 64 high
@{*/


#define GFXMMU_LUT64H_LO_SHIFT		4
#define GFXMMU_LUT64H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut64h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut65l LUT65L Graphic MMU LUT entry 65 low
@{*/


#define GFXMMU_LUT65L_LVB_SHIFT		16
#define GFXMMU_LUT65L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut65l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT65L_FVB_SHIFT		8
#define GFXMMU_LUT65L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut65l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT65L_EN Enable **/
#define GFXMMU_LUT65L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut65h LUT65H Graphic MMU LUT entry 65 high
@{*/


#define GFXMMU_LUT65H_LO_SHIFT		4
#define GFXMMU_LUT65H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut65h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut66l LUT66L Graphic MMU LUT entry 66 low
@{*/


#define GFXMMU_LUT66L_LVB_SHIFT		16
#define GFXMMU_LUT66L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut66l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT66L_FVB_SHIFT		8
#define GFXMMU_LUT66L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut66l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT66L_EN Enable **/
#define GFXMMU_LUT66L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut66h LUT66H Graphic MMU LUT entry 66 high
@{*/


#define GFXMMU_LUT66H_LO_SHIFT		4
#define GFXMMU_LUT66H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut66h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut67l LUT67L Graphic MMU LUT entry 67 low
@{*/


#define GFXMMU_LUT67L_LVB_SHIFT		16
#define GFXMMU_LUT67L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut67l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT67L_FVB_SHIFT		8
#define GFXMMU_LUT67L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut67l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT67L_EN Enable **/
#define GFXMMU_LUT67L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut67h LUT67H Graphic MMU LUT entry 67 high
@{*/


#define GFXMMU_LUT67H_LO_SHIFT		4
#define GFXMMU_LUT67H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut67h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut68l LUT68L Graphic MMU LUT entry 68 low
@{*/


#define GFXMMU_LUT68L_LVB_SHIFT		16
#define GFXMMU_LUT68L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut68l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT68L_FVB_SHIFT		8
#define GFXMMU_LUT68L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut68l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT68L_EN Enable **/
#define GFXMMU_LUT68L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut68h LUT68H Graphic MMU LUT entry 68 high
@{*/


#define GFXMMU_LUT68H_LO_SHIFT		4
#define GFXMMU_LUT68H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut68h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut69l LUT69L Graphic MMU LUT entry 69 low
@{*/


#define GFXMMU_LUT69L_LVB_SHIFT		16
#define GFXMMU_LUT69L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut69l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT69L_FVB_SHIFT		8
#define GFXMMU_LUT69L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut69l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT69L_EN Enable **/
#define GFXMMU_LUT69L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut69h LUT69H Graphic MMU LUT entry 69 high
@{*/


#define GFXMMU_LUT69H_LO_SHIFT		4
#define GFXMMU_LUT69H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut69h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut70l LUT70L Graphic MMU LUT entry 70 low
@{*/


#define GFXMMU_LUT70L_LVB_SHIFT		16
#define GFXMMU_LUT70L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut70l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT70L_FVB_SHIFT		8
#define GFXMMU_LUT70L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut70l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT70L_EN Enable **/
#define GFXMMU_LUT70L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut70h LUT70H Graphic MMU LUT entry 70 high
@{*/


#define GFXMMU_LUT70H_LO_SHIFT		4
#define GFXMMU_LUT70H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut70h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut71l LUT71L Graphic MMU LUT entry 71 low
@{*/


#define GFXMMU_LUT71L_LVB_SHIFT		16
#define GFXMMU_LUT71L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut71l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT71L_FVB_SHIFT		8
#define GFXMMU_LUT71L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut71l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT71L_EN Enable **/
#define GFXMMU_LUT71L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut71h LUT71H Graphic MMU LUT entry 71 high
@{*/


#define GFXMMU_LUT71H_LO_SHIFT		4
#define GFXMMU_LUT71H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut71h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut72l LUT72L Graphic MMU LUT entry 72 low
@{*/


#define GFXMMU_LUT72L_LVB_SHIFT		16
#define GFXMMU_LUT72L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut72l_lvb LVB Last Valid Block
@{*/
/**@}*/


