grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT72L_FVB_SHIFT		8
#define GFXMMU_LUT72L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut72l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT72L_EN Enable **/
#define GFXMMU_LUT72L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut72h LUT72H Graphic MMU LUT entry 72 high
@{*/


#define GFXMMU_LUT72H_LO_SHIFT		4
#define GFXMMU_LUT72H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut72h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut73l LUT73L Graphic MMU LUT entry 73 low
@{*/


#define GFXMMU_LUT73L_LVB_SHIFT		16
#define GFXMMU_LUT73L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut73l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT73L_FVB_SHIFT		8
#define GFXMMU_LUT73L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut73l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT73L_EN Enable **/
#define GFXMMU_LUT73L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut73h LUT73H Graphic MMU LUT entry 73 high
@{*/


#define GFXMMU_LUT73H_LO_SHIFT		4
#define GFXMMU_LUT73H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut73h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut74l LUT74L Graphic MMU LUT entry 74 low
@{*/


#define GFXMMU_LUT74L_LVB_SHIFT		16
#define GFXMMU_LUT74L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut74l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT74L_FVB_SHIFT		8
#define GFXMMU_LUT74L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut74l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT74L_EN Enable **/
#define GFXMMU_LUT74L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut74h LUT74H Graphic MMU LUT entry 74 high
@{*/


#define GFXMMU_LUT74H_LO_SHIFT		4
#define GFXMMU_LUT74H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut74h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut75l LUT75L Graphic MMU LUT entry 75 low
@{*/


#define GFXMMU_LUT75L_LVB_SHIFT		16
#define GFXMMU_LUT75L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut75l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT75L_FVB_SHIFT		8
#define GFXMMU_LUT75L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut75l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT75L_EN Enable **/
#define GFXMMU_LUT75L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut75h LUT75H Graphic MMU LUT entry 75 high
@{*/


#define GFXMMU_LUT75H_LO_SHIFT		4
#define GFXMMU_LUT75H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut75h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut76l LUT76L Graphic MMU LUT entry 76 low
@{*/


#define GFXMMU_LUT76L_LVB_SHIFT		16
#define GFXMMU_LUT76L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut76l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT76L_FVB_SHIFT		8
#define GFXMMU_LUT76L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut76l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT76L_EN Enable **/
#define GFXMMU_LUT76L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut76h LUT76H Graphic MMU LUT entry 76 high
@{*/


#define GFXMMU_LUT76H_LO_SHIFT		4
#define GFXMMU_LUT76H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut76h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut77l LUT77L Graphic MMU LUT entry 77 low
@{*/


#define GFXMMU_LUT77L_LVB_SHIFT		16
#define GFXMMU_LUT77L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut77l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT77L_FVB_SHIFT		8
#define GFXMMU_LUT77L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut77l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT77L_EN Enable **/
#define GFXMMU_LUT77L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut77h LUT77H Graphic MMU LUT entry 77 high
@{*/


#define GFXMMU_LUT77H_LO_SHIFT		4
#define GFXMMU_LUT77H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut77h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut78l LUT78L Graphic MMU LUT entry 78 low
@{*/


#define GFXMMU_LUT78L_LVB_SHIFT		16
#define GFXMMU_LUT78L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut78l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT78L_FVB_SHIFT		8
#define GFXMMU_LUT78L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut78l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT78L_EN Enable **/
#define GFXMMU_LUT78L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut78h LUT78H Graphic MMU LUT entry 78 high
@{*/


#define GFXMMU_LUT78H_LO_SHIFT		4
#define GFXMMU_LUT78H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut78h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut79l LUT79L Graphic MMU LUT entry 79 low
@{*/


#define GFXMMU_LUT79L_LVB_SHIFT		16
#define GFXMMU_LUT79L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut79l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT79L_FVB_SHIFT		8
#define GFXMMU_LUT79L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut79l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT79L_EN Enable **/
#define GFXMMU_LUT79L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut79h LUT79H Graphic MMU LUT entry 79 high
@{*/


#define GFXMMU_LUT79H_LO_SHIFT		4
#define GFXMMU_LUT79H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut79h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut80l LUT80L Graphic MMU LUT entry 80 low
@{*/


#define GFXMMU_LUT80L_LVB_SHIFT		16
#define GFXMMU_LUT80L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut80l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT80L_FVB_SHIFT		8
#define GFXMMU_LUT80L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut80l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT80L_EN Enable **/
#define GFXMMU_LUT80L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut80h LUT80H Graphic MMU LUT entry 80 high
@{*/


#define GFXMMU_LUT80H_LO_SHIFT		4
#define GFXMMU_LUT80H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut80h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut81l LUT81L Graphic MMU LUT entry 81 low
@{*/


#define GFXMMU_LUT81L_LVB_SHIFT		16
#define GFXMMU_LUT81L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut81l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT81L_FVB_SHIFT		8
#define GFXMMU_LUT81L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut81l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT81L_EN Enable **/
#define GFXMMU_LUT81L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut81h LUT81H Graphic MMU LUT entry 81 high
@{*/


#define GFXMMU_LUT81H_LO_SHIFT		4
#define GFXMMU_LUT81H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut81h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut82l LUT82L Graphic MMU LUT entry 82 low
@{*/


