grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT82L_LVB_SHIFT		16
#define GFXMMU_LUT82L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut82l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT82L_FVB_SHIFT		8
#define GFXMMU_LUT82L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut82l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT82L_EN Enable **/
#define GFXMMU_LUT82L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut82h LUT82H Graphic MMU LUT entry 82 high
@{*/


#define GFXMMU_LUT82H_LO_SHIFT		4
#define GFXMMU_LUT82H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut82h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut83l LUT83L Graphic MMU LUT entry 83 low
@{*/


#define GFXMMU_LUT83L_LVB_SHIFT		16
#define GFXMMU_LUT83L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut83l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT83L_FVB_SHIFT		8
#define GFXMMU_LUT83L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut83l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT83L_EN Enable **/
#define GFXMMU_LUT83L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut83h LUT83H Graphic MMU LUT entry 83 high
@{*/


#define GFXMMU_LUT83H_LO_SHIFT		4
#define GFXMMU_LUT83H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut83h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut84l LUT84L Graphic MMU LUT entry 84 low
@{*/


#define GFXMMU_LUT84L_LVB_SHIFT		16
#define GFXMMU_LUT84L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut84l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT84L_FVB_SHIFT		8
#define GFXMMU_LUT84L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut84l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT84L_EN Enable **/
#define GFXMMU_LUT84L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut84h LUT84H Graphic MMU LUT entry 84 high
@{*/


#define GFXMMU_LUT84H_LO_SHIFT		4
#define GFXMMU_LUT84H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut84h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut85l LUT85L Graphic MMU LUT entry 85 low
@{*/


#define GFXMMU_LUT85L_LVB_SHIFT		16
#define GFXMMU_LUT85L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut85l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT85L_FVB_SHIFT		8
#define GFXMMU_LUT85L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut85l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT85L_EN Enable **/
#define GFXMMU_LUT85L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut85h LUT85H Graphic MMU LUT entry 85 high
@{*/


#define GFXMMU_LUT85H_LO_SHIFT		4
#define GFXMMU_LUT85H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut85h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut86l LUT86L Graphic MMU LUT entry 86 low
@{*/


#define GFXMMU_LUT86L_LVB_SHIFT		16
#define GFXMMU_LUT86L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut86l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT86L_FVB_SHIFT		8
#define GFXMMU_LUT86L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut86l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT86L_EN Enable **/
#define GFXMMU_LUT86L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut86h LUT86H Graphic MMU LUT entry 86 high
@{*/


#define GFXMMU_LUT86H_LO_SHIFT		4
#define GFXMMU_LUT86H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut86h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut87l LUT87L Graphic MMU LUT entry 87 low
@{*/


#define GFXMMU_LUT87L_LVB_SHIFT		16
#define GFXMMU_LUT87L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut87l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT87L_FVB_SHIFT		8
#define GFXMMU_LUT87L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut87l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT87L_EN Enable **/
#define GFXMMU_LUT87L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut87h LUT87H Graphic MMU LUT entry 87 high
@{*/


#define GFXMMU_LUT87H_LO_SHIFT		4
#define GFXMMU_LUT87H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut87h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut88l LUT88L Graphic MMU LUT entry 88 low
@{*/


#define GFXMMU_LUT88L_LVB_SHIFT		16
#define GFXMMU_LUT88L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut88l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT88L_FVB_SHIFT		8
#define GFXMMU_LUT88L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut88l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT88L_EN Enable **/
#define GFXMMU_LUT88L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut88h LUT88H Graphic MMU LUT entry 88 high
@{*/


#define GFXMMU_LUT88H_LO_SHIFT		4
#define GFXMMU_LUT88H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut88h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut89l LUT89L Graphic MMU LUT entry 89 low
@{*/


#define GFXMMU_LUT89L_LVB_SHIFT		16
#define GFXMMU_LUT89L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut89l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT89L_FVB_SHIFT		8
#define GFXMMU_LUT89L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut89l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT89L_EN Enable **/
#define GFXMMU_LUT89L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut89h LUT89H Graphic MMU LUT entry 89 high
@{*/


#define GFXMMU_LUT89H_LO_SHIFT		4
#define GFXMMU_LUT89H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut89h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut90l LUT90L Graphic MMU LUT entry 90 low
@{*/


#define GFXMMU_LUT90L_LVB_SHIFT		16
#define GFXMMU_LUT90L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut90l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT90L_FVB_SHIFT		8
#define GFXMMU_LUT90L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut90l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT90L_EN Enable **/
#define GFXMMU_LUT90L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut90h LUT90H Graphic MMU LUT entry 90 high
@{*/


#define GFXMMU_LUT90H_LO_SHIFT		4
#define GFXMMU_LUT90H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut90h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut91l LUT91L Graphic MMU LUT entry 91 low
@{*/


#define GFXMMU_LUT91L_LVB_SHIFT		16
#define GFXMMU_LUT91L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut91l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT91L_FVB_SHIFT		8
#define GFXMMU_LUT91L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut91l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT91L_EN Enable **/
#define GFXMMU_LUT91L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut91h LUT91H Graphic MMU LUT entry 91 high
@{*/


#define GFXMMU_LUT91H_LO_SHIFT		4
#define GFXMMU_LUT91H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut91h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

