grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut92l LUT92L Graphic MMU LUT entry 92 low
@{*/


#define GFXMMU_LUT92L_LVB_SHIFT		16
#define GFXMMU_LUT92L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut92l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT92L_FVB_SHIFT		8
#define GFXMMU_LUT92L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut92l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT92L_EN Enable **/
#define GFXMMU_LUT92L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut92h LUT92H Graphic MMU LUT entry 92 high
@{*/


#define GFXMMU_LUT92H_LO_SHIFT		4
#define GFXMMU_LUT92H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut92h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut93l LUT93L Graphic MMU LUT entry 93 low
@{*/


#define GFXMMU_LUT93L_LVB_SHIFT		16
#define GFXMMU_LUT93L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut93l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT93L_FVB_SHIFT		8
#define GFXMMU_LUT93L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut93l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT93L_EN Enable **/
#define GFXMMU_LUT93L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut93h LUT93H Graphic MMU LUT entry 93 high
@{*/


#define GFXMMU_LUT93H_LO_SHIFT		4
#define GFXMMU_LUT93H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut93h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut94l LUT94L Graphic MMU LUT entry 94 low
@{*/


#define GFXMMU_LUT94L_LVB_SHIFT		16
#define GFXMMU_LUT94L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut94l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT94L_FVB_SHIFT		8
#define GFXMMU_LUT94L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut94l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT94L_EN Enable **/
#define GFXMMU_LUT94L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut94h LUT94H Graphic MMU LUT entry 94 high
@{*/


#define GFXMMU_LUT94H_LO_SHIFT		4
#define GFXMMU_LUT94H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut94h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut95l LUT95L Graphic MMU LUT entry 95 low
@{*/


#define GFXMMU_LUT95L_LVB_SHIFT		16
#define GFXMMU_LUT95L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut95l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT95L_FVB_SHIFT		8
#define GFXMMU_LUT95L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut95l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT95L_EN Enable **/
#define GFXMMU_LUT95L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut95h LUT95H Graphic MMU LUT entry 95 high
@{*/


#define GFXMMU_LUT95H_LO_SHIFT		4
#define GFXMMU_LUT95H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut95h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut96l LUT96L Graphic MMU LUT entry 96 low
@{*/


#define GFXMMU_LUT96L_LVB_SHIFT		16
#define GFXMMU_LUT96L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut96l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT96L_FVB_SHIFT		8
#define GFXMMU_LUT96L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut96l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT96L_EN Enable **/
#define GFXMMU_LUT96L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut96h LUT96H Graphic MMU LUT entry 96 high
@{*/


#define GFXMMU_LUT96H_LO_SHIFT		4
#define GFXMMU_LUT96H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut96h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut97l LUT97L Graphic MMU LUT entry 97 low
@{*/


#define GFXMMU_LUT97L_LVB_SHIFT		16
#define GFXMMU_LUT97L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut97l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT97L_FVB_SHIFT		8
#define GFXMMU_LUT97L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut97l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT97L_EN Enable **/
#define GFXMMU_LUT97L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut97h LUT97H Graphic MMU LUT entry 97 high
@{*/


#define GFXMMU_LUT97H_LO_SHIFT		4
#define GFXMMU_LUT97H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut97h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut98l LUT98L Graphic MMU LUT entry 98 low
@{*/


#define GFXMMU_LUT98L_LVB_SHIFT		16
#define GFXMMU_LUT98L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut98l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT98L_FVB_SHIFT		8
#define GFXMMU_LUT98L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut98l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT98L_EN Enable **/
#define GFXMMU_LUT98L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut98h LUT98H Graphic MMU LUT entry 98 high
@{*/


#define GFXMMU_LUT98H_LO_SHIFT		4
#define GFXMMU_LUT98H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut98h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut99l LUT99L Graphic MMU LUT entry 99 low
@{*/


#define GFXMMU_LUT99L_LVB_SHIFT		16
#define GFXMMU_LUT99L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut99l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT99L_FVB_SHIFT		8
#define GFXMMU_LUT99L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut99l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT99L_EN Enable **/
#define GFXMMU_LUT99L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut99h LUT99H Graphic MMU LUT entry 99 high
@{*/


#define GFXMMU_LUT99H_LO_SHIFT		4
#define GFXMMU_LUT99H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut99h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut100l LUT100L Graphic MMU LUT entry 100 low
@{*/


#define GFXMMU_LUT100L_LVB_SHIFT		16
#define GFXMMU_LUT100L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut100l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT100L_FVB_SHIFT		8
#define GFXMMU_LUT100L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut100l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT100L_EN Enable **/
#define GFXMMU_LUT100L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut100h LUT100H Graphic MMU LUT entry 100 high
@{*/


#define GFXMMU_LUT100H_LO_SHIFT		4
#define GFXMMU_LUT100H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut100h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut101l LUT101L Graphic MMU LUT entry 101 low
@{*/


#define GFXMMU_LUT101L_LVB_SHIFT		16
#define GFXMMU_LUT101L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut101l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT101L_FVB_SHIFT		8
#define GFXMMU_LUT101L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut101l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT101L_EN Enable **/
#define GFXMMU_LUT101L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut101h LUT101H Graphic MMU LUT entry 101 high
@{*/


