grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT101H_LO_SHIFT		4
#define GFXMMU_LUT101H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut101h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut102l LUT102L Graphic MMU LUT entry 102 low
@{*/


#define GFXMMU_LUT102L_LVB_SHIFT		16
#define GFXMMU_LUT102L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut102l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT102L_FVB_SHIFT		8
#define GFXMMU_LUT102L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut102l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT102L_EN Enable **/
#define GFXMMU_LUT102L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut102h LUT102H Graphic MMU LUT entry 102 high
@{*/


#define GFXMMU_LUT102H_LO_SHIFT		4
#define GFXMMU_LUT102H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut102h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut103l LUT103L Graphic MMU LUT entry 103 low
@{*/


#define GFXMMU_LUT103L_LVB_SHIFT		16
#define GFXMMU_LUT103L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut103l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT103L_FVB_SHIFT		8
#define GFXMMU_LUT103L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut103l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT103L_EN Enable **/
#define GFXMMU_LUT103L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut103h LUT103H Graphic MMU LUT entry 103 high
@{*/


#define GFXMMU_LUT103H_LO_SHIFT		4
#define GFXMMU_LUT103H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut103h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut104l LUT104L Graphic MMU LUT entry 104 low
@{*/


#define GFXMMU_LUT104L_LVB_SHIFT		16
#define GFXMMU_LUT104L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut104l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT104L_FVB_SHIFT		8
#define GFXMMU_LUT104L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut104l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT104L_EN Enable **/
#define GFXMMU_LUT104L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut104h LUT104H Graphic MMU LUT entry 104 high
@{*/


#define GFXMMU_LUT104H_LO_SHIFT		4
#define GFXMMU_LUT104H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut104h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut105l LUT105L Graphic MMU LUT entry 105 low
@{*/


#define GFXMMU_LUT105L_LVB_SHIFT		16
#define GFXMMU_LUT105L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut105l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT105L_FVB_SHIFT		8
#define GFXMMU_LUT105L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut105l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT105L_EN Enable **/
#define GFXMMU_LUT105L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut105h LUT105H Graphic MMU LUT entry 105 high
@{*/


#define GFXMMU_LUT105H_LO_SHIFT		4
#define GFXMMU_LUT105H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut105h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut106l LUT106L Graphic MMU LUT entry 106 low
@{*/


#define GFXMMU_LUT106L_LVB_SHIFT		16
#define GFXMMU_LUT106L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut106l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT106L_FVB_SHIFT		8
#define GFXMMU_LUT106L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut106l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT106L_EN Enable **/
#define GFXMMU_LUT106L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut106h LUT106H Graphic MMU LUT entry 106 high
@{*/


#define GFXMMU_LUT106H_LO_SHIFT		4
#define GFXMMU_LUT106H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut106h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut107l LUT107L Graphic MMU LUT entry 107 low
@{*/


#define GFXMMU_LUT107L_LVB_SHIFT		16
#define GFXMMU_LUT107L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut107l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT107L_FVB_SHIFT		8
#define GFXMMU_LUT107L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut107l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT107L_EN Enable **/
#define GFXMMU_LUT107L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut107h LUT107H Graphic MMU LUT entry 107 high
@{*/


#define GFXMMU_LUT107H_LO_SHIFT		4
#define GFXMMU_LUT107H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut107h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut108l LUT108L Graphic MMU LUT entry 108 low
@{*/


#define GFXMMU_LUT108L_LVB_SHIFT		16
#define GFXMMU_LUT108L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut108l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT108L_FVB_SHIFT		8
#define GFXMMU_LUT108L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut108l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT108L_EN Enable **/
#define GFXMMU_LUT108L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut108h LUT108H Graphic MMU LUT entry 108 high
@{*/


#define GFXMMU_LUT108H_LO_SHIFT		4
#define GFXMMU_LUT108H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut108h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut109l LUT109L Graphic MMU LUT entry 109 low
@{*/


#define GFXMMU_LUT109L_LVB_SHIFT		16
#define GFXMMU_LUT109L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut109l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT109L_FVB_SHIFT		8
#define GFXMMU_LUT109L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut109l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT109L_EN Enable **/
#define GFXMMU_LUT109L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut109h LUT109H Graphic MMU LUT entry 109 high
@{*/


#define GFXMMU_LUT109H_LO_SHIFT		4
#define GFXMMU_LUT109H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut109h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut110l LUT110L Graphic MMU LUT entry 110 low
@{*/


#define GFXMMU_LUT110L_LVB_SHIFT		16
#define GFXMMU_LUT110L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut110l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT110L_FVB_SHIFT		8
#define GFXMMU_LUT110L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut110l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT110L_EN Enable **/
#define GFXMMU_LUT110L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut110h LUT110H Graphic MMU LUT entry 110 high
@{*/


#define GFXMMU_LUT110H_LO_SHIFT		4
#define GFXMMU_LUT110H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut110h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

