grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut111l LUT111L Graphic MMU LUT entry 111 low
@{*/


#define GFXMMU_LUT111L_LVB_SHIFT		16
#define GFXMMU_LUT111L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut111l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT111L_FVB_SHIFT		8
#define GFXMMU_LUT111L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut111l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT111L_EN Enable **/
#define GFXMMU_LUT111L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut111h LUT111H Graphic MMU LUT entry 111 high
@{*/


#define GFXMMU_LUT111H_LO_SHIFT		4
#define GFXMMU_LUT111H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut111h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut112l LUT112L Graphic MMU LUT entry 112 low
@{*/


#define GFXMMU_LUT112L_LVB_SHIFT		16
#define GFXMMU_LUT112L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut112l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT112L_FVB_SHIFT		8
#define GFXMMU_LUT112L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut112l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT112L_EN Enable **/
#define GFXMMU_LUT112L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut112h LUT112H Graphic MMU LUT entry 112 high
@{*/


#define GFXMMU_LUT112H_LO_SHIFT		4
#define GFXMMU_LUT112H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut112h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut113l LUT113L Graphic MMU LUT entry 113 low
@{*/


#define GFXMMU_LUT113L_LVB_SHIFT		16
#define GFXMMU_LUT113L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut113l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT113L_FVB_SHIFT		8
#define GFXMMU_LUT113L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut113l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT113L_EN Enable **/
#define GFXMMU_LUT113L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut113h LUT113H Graphic MMU LUT entry 113 high
@{*/


#define GFXMMU_LUT113H_LO_SHIFT		4
#define GFXMMU_LUT113H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut113h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut114l LUT114L Graphic MMU LUT entry 114 low
@{*/


#define GFXMMU_LUT114L_LVB_SHIFT		16
#define GFXMMU_LUT114L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut114l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT114L_FVB_SHIFT		8
#define GFXMMU_LUT114L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut114l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT114L_EN Enable **/
#define GFXMMU_LUT114L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut114h LUT114H Graphic MMU LUT entry 114 high
@{*/


#define GFXMMU_LUT114H_LO_SHIFT		4
#define GFXMMU_LUT114H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut114h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut115l LUT115L Graphic MMU LUT entry 115 low
@{*/


#define GFXMMU_LUT115L_LVB_SHIFT		16
#define GFXMMU_LUT115L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut115l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT115L_FVB_SHIFT		8
#define GFXMMU_LUT115L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut115l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT115L_EN Enable **/
#define GFXMMU_LUT115L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut115h LUT115H Graphic MMU LUT entry 115 high
@{*/


#define GFXMMU_LUT115H_LO_SHIFT		4
#define GFXMMU_LUT115H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut115h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut116l LUT116L Graphic MMU LUT entry 116 low
@{*/


#define GFXMMU_LUT116L_LVB_SHIFT		16
#define GFXMMU_LUT116L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut116l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT116L_FVB_SHIFT		8
#define GFXMMU_LUT116L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut116l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT116L_EN Enable **/
#define GFXMMU_LUT116L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut116h LUT116H Graphic MMU LUT entry 116 high
@{*/


#define GFXMMU_LUT116H_LO_SHIFT		4
#define GFXMMU_LUT116H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut116h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut117l LUT117L Graphic MMU LUT entry 117 low
@{*/


#define GFXMMU_LUT117L_LVB_SHIFT		16
#define GFXMMU_LUT117L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut117l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT117L_FVB_SHIFT		8
#define GFXMMU_LUT117L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut117l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT117L_EN Enable **/
#define GFXMMU_LUT117L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut117h LUT117H Graphic MMU LUT entry 117 high
@{*/


#define GFXMMU_LUT117H_LO_SHIFT		4
#define GFXMMU_LUT117H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut117h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut118l LUT118L Graphic MMU LUT entry 118 low
@{*/


#define GFXMMU_LUT118L_LVB_SHIFT		16
#define GFXMMU_LUT118L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut118l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT118L_FVB_SHIFT		8
#define GFXMMU_LUT118L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut118l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT118L_EN Enable **/
#define GFXMMU_LUT118L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut118h LUT118H Graphic MMU LUT entry 118 high
@{*/


#define GFXMMU_LUT118H_LO_SHIFT		4
#define GFXMMU_LUT118H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut118h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut119l LUT119L Graphic MMU LUT entry 119 low
@{*/


#define GFXMMU_LUT119L_LVB_SHIFT		16
#define GFXMMU_LUT119L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut119l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT119L_FVB_SHIFT		8
#define GFXMMU_LUT119L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut119l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT119L_EN Enable **/
#define GFXMMU_LUT119L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut119h LUT119H Graphic MMU LUT entry 119 high
@{*/


#define GFXMMU_LUT119H_LO_SHIFT		4
#define GFXMMU_LUT119H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut119h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut120l LUT120L Graphic MMU LUT entry 120 low
@{*/


