grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT120L_LVB_SHIFT		16
#define GFXMMU_LUT120L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut120l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT120L_FVB_SHIFT		8
#define GFXMMU_LUT120L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut120l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT120L_EN Enable **/
#define GFXMMU_LUT120L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut120h LUT120H Graphic MMU LUT entry 120 high
@{*/


#define GFXMMU_LUT120H_LO_SHIFT		4
#define GFXMMU_LUT120H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut120h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut121l LUT121L Graphic MMU LUT entry 121 low
@{*/


#define GFXMMU_LUT121L_LVB_SHIFT		16
#define GFXMMU_LUT121L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut121l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT121L_FVB_SHIFT		8
#define GFXMMU_LUT121L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut121l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT121L_EN Enable **/
#define GFXMMU_LUT121L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut121h LUT121H Graphic MMU LUT entry 121 high
@{*/


#define GFXMMU_LUT121H_LO_SHIFT		4
#define GFXMMU_LUT121H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut121h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut122l LUT122L Graphic MMU LUT entry 122 low
@{*/


#define GFXMMU_LUT122L_LVB_SHIFT		16
#define GFXMMU_LUT122L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut122l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT122L_FVB_SHIFT		8
#define GFXMMU_LUT122L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut122l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT122L_EN Enable **/
#define GFXMMU_LUT122L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut122h LUT122H Graphic MMU LUT entry 122 high
@{*/


#define GFXMMU_LUT122H_LO_SHIFT		4
#define GFXMMU_LUT122H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut122h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut123l LUT123L Graphic MMU LUT entry 123 low
@{*/


#define GFXMMU_LUT123L_LVB_SHIFT		16
#define GFXMMU_LUT123L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut123l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT123L_FVB_SHIFT		8
#define GFXMMU_LUT123L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut123l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT123L_EN Enable **/
#define GFXMMU_LUT123L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut123h LUT123H Graphic MMU LUT entry 123 high
@{*/


#define GFXMMU_LUT123H_LO_SHIFT		4
#define GFXMMU_LUT123H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut123h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut124l LUT124L Graphic MMU LUT entry 124 low
@{*/


#define GFXMMU_LUT124L_LVB_SHIFT		16
#define GFXMMU_LUT124L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut124l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT124L_FVB_SHIFT		8
#define GFXMMU_LUT124L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut124l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT124L_EN Enable **/
#define GFXMMU_LUT124L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut124h LUT124H Graphic MMU LUT entry 124 high
@{*/


#define GFXMMU_LUT124H_LO_SHIFT		4
#define GFXMMU_LUT124H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut124h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut125l LUT125L Graphic MMU LUT entry 125 low
@{*/


#define GFXMMU_LUT125L_LVB_SHIFT		16
#define GFXMMU_LUT125L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut125l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT125L_FVB_SHIFT		8
#define GFXMMU_LUT125L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut125l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT125L_EN Enable **/
#define GFXMMU_LUT125L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut125h LUT125H Graphic MMU LUT entry 125 high
@{*/


#define GFXMMU_LUT125H_LO_SHIFT		4
#define GFXMMU_LUT125H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut125h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut126l LUT126L Graphic MMU LUT entry 126 low
@{*/


#define GFXMMU_LUT126L_LVB_SHIFT		16
#define GFXMMU_LUT126L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut126l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT126L_FVB_SHIFT		8
#define GFXMMU_LUT126L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut126l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT126L_EN Enable **/
#define GFXMMU_LUT126L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut126h LUT126H Graphic MMU LUT entry 126 high
@{*/


#define GFXMMU_LUT126H_LO_SHIFT		4
#define GFXMMU_LUT126H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut126h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut127l LUT127L Graphic MMU LUT entry 127 low
@{*/


#define GFXMMU_LUT127L_LVB_SHIFT		16
#define GFXMMU_LUT127L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut127l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT127L_FVB_SHIFT		8
#define GFXMMU_LUT127L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut127l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT127L_EN Enable **/
#define GFXMMU_LUT127L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut127h LUT127H Graphic MMU LUT entry 127 high
@{*/


#define GFXMMU_LUT127H_LO_SHIFT		4
#define GFXMMU_LUT127H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut127h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut128l LUT128L Graphic MMU LUT entry 128 low
@{*/


#define GFXMMU_LUT128L_LVB_SHIFT		16
#define GFXMMU_LUT128L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut128l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT128L_FVB_SHIFT		8
#define GFXMMU_LUT128L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut128l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT128L_EN Enable **/
#define GFXMMU_LUT128L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut128h LUT128H Graphic MMU LUT entry 128 high
@{*/


#define GFXMMU_LUT128H_LO_SHIFT		4
#define GFXMMU_LUT128H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut128h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut129l LUT129L Graphic MMU LUT entry 129 low
@{*/


#define GFXMMU_LUT129L_LVB_SHIFT		16
#define GFXMMU_LUT129L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut129l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT129L_FVB_SHIFT		8
#define GFXMMU_LUT129L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut129l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT129L_EN Enable **/
#define GFXMMU_LUT129L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut129h LUT129H Graphic MMU LUT entry 129 high
@{*/


#define GFXMMU_LUT129H_LO_SHIFT		4
#define GFXMMU_LUT129H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut129h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut130l LUT130L Graphic MMU LUT entry 130 low
@{*/


#define GFXMMU_LUT130L_LVB_SHIFT		16
#define GFXMMU_LUT130L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut130l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT130L_FVB_SHIFT		8
#define GFXMMU_LUT130L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut130l_fvb FVB First Valid Block
@{*/
/**@}*/

