grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT130L_EN Enable **/
#define GFXMMU_LUT130L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut130h LUT130H Graphic MMU LUT entry 130 high
@{*/


#define GFXMMU_LUT130H_LO_SHIFT		4
#define GFXMMU_LUT130H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut130h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut131l LUT131L Graphic MMU LUT entry 131 low
@{*/


#define GFXMMU_LUT131L_LVB_SHIFT		16
#define GFXMMU_LUT131L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut131l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT131L_FVB_SHIFT		8
#define GFXMMU_LUT131L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut131l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT131L_EN Enable **/
#define GFXMMU_LUT131L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut131h LUT131H Graphic MMU LUT entry 131 high
@{*/


#define GFXMMU_LUT131H_LO_SHIFT		4
#define GFXMMU_LUT131H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut131h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut132l LUT132L Graphic MMU LUT entry 132 low
@{*/


#define GFXMMU_LUT132L_LVB_SHIFT		16
#define GFXMMU_LUT132L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut132l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT132L_FVB_SHIFT		8
#define GFXMMU_LUT132L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut132l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT132L_EN Enable **/
#define GFXMMU_LUT132L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut132h LUT132H Graphic MMU LUT entry 132 high
@{*/


#define GFXMMU_LUT132H_LO_SHIFT		4
#define GFXMMU_LUT132H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut132h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut133l LUT133L Graphic MMU LUT entry 133 low
@{*/


#define GFXMMU_LUT133L_LVB_SHIFT		16
#define GFXMMU_LUT133L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut133l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT133L_FVB_SHIFT		8
#define GFXMMU_LUT133L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut133l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT133L_EN Enable **/
#define GFXMMU_LUT133L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut133h LUT133H Graphic MMU LUT entry 133 high
@{*/


#define GFXMMU_LUT133H_LO_SHIFT		4
#define GFXMMU_LUT133H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut133h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut134l LUT134L Graphic MMU LUT entry 134 low
@{*/


#define GFXMMU_LUT134L_LVB_SHIFT		16
#define GFXMMU_LUT134L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut134l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT134L_FVB_SHIFT		8
#define GFXMMU_LUT134L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut134l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT134L_EN Enable **/
#define GFXMMU_LUT134L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut134h LUT134H Graphic MMU LUT entry 134 high
@{*/


#define GFXMMU_LUT134H_LO_SHIFT		4
#define GFXMMU_LUT134H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut134h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut135l LUT135L Graphic MMU LUT entry 135 low
@{*/


#define GFXMMU_LUT135L_LVB_SHIFT		16
#define GFXMMU_LUT135L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut135l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT135L_FVB_SHIFT		8
#define GFXMMU_LUT135L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut135l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT135L_EN Enable **/
#define GFXMMU_LUT135L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut135h LUT135H Graphic MMU LUT entry 135 high
@{*/


#define GFXMMU_LUT135H_LO_SHIFT		4
#define GFXMMU_LUT135H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut135h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut136l LUT136L Graphic MMU LUT entry 136 low
@{*/


#define GFXMMU_LUT136L_LVB_SHIFT		16
#define GFXMMU_LUT136L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut136l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT136L_FVB_SHIFT		8
#define GFXMMU_LUT136L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut136l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT136L_EN Enable **/
#define GFXMMU_LUT136L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut136h LUT136H Graphic MMU LUT entry 136 high
@{*/


#define GFXMMU_LUT136H_LO_SHIFT		4
#define GFXMMU_LUT136H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut136h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut137l LUT137L Graphic MMU LUT entry 137 low
@{*/


#define GFXMMU_LUT137L_LVB_SHIFT		16
#define GFXMMU_LUT137L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut137l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT137L_FVB_SHIFT		8
#define GFXMMU_LUT137L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut137l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT137L_EN Enable **/
#define GFXMMU_LUT137L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut137h LUT137H Graphic MMU LUT entry 137 high
@{*/


#define GFXMMU_LUT137H_LO_SHIFT		4
#define GFXMMU_LUT137H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut137h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut138l LUT138L Graphic MMU LUT entry 138 low
@{*/


#define GFXMMU_LUT138L_LVB_SHIFT		16
#define GFXMMU_LUT138L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut138l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT138L_FVB_SHIFT		8
#define GFXMMU_LUT138L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut138l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT138L_EN Enable **/
#define GFXMMU_LUT138L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut138h LUT138H Graphic MMU LUT entry 138 high
@{*/


#define GFXMMU_LUT138H_LO_SHIFT		4
#define GFXMMU_LUT138H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut138h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut139l LUT139L Graphic MMU LUT entry 139 low
@{*/


#define GFXMMU_LUT139L_LVB_SHIFT		16
#define GFXMMU_LUT139L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut139l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT139L_FVB_SHIFT		8
#define GFXMMU_LUT139L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut139l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT139L_EN Enable **/
#define GFXMMU_LUT139L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut139h LUT139H Graphic MMU LUT entry 139 high
@{*/


#define GFXMMU_LUT139H_LO_SHIFT		4
#define GFXMMU_LUT139H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut139h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut140l LUT140L Graphic MMU LUT entry 140 low
@{*/


