grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT140L_LVB_SHIFT		16
#define GFXMMU_LUT140L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut140l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT140L_FVB_SHIFT		8
#define GFXMMU_LUT140L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut140l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT140L_EN Enable **/
#define GFXMMU_LUT140L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut140h LUT140H Graphic MMU LUT entry 140 high
@{*/


#define GFXMMU_LUT140H_LO_SHIFT		4
#define GFXMMU_LUT140H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut140h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut141l LUT141L Graphic MMU LUT entry 141 low
@{*/


#define GFXMMU_LUT141L_LVB_SHIFT		16
#define GFXMMU_LUT141L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut141l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT141L_FVB_SHIFT		8
#define GFXMMU_LUT141L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut141l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT141L_EN Enable **/
#define GFXMMU_LUT141L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut141h LUT141H Graphic MMU LUT entry 141 high
@{*/


#define GFXMMU_LUT141H_LO_SHIFT		4
#define GFXMMU_LUT141H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut141h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut142l LUT142L Graphic MMU LUT entry 142 low
@{*/


#define GFXMMU_LUT142L_LVB_SHIFT		16
#define GFXMMU_LUT142L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut142l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT142L_FVB_SHIFT		8
#define GFXMMU_LUT142L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut142l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT142L_EN Enable **/
#define GFXMMU_LUT142L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut142h LUT142H Graphic MMU LUT entry 142 high
@{*/


#define GFXMMU_LUT142H_LO_SHIFT		4
#define GFXMMU_LUT142H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut142h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut143l LUT143L Graphic MMU LUT entry 143 low
@{*/


#define GFXMMU_LUT143L_LVB_SHIFT		16
#define GFXMMU_LUT143L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut143l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT143L_FVB_SHIFT		8
#define GFXMMU_LUT143L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut143l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT143L_EN Enable **/
#define GFXMMU_LUT143L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut143h LUT143H Graphic MMU LUT entry 143 high
@{*/


#define GFXMMU_LUT143H_LO_SHIFT		4
#define GFXMMU_LUT143H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut143h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut144l LUT144L Graphic MMU LUT entry 144 low
@{*/


#define GFXMMU_LUT144L_LVB_SHIFT		16
#define GFXMMU_LUT144L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut144l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT144L_FVB_SHIFT		8
#define GFXMMU_LUT144L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut144l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT144L_EN Enable **/
#define GFXMMU_LUT144L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut144h LUT144H Graphic MMU LUT entry 144 high
@{*/


#define GFXMMU_LUT144H_LO_SHIFT		4
#define GFXMMU_LUT144H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut144h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut145l LUT145L Graphic MMU LUT entry 145 low
@{*/


#define GFXMMU_LUT145L_LVB_SHIFT		16
#define GFXMMU_LUT145L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut145l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT145L_FVB_SHIFT		8
#define GFXMMU_LUT145L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut145l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT145L_EN Enable **/
#define GFXMMU_LUT145L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut145h LUT145H Graphic MMU LUT entry 145 high
@{*/


#define GFXMMU_LUT145H_LO_SHIFT		4
#define GFXMMU_LUT145H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut145h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut146l LUT146L Graphic MMU LUT entry 146 low
@{*/


#define GFXMMU_LUT146L_LVB_SHIFT		16
#define GFXMMU_LUT146L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut146l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT146L_FVB_SHIFT		8
#define GFXMMU_LUT146L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut146l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT146L_EN Enable **/
#define GFXMMU_LUT146L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut146h LUT146H Graphic MMU LUT entry 146 high
@{*/


#define GFXMMU_LUT146H_LO_SHIFT		4
#define GFXMMU_LUT146H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut146h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut147l LUT147L Graphic MMU LUT entry 147 low
@{*/


#define GFXMMU_LUT147L_LVB_SHIFT		16
#define GFXMMU_LUT147L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut147l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT147L_FVB_SHIFT		8
#define GFXMMU_LUT147L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut147l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT147L_EN Enable **/
#define GFXMMU_LUT147L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut147h LUT147H Graphic MMU LUT entry 147 high
@{*/


#define GFXMMU_LUT147H_LO_SHIFT		4
#define GFXMMU_LUT147H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut147h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut148l LUT148L Graphic MMU LUT entry 148 low
@{*/


#define GFXMMU_LUT148L_LVB_SHIFT		16
#define GFXMMU_LUT148L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut148l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT148L_FVB_SHIFT		8
#define GFXMMU_LUT148L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut148l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT148L_EN Enable **/
#define GFXMMU_LUT148L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut148h LUT148H Graphic MMU LUT entry 148 high
@{*/


#define GFXMMU_LUT148H_LO_SHIFT		4
#define GFXMMU_LUT148H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut148h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut149l LUT149L Graphic MMU LUT entry 149 low
@{*/


#define GFXMMU_LUT149L_LVB_SHIFT		16
#define GFXMMU_LUT149L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut149l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT149L_FVB_SHIFT		8
#define GFXMMU_LUT149L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut149l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT149L_EN Enable **/
#define GFXMMU_LUT149L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut149h LUT149H Graphic MMU LUT entry 149 high
@{*/


#define GFXMMU_LUT149H_LO_SHIFT		4
#define GFXMMU_LUT149H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut149h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut150l LUT150L Graphic MMU LUT entry 150 low
@{*/


#define GFXMMU_LUT150L_LVB_SHIFT		16
#define GFXMMU_LUT150L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut150l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT150L_FVB_SHIFT		8
#define GFXMMU_LUT150L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut150l_fvb FVB First Valid Block
@{*/
/**@}*/

