grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT150L_EN Enable **/
#define GFXMMU_LUT150L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut150h LUT150H Graphic MMU LUT entry 150 high
@{*/


#define GFXMMU_LUT150H_LO_SHIFT		4
#define GFXMMU_LUT150H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut150h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut151l LUT151L Graphic MMU LUT entry 151 low
@{*/


#define GFXMMU_LUT151L_LVB_SHIFT		16
#define GFXMMU_LUT151L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut151l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT151L_FVB_SHIFT		8
#define GFXMMU_LUT151L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut151l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT151L_EN Enable **/
#define GFXMMU_LUT151L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut151h LUT151H Graphic MMU LUT entry 151 high
@{*/


#define GFXMMU_LUT151H_LO_SHIFT		4
#define GFXMMU_LUT151H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut151h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut152l LUT152L Graphic MMU LUT entry 152 low
@{*/


#define GFXMMU_LUT152L_LVB_SHIFT		16
#define GFXMMU_LUT152L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut152l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT152L_FVB_SHIFT		8
#define GFXMMU_LUT152L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut152l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT152L_EN Enable **/
#define GFXMMU_LUT152L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut152h LUT152H Graphic MMU LUT entry 152 high
@{*/


#define GFXMMU_LUT152H_LO_SHIFT		4
#define GFXMMU_LUT152H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut152h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut153l LUT153L Graphic MMU LUT entry 153 low
@{*/


#define GFXMMU_LUT153L_LVB_SHIFT		16
#define GFXMMU_LUT153L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut153l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT153L_FVB_SHIFT		8
#define GFXMMU_LUT153L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut153l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT153L_EN Enable **/
#define GFXMMU_LUT153L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut153h LUT153H Graphic MMU LUT entry 153 high
@{*/


#define GFXMMU_LUT153H_LO_SHIFT		4
#define GFXMMU_LUT153H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut153h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut154l LUT154L Graphic MMU LUT entry 154 low
@{*/


#define GFXMMU_LUT154L_LVB_SHIFT		16
#define GFXMMU_LUT154L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut154l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT154L_FVB_SHIFT		8
#define GFXMMU_LUT154L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut154l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT154L_EN Enable **/
#define GFXMMU_LUT154L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut154h LUT154H Graphic MMU LUT entry 154 high
@{*/


#define GFXMMU_LUT154H_LO_SHIFT		4
#define GFXMMU_LUT154H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut154h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut155l LUT155L Graphic MMU LUT entry 155 low
@{*/


#define GFXMMU_LUT155L_LVB_SHIFT		16
#define GFXMMU_LUT155L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut155l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT155L_FVB_SHIFT		8
#define GFXMMU_LUT155L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut155l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT155L_EN Enable **/
#define GFXMMU_LUT155L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut155h LUT155H Graphic MMU LUT entry 155 high
@{*/


#define GFXMMU_LUT155H_LO_SHIFT		4
#define GFXMMU_LUT155H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut155h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut156l LUT156L Graphic MMU LUT entry 156 low
@{*/


#define GFXMMU_LUT156L_LVB_SHIFT		16
#define GFXMMU_LUT156L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut156l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT156L_FVB_SHIFT		8
#define GFXMMU_LUT156L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut156l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT156L_EN Enable **/
#define GFXMMU_LUT156L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut156h LUT156H Graphic MMU LUT entry 156 high
@{*/


#define GFXMMU_LUT156H_LO_SHIFT		4
#define GFXMMU_LUT156H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut156h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut157l LUT157L Graphic MMU LUT entry 157 low
@{*/


#define GFXMMU_LUT157L_LVB_SHIFT		16
#define GFXMMU_LUT157L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut157l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT157L_FVB_SHIFT		8
#define GFXMMU_LUT157L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut157l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT157L_EN Enable **/
#define GFXMMU_LUT157L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut157h LUT157H Graphic MMU LUT entry 157 high
@{*/


#define GFXMMU_LUT157H_LO_SHIFT		4
#define GFXMMU_LUT157H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut157h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut158l LUT158L Graphic MMU LUT entry 158 low
@{*/


#define GFXMMU_LUT158L_LVB_SHIFT		16
#define GFXMMU_LUT158L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut158l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT158L_FVB_SHIFT		8
#define GFXMMU_LUT158L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut158l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT158L_EN Enable **/
#define GFXMMU_LUT158L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut158h LUT158H Graphic MMU LUT entry 158 high
@{*/


#define GFXMMU_LUT158H_LO_SHIFT		4
#define GFXMMU_LUT158H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut158h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut159l LUT159L Graphic MMU LUT entry 159 low
@{*/


#define GFXMMU_LUT159L_LVB_SHIFT		16
#define GFXMMU_LUT159L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut159l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT159L_FVB_SHIFT		8
#define GFXMMU_LUT159L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut159l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT159L_EN Enable **/
#define GFXMMU_LUT159L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut159h LUT159H Graphic MMU LUT entry 159 high
@{*/


#define GFXMMU_LUT159H_LO_SHIFT		4
#define GFXMMU_LUT159H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut159h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

