grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut160l LUT160L Graphic MMU LUT entry 160 low
@{*/


#define GFXMMU_LUT160L_LVB_SHIFT		16
#define GFXMMU_LUT160L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut160l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT160L_FVB_SHIFT		8
#define GFXMMU_LUT160L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut160l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT160L_EN Enable **/
#define GFXMMU_LUT160L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut160h LUT160H Graphic MMU LUT entry 160 high
@{*/


#define GFXMMU_LUT160H_LO_SHIFT		4
#define GFXMMU_LUT160H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut160h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut161l LUT161L Graphic MMU LUT entry 161 low
@{*/


#define GFXMMU_LUT161L_LVB_SHIFT		16
#define GFXMMU_LUT161L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut161l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT161L_FVB_SHIFT		8
#define GFXMMU_LUT161L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut161l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT161L_EN Enable **/
#define GFXMMU_LUT161L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut161h LUT161H Graphic MMU LUT entry 161 high
@{*/


#define GFXMMU_LUT161H_LO_SHIFT		4
#define GFXMMU_LUT161H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut161h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut162l LUT162L Graphic MMU LUT entry 162 low
@{*/


#define GFXMMU_LUT162L_LVB_SHIFT		16
#define GFXMMU_LUT162L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut162l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT162L_FVB_SHIFT		8
#define GFXMMU_LUT162L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut162l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT162L_EN Enable **/
#define GFXMMU_LUT162L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut162h LUT162H Graphic MMU LUT entry 162 high
@{*/


#define GFXMMU_LUT162H_LO_SHIFT		4
#define GFXMMU_LUT162H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut162h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut163l LUT163L Graphic MMU LUT entry 163 low
@{*/


#define GFXMMU_LUT163L_LVB_SHIFT		16
#define GFXMMU_LUT163L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut163l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT163L_FVB_SHIFT		8
#define GFXMMU_LUT163L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut163l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT163L_EN Enable **/
#define GFXMMU_LUT163L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut163h LUT163H Graphic MMU LUT entry 163 high
@{*/


#define GFXMMU_LUT163H_LO_SHIFT		4
#define GFXMMU_LUT163H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut163h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut164l LUT164L Graphic MMU LUT entry 164 low
@{*/


#define GFXMMU_LUT164L_LVB_SHIFT		16
#define GFXMMU_LUT164L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut164l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT164L_FVB_SHIFT		8
#define GFXMMU_LUT164L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut164l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT164L_EN Enable **/
#define GFXMMU_LUT164L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut164h LUT164H Graphic MMU LUT entry 164 high
@{*/


#define GFXMMU_LUT164H_LO_SHIFT		4
#define GFXMMU_LUT164H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut164h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut165l LUT165L Graphic MMU LUT entry 165 low
@{*/


#define GFXMMU_LUT165L_LVB_SHIFT		16
#define GFXMMU_LUT165L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut165l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT165L_FVB_SHIFT		8
#define GFXMMU_LUT165L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut165l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT165L_EN Enable **/
#define GFXMMU_LUT165L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut165h LUT165H Graphic MMU LUT entry 165 high
@{*/


#define GFXMMU_LUT165H_LO_SHIFT		4
#define GFXMMU_LUT165H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut165h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut166l LUT166L Graphic MMU LUT entry 166 low
@{*/


#define GFXMMU_LUT166L_LVB_SHIFT		16
#define GFXMMU_LUT166L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut166l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT166L_FVB_SHIFT		8
#define GFXMMU_LUT166L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut166l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT166L_EN Enable **/
#define GFXMMU_LUT166L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut166h LUT166H Graphic MMU LUT entry 166 high
@{*/


#define GFXMMU_LUT166H_LO_SHIFT		4
#define GFXMMU_LUT166H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut166h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut167l LUT167L Graphic MMU LUT entry 167 low
@{*/


#define GFXMMU_LUT167L_LVB_SHIFT		16
#define GFXMMU_LUT167L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut167l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT167L_FVB_SHIFT		8
#define GFXMMU_LUT167L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut167l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT167L_EN Enable **/
#define GFXMMU_LUT167L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut167h LUT167H Graphic MMU LUT entry 167 high
@{*/


#define GFXMMU_LUT167H_LO_SHIFT		4
#define GFXMMU_LUT167H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut167h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut168l LUT168L Graphic MMU LUT entry 168 low
@{*/


#define GFXMMU_LUT168L_LVB_SHIFT		16
#define GFXMMU_LUT168L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut168l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT168L_FVB_SHIFT		8
#define GFXMMU_LUT168L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut168l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT168L_EN Enable **/
#define GFXMMU_LUT168L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut168h LUT168H Graphic MMU LUT entry 168 high
@{*/


#define GFXMMU_LUT168H_LO_SHIFT		4
#define GFXMMU_LUT168H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut168h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut169l LUT169L Graphic MMU LUT entry 169 low
@{*/


#define GFXMMU_LUT169L_LVB_SHIFT		16
#define GFXMMU_LUT169L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut169l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT169L_FVB_SHIFT		8
#define GFXMMU_LUT169L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut169l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT169L_EN Enable **/
#define GFXMMU_LUT169L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut169h LUT169H Graphic MMU LUT entry 169 high
@{*/


