grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT169H_LO_SHIFT		4
#define GFXMMU_LUT169H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut169h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut170l LUT170L Graphic MMU LUT entry 170 low
@{*/


#define GFXMMU_LUT170L_LVB_SHIFT		16
#define GFXMMU_LUT170L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut170l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT170L_FVB_SHIFT		8
#define GFXMMU_LUT170L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut170l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT170L_EN Enable **/
#define GFXMMU_LUT170L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut170h LUT170H Graphic MMU LUT entry 170 high
@{*/


#define GFXMMU_LUT170H_LO_SHIFT		4
#define GFXMMU_LUT170H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut170h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut171l LUT171L Graphic MMU LUT entry 171 low
@{*/


#define GFXMMU_LUT171L_LVB_SHIFT		16
#define GFXMMU_LUT171L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut171l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT171L_FVB_SHIFT		8
#define GFXMMU_LUT171L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut171l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT171L_EN Enable **/
#define GFXMMU_LUT171L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut171h LUT171H Graphic MMU LUT entry 171 high
@{*/


#define GFXMMU_LUT171H_LO_SHIFT		4
#define GFXMMU_LUT171H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut171h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut172l LUT172L Graphic MMU LUT entry 172 low
@{*/


#define GFXMMU_LUT172L_LVB_SHIFT		16
#define GFXMMU_LUT172L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut172l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT172L_FVB_SHIFT		8
#define GFXMMU_LUT172L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut172l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT172L_EN Enable **/
#define GFXMMU_LUT172L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut172h LUT172H Graphic MMU LUT entry 172 high
@{*/


#define GFXMMU_LUT172H_LO_SHIFT		4
#define GFXMMU_LUT172H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut172h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut173l LUT173L Graphic MMU LUT entry 173 low
@{*/


#define GFXMMU_LUT173L_LVB_SHIFT		16
#define GFXMMU_LUT173L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut173l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT173L_FVB_SHIFT		8
#define GFXMMU_LUT173L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut173l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT173L_EN Enable **/
#define GFXMMU_LUT173L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut173h LUT173H Graphic MMU LUT entry 173 high
@{*/


#define GFXMMU_LUT173H_LO_SHIFT		4
#define GFXMMU_LUT173H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut173h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut174l LUT174L Graphic MMU LUT entry 174 low
@{*/


#define GFXMMU_LUT174L_LVB_SHIFT		16
#define GFXMMU_LUT174L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut174l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT174L_FVB_SHIFT		8
#define GFXMMU_LUT174L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut174l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT174L_EN Enable **/
#define GFXMMU_LUT174L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut174h LUT174H Graphic MMU LUT entry 174 high
@{*/


#define GFXMMU_LUT174H_LO_SHIFT		4
#define GFXMMU_LUT174H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut174h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut175l LUT175L Graphic MMU LUT entry 175 low
@{*/


#define GFXMMU_LUT175L_LVB_SHIFT		16
#define GFXMMU_LUT175L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut175l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT175L_FVB_SHIFT		8
#define GFXMMU_LUT175L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut175l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT175L_EN Enable **/
#define GFXMMU_LUT175L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut175h LUT175H Graphic MMU LUT entry 175 high
@{*/


#define GFXMMU_LUT175H_LO_SHIFT		4
#define GFXMMU_LUT175H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut175h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut176l LUT176L Graphic MMU LUT entry 176 low
@{*/


#define GFXMMU_LUT176L_LVB_SHIFT		16
#define GFXMMU_LUT176L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut176l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT176L_FVB_SHIFT		8
#define GFXMMU_LUT176L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut176l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT176L_EN Enable **/
#define GFXMMU_LUT176L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut176h LUT176H Graphic MMU LUT entry 176 high
@{*/


#define GFXMMU_LUT176H_LO_SHIFT		4
#define GFXMMU_LUT176H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut176h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut177l LUT177L Graphic MMU LUT entry 177 low
@{*/


#define GFXMMU_LUT177L_LVB_SHIFT		16
#define GFXMMU_LUT177L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut177l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT177L_FVB_SHIFT		8
#define GFXMMU_LUT177L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut177l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT177L_EN Enable **/
#define GFXMMU_LUT177L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut177h LUT177H Graphic MMU LUT entry 177 high
@{*/


#define GFXMMU_LUT177H_LO_SHIFT		4
#define GFXMMU_LUT177H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut177h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut178l LUT178L Graphic MMU LUT entry 178 low
@{*/


#define GFXMMU_LUT178L_LVB_SHIFT		16
#define GFXMMU_LUT178L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut178l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT178L_FVB_SHIFT		8
#define GFXMMU_LUT178L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut178l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT178L_EN Enable **/
#define GFXMMU_LUT178L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut178h LUT178H Graphic MMU LUT entry 178 high
@{*/


#define GFXMMU_LUT178H_LO_SHIFT		4
#define GFXMMU_LUT178H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut178h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

