grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut179l LUT179L Graphic MMU LUT entry 179 low
@{*/


#define GFXMMU_LUT179L_LVB_SHIFT		16
#define GFXMMU_LUT179L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut179l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT179L_FVB_SHIFT		8
#define GFXMMU_LUT179L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut179l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT179L_EN Enable **/
#define GFXMMU_LUT179L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut179h LUT179H Graphic MMU LUT entry 179 high
@{*/


#define GFXMMU_LUT179H_LO_SHIFT		4
#define GFXMMU_LUT179H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut179h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut180l LUT180L Graphic MMU LUT entry 180 low
@{*/


#define GFXMMU_LUT180L_LVB_SHIFT		16
#define GFXMMU_LUT180L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut180l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT180L_FVB_SHIFT		8
#define GFXMMU_LUT180L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut180l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT180L_EN Enable **/
#define GFXMMU_LUT180L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut180h LUT180H Graphic MMU LUT entry 180 high
@{*/


#define GFXMMU_LUT180H_LO_SHIFT		4
#define GFXMMU_LUT180H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut180h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut181l LUT181L Graphic MMU LUT entry 181 low
@{*/


#define GFXMMU_LUT181L_LVB_SHIFT		16
#define GFXMMU_LUT181L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut181l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT181L_FVB_SHIFT		8
#define GFXMMU_LUT181L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut181l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT181L_EN Enable **/
#define GFXMMU_LUT181L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut181h LUT181H Graphic MMU LUT entry 181 high
@{*/


#define GFXMMU_LUT181H_LO_SHIFT		4
#define GFXMMU_LUT181H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut181h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut182l LUT182L Graphic MMU LUT entry 182 low
@{*/


#define GFXMMU_LUT182L_LVB_SHIFT		16
#define GFXMMU_LUT182L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut182l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT182L_FVB_SHIFT		8
#define GFXMMU_LUT182L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut182l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT182L_EN Enable **/
#define GFXMMU_LUT182L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut182h LUT182H Graphic MMU LUT entry 182 high
@{*/


#define GFXMMU_LUT182H_LO_SHIFT		4
#define GFXMMU_LUT182H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut182h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut183l LUT183L Graphic MMU LUT entry 183 low
@{*/


#define GFXMMU_LUT183L_LVB_SHIFT		16
#define GFXMMU_LUT183L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut183l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT183L_FVB_SHIFT		8
#define GFXMMU_LUT183L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut183l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT183L_EN Enable **/
#define GFXMMU_LUT183L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut183h LUT183H Graphic MMU LUT entry 183 high
@{*/


#define GFXMMU_LUT183H_LO_SHIFT		4
#define GFXMMU_LUT183H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut183h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut184l LUT184L Graphic MMU LUT entry 184 low
@{*/


#define GFXMMU_LUT184L_LVB_SHIFT		16
#define GFXMMU_LUT184L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut184l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT184L_FVB_SHIFT		8
#define GFXMMU_LUT184L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut184l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT184L_EN Enable **/
#define GFXMMU_LUT184L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut184h LUT184H Graphic MMU LUT entry 184 high
@{*/


#define GFXMMU_LUT184H_LO_SHIFT		4
#define GFXMMU_LUT184H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut184h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut185l LUT185L Graphic MMU LUT entry 185 low
@{*/


#define GFXMMU_LUT185L_LVB_SHIFT		16
#define GFXMMU_LUT185L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut185l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT185L_FVB_SHIFT		8
#define GFXMMU_LUT185L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut185l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT185L_EN Enable **/
#define GFXMMU_LUT185L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut185h LUT185H Graphic MMU LUT entry 185 high
@{*/


#define GFXMMU_LUT185H_LO_SHIFT		4
#define GFXMMU_LUT185H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut185h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut186l LUT186L Graphic MMU LUT entry 186 low
@{*/


#define GFXMMU_LUT186L_LVB_SHIFT		16
#define GFXMMU_LUT186L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut186l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT186L_FVB_SHIFT		8
#define GFXMMU_LUT186L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut186l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT186L_EN Enable **/
#define GFXMMU_LUT186L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut186h LUT186H Graphic MMU LUT entry 186 high
@{*/


#define GFXMMU_LUT186H_LO_SHIFT		4
#define GFXMMU_LUT186H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut186h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut187l LUT187L Graphic MMU LUT entry 187 low
@{*/


#define GFXMMU_LUT187L_LVB_SHIFT		16
#define GFXMMU_LUT187L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut187l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT187L_FVB_SHIFT		8
#define GFXMMU_LUT187L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut187l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT187L_EN Enable **/
#define GFXMMU_LUT187L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut187h LUT187H Graphic MMU LUT entry 187 high
@{*/


#define GFXMMU_LUT187H_LO_SHIFT		4
#define GFXMMU_LUT187H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut187h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut188l LUT188L Graphic MMU LUT entry 188 low
@{*/


#define GFXMMU_LUT188L_LVB_SHIFT		16
#define GFXMMU_LUT188L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut188l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT188L_FVB_SHIFT		8
#define GFXMMU_LUT188L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut188l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT188L_EN Enable **/
#define GFXMMU_LUT188L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut188h LUT188H Graphic MMU LUT entry 188 high
@{*/


#define GFXMMU_LUT188H_LO_SHIFT		4
#define GFXMMU_LUT188H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut188h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut189l LUT189L Graphic MMU LUT entry 189 low
@{*/


#define GFXMMU_LUT189L_LVB_SHIFT		16
#define GFXMMU_LUT189L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut189l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT189L_FVB_SHIFT		8
#define GFXMMU_LUT189L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut189l_fvb FVB First Valid Block
@{*/
/**@}*/

