grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT189L_EN Enable **/
#define GFXMMU_LUT189L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut189h LUT189H Graphic MMU LUT entry 189 high
@{*/


#define GFXMMU_LUT189H_LO_SHIFT		4
#define GFXMMU_LUT189H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut189h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut190l LUT190L Graphic MMU LUT entry 190 low
@{*/


#define GFXMMU_LUT190L_LVB_SHIFT		16
#define GFXMMU_LUT190L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut190l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT190L_FVB_SHIFT		8
#define GFXMMU_LUT190L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut190l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT190L_EN Enable **/
#define GFXMMU_LUT190L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut190h LUT190H Graphic MMU LUT entry 190 high
@{*/


#define GFXMMU_LUT190H_LO_SHIFT		4
#define GFXMMU_LUT190H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut190h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut191l LUT191L Graphic MMU LUT entry 191 low
@{*/


#define GFXMMU_LUT191L_LVB_SHIFT		16
#define GFXMMU_LUT191L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut191l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT191L_FVB_SHIFT		8
#define GFXMMU_LUT191L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut191l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT191L_EN Enable **/
#define GFXMMU_LUT191L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut191h LUT191H Graphic MMU LUT entry 191 high
@{*/


#define GFXMMU_LUT191H_LO_SHIFT		4
#define GFXMMU_LUT191H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut191h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut192l LUT192L Graphic MMU LUT entry 192 low
@{*/


#define GFXMMU_LUT192L_LVB_SHIFT		16
#define GFXMMU_LUT192L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut192l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT192L_FVB_SHIFT		8
#define GFXMMU_LUT192L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut192l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT192L_EN Enable **/
#define GFXMMU_LUT192L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut192h LUT192H Graphic MMU LUT entry 192 high
@{*/


#define GFXMMU_LUT192H_LO_SHIFT		4
#define GFXMMU_LUT192H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut192h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut193l LUT193L Graphic MMU LUT entry 193 low
@{*/


#define GFXMMU_LUT193L_LVB_SHIFT		16
#define GFXMMU_LUT193L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut193l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT193L_FVB_SHIFT		8
#define GFXMMU_LUT193L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut193l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT193L_EN Enable **/
#define GFXMMU_LUT193L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut193h LUT193H Graphic MMU LUT entry 193 high
@{*/


#define GFXMMU_LUT193H_LO_SHIFT		4
#define GFXMMU_LUT193H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut193h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut194l LUT194L Graphic MMU LUT entry 194 low
@{*/


#define GFXMMU_LUT194L_LVB_SHIFT		16
#define GFXMMU_LUT194L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut194l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT194L_FVB_SHIFT		8
#define GFXMMU_LUT194L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut194l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT194L_EN Enable **/
#define GFXMMU_LUT194L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut194h LUT194H Graphic MMU LUT entry 194 high
@{*/


#define GFXMMU_LUT194H_LO_SHIFT		4
#define GFXMMU_LUT194H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut194h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut195l LUT195L Graphic MMU LUT entry 195 low
@{*/


#define GFXMMU_LUT195L_LVB_SHIFT		16
#define GFXMMU_LUT195L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut195l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT195L_FVB_SHIFT		8
#define GFXMMU_LUT195L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut195l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT195L_EN Enable **/
#define GFXMMU_LUT195L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut195h LUT195H Graphic MMU LUT entry 195 high
@{*/


#define GFXMMU_LUT195H_LO_SHIFT		4
#define GFXMMU_LUT195H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut195h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut196l LUT196L Graphic MMU LUT entry 196 low
@{*/


#define GFXMMU_LUT196L_LVB_SHIFT		16
#define GFXMMU_LUT196L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut196l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT196L_FVB_SHIFT		8
#define GFXMMU_LUT196L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut196l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT196L_EN Enable **/
#define GFXMMU_LUT196L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut196h LUT196H Graphic MMU LUT entry 196 high
@{*/


#define GFXMMU_LUT196H_LO_SHIFT		4
#define GFXMMU_LUT196H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut196h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut197l LUT197L Graphic MMU LUT entry 197 low
@{*/


#define GFXMMU_LUT197L_LVB_SHIFT		16
#define GFXMMU_LUT197L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut197l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT197L_FVB_SHIFT		8
#define GFXMMU_LUT197L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut197l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT197L_EN Enable **/
#define GFXMMU_LUT197L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut197h LUT197H Graphic MMU LUT entry 197 high
@{*/


#define GFXMMU_LUT197H_LO_SHIFT		4
#define GFXMMU_LUT197H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut197h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut198l LUT198L Graphic MMU LUT entry 198 low
@{*/


#define GFXMMU_LUT198L_LVB_SHIFT		16
#define GFXMMU_LUT198L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut198l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT198L_FVB_SHIFT		8
#define GFXMMU_LUT198L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut198l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT198L_EN Enable **/
#define GFXMMU_LUT198L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut198h LUT198H Graphic MMU LUT entry 198 high
@{*/


#define GFXMMU_LUT198H_LO_SHIFT		4
#define GFXMMU_LUT198H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut198h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut199l LUT199L Graphic MMU LUT entry 199 low
@{*/


