grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT199L_LVB_SHIFT		16
#define GFXMMU_LUT199L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut199l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT199L_FVB_SHIFT		8
#define GFXMMU_LUT199L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut199l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT199L_EN Enable **/
#define GFXMMU_LUT199L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut199h LUT199H Graphic MMU LUT entry 199 high
@{*/


#define GFXMMU_LUT199H_LO_SHIFT		4
#define GFXMMU_LUT199H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut199h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut200l LUT200L Graphic MMU LUT entry 200 low
@{*/


#define GFXMMU_LUT200L_LVB_SHIFT		16
#define GFXMMU_LUT200L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut200l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT200L_FVB_SHIFT		8
#define GFXMMU_LUT200L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut200l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT200L_EN Enable **/
#define GFXMMU_LUT200L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut200h LUT200H Graphic MMU LUT entry 200 high
@{*/


#define GFXMMU_LUT200H_LO_SHIFT		4
#define GFXMMU_LUT200H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut200h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut201l LUT201L Graphic MMU LUT entry 201 low
@{*/


#define GFXMMU_LUT201L_LVB_SHIFT		16
#define GFXMMU_LUT201L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut201l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT201L_FVB_SHIFT		8
#define GFXMMU_LUT201L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut201l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT201L_EN Enable **/
#define GFXMMU_LUT201L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut201h LUT201H Graphic MMU LUT entry 201 high
@{*/


#define GFXMMU_LUT201H_LO_SHIFT		4
#define GFXMMU_LUT201H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut201h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut202l LUT202L Graphic MMU LUT entry 202 low
@{*/


#define GFXMMU_LUT202L_LVB_SHIFT		16
#define GFXMMU_LUT202L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut202l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT202L_FVB_SHIFT		8
#define GFXMMU_LUT202L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut202l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT202L_EN Enable **/
#define GFXMMU_LUT202L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut202h LUT202H Graphic MMU LUT entry 202 high
@{*/


#define GFXMMU_LUT202H_LO_SHIFT		4
#define GFXMMU_LUT202H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut202h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut203l LUT203L Graphic MMU LUT entry 203 low
@{*/


#define GFXMMU_LUT203L_LVB_SHIFT		16
#define GFXMMU_LUT203L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut203l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT203L_FVB_SHIFT		8
#define GFXMMU_LUT203L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut203l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT203L_EN Enable **/
#define GFXMMU_LUT203L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut203h LUT203H Graphic MMU LUT entry 203 high
@{*/


#define GFXMMU_LUT203H_LO_SHIFT		4
#define GFXMMU_LUT203H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut203h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut204l LUT204L Graphic MMU LUT entry 204 low
@{*/


#define GFXMMU_LUT204L_LVB_SHIFT		16
#define GFXMMU_LUT204L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut204l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT204L_FVB_SHIFT		8
#define GFXMMU_LUT204L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut204l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT204L_EN Enable **/
#define GFXMMU_LUT204L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut204h LUT204H Graphic MMU LUT entry 204 high
@{*/


#define GFXMMU_LUT204H_LO_SHIFT		4
#define GFXMMU_LUT204H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut204h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut205l LUT205L Graphic MMU LUT entry 205 low
@{*/


#define GFXMMU_LUT205L_LVB_SHIFT		16
#define GFXMMU_LUT205L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut205l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT205L_FVB_SHIFT		8
#define GFXMMU_LUT205L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut205l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT205L_EN Enable **/
#define GFXMMU_LUT205L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut205h LUT205H Graphic MMU LUT entry 205 high
@{*/


#define GFXMMU_LUT205H_LO_SHIFT		4
#define GFXMMU_LUT205H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut205h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut206l LUT206L Graphic MMU LUT entry 206 low
@{*/


#define GFXMMU_LUT206L_LVB_SHIFT		16
#define GFXMMU_LUT206L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut206l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT206L_FVB_SHIFT		8
#define GFXMMU_LUT206L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut206l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT206L_EN Enable **/
#define GFXMMU_LUT206L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut206h LUT206H Graphic MMU LUT entry 206 high
@{*/


#define GFXMMU_LUT206H_LO_SHIFT		4
#define GFXMMU_LUT206H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut206h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut207l LUT207L Graphic MMU LUT entry 207 low
@{*/


#define GFXMMU_LUT207L_LVB_SHIFT		16
#define GFXMMU_LUT207L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut207l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT207L_FVB_SHIFT		8
#define GFXMMU_LUT207L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut207l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT207L_EN Enable **/
#define GFXMMU_LUT207L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut207h LUT207H Graphic MMU LUT entry 207 high
@{*/


#define GFXMMU_LUT207H_LO_SHIFT		4
#define GFXMMU_LUT207H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut207h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut208l LUT208L Graphic MMU LUT entry 208 low
@{*/


#define GFXMMU_LUT208L_LVB_SHIFT		16
#define GFXMMU_LUT208L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut208l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT208L_FVB_SHIFT		8
#define GFXMMU_LUT208L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut208l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT208L_EN Enable **/
#define GFXMMU_LUT208L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut208h LUT208H Graphic MMU LUT entry 208 high
@{*/


#define GFXMMU_LUT208H_LO_SHIFT		4
#define GFXMMU_LUT208H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut208h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut209l LUT209L Graphic MMU LUT entry 209 low
@{*/


#define GFXMMU_LUT209L_LVB_SHIFT		16
#define GFXMMU_LUT209L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut209l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT209L_FVB_SHIFT		8
#define GFXMMU_LUT209L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut209l_fvb FVB First Valid Block
@{*/
/**@}*/

