grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT209L_EN Enable **/
#define GFXMMU_LUT209L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut209h LUT209H Graphic MMU LUT entry 209 high
@{*/


#define GFXMMU_LUT209H_LO_SHIFT		4
#define GFXMMU_LUT209H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut209h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut210l LUT210L Graphic MMU LUT entry 210 low
@{*/


#define GFXMMU_LUT210L_LVB_SHIFT		16
#define GFXMMU_LUT210L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut210l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT210L_FVB_SHIFT		8
#define GFXMMU_LUT210L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut210l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT210L_EN Enable **/
#define GFXMMU_LUT210L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut210h LUT210H Graphic MMU LUT entry 210 high
@{*/


#define GFXMMU_LUT210H_LO_SHIFT		4
#define GFXMMU_LUT210H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut210h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut211l LUT211L Graphic MMU LUT entry 211 low
@{*/


#define GFXMMU_LUT211L_LVB_SHIFT		16
#define GFXMMU_LUT211L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut211l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT211L_FVB_SHIFT		8
#define GFXMMU_LUT211L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut211l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT211L_EN Enable **/
#define GFXMMU_LUT211L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut211h LUT211H Graphic MMU LUT entry 211 high
@{*/


#define GFXMMU_LUT211H_LO_SHIFT		4
#define GFXMMU_LUT211H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut211h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut212l LUT212L Graphic MMU LUT entry 212 low
@{*/


#define GFXMMU_LUT212L_LVB_SHIFT		16
#define GFXMMU_LUT212L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut212l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT212L_FVB_SHIFT		8
#define GFXMMU_LUT212L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut212l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT212L_EN Enable **/
#define GFXMMU_LUT212L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut212h LUT212H Graphic MMU LUT entry 212 high
@{*/


#define GFXMMU_LUT212H_LO_SHIFT		4
#define GFXMMU_LUT212H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut212h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut213l LUT213L Graphic MMU LUT entry 213 low
@{*/


#define GFXMMU_LUT213L_LVB_SHIFT		16
#define GFXMMU_LUT213L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut213l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT213L_FVB_SHIFT		8
#define GFXMMU_LUT213L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut213l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT213L_EN Enable **/
#define GFXMMU_LUT213L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut213h LUT213H Graphic MMU LUT entry 213 high
@{*/


#define GFXMMU_LUT213H_LO_SHIFT		4
#define GFXMMU_LUT213H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut213h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut214l LUT214L Graphic MMU LUT entry 214 low
@{*/


#define GFXMMU_LUT214L_LVB_SHIFT		16
#define GFXMMU_LUT214L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut214l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT214L_FVB_SHIFT		8
#define GFXMMU_LUT214L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut214l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT214L_EN Enable **/
#define GFXMMU_LUT214L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut214h LUT214H Graphic MMU LUT entry 214 high
@{*/


#define GFXMMU_LUT214H_LO_SHIFT		4
#define GFXMMU_LUT214H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut214h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut215l LUT215L Graphic MMU LUT entry 215 low
@{*/


#define GFXMMU_LUT215L_LVB_SHIFT		16
#define GFXMMU_LUT215L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut215l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT215L_FVB_SHIFT		8
#define GFXMMU_LUT215L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut215l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT215L_EN Enable **/
#define GFXMMU_LUT215L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut215h LUT215H Graphic MMU LUT entry 215 high
@{*/


#define GFXMMU_LUT215H_LO_SHIFT		4
#define GFXMMU_LUT215H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut215h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut216l LUT216L Graphic MMU LUT entry 216 low
@{*/


#define GFXMMU_LUT216L_LVB_SHIFT		16
#define GFXMMU_LUT216L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut216l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT216L_FVB_SHIFT		8
#define GFXMMU_LUT216L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut216l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT216L_EN Enable **/
#define GFXMMU_LUT216L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut216h LUT216H Graphic MMU LUT entry 216 high
@{*/


#define GFXMMU_LUT216H_LO_SHIFT		4
#define GFXMMU_LUT216H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut216h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut217l LUT217L Graphic MMU LUT entry 217 low
@{*/


#define GFXMMU_LUT217L_LVB_SHIFT		16
#define GFXMMU_LUT217L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut217l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT217L_FVB_SHIFT		8
#define GFXMMU_LUT217L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut217l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT217L_EN Enable **/
#define GFXMMU_LUT217L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut217h LUT217H Graphic MMU LUT entry 217 high
@{*/


#define GFXMMU_LUT217H_LO_SHIFT		4
#define GFXMMU_LUT217H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut217h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut218l LUT218L Graphic MMU LUT entry 218 low
@{*/


#define GFXMMU_LUT218L_LVB_SHIFT		16
#define GFXMMU_LUT218L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut218l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT218L_FVB_SHIFT		8
#define GFXMMU_LUT218L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut218l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT218L_EN Enable **/
#define GFXMMU_LUT218L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut218h LUT218H Graphic MMU LUT entry 218 high
@{*/


#define GFXMMU_LUT218H_LO_SHIFT		4
#define GFXMMU_LUT218H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut218h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut219l LUT219L Graphic MMU LUT entry 219 low
@{*/


