grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT219L_LVB_SHIFT		16
#define GFXMMU_LUT219L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut219l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT219L_FVB_SHIFT		8
#define GFXMMU_LUT219L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut219l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT219L_EN Enable **/
#define GFXMMU_LUT219L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut219h LUT219H Graphic MMU LUT entry 219 high
@{*/


#define GFXMMU_LUT219H_LO_SHIFT		4
#define GFXMMU_LUT219H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut219h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut220l LUT220L Graphic MMU LUT entry 220 low
@{*/


#define GFXMMU_LUT220L_LVB_SHIFT		16
#define GFXMMU_LUT220L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut220l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT220L_FVB_SHIFT		8
#define GFXMMU_LUT220L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut220l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT220L_EN Enable **/
#define GFXMMU_LUT220L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut220h LUT220H Graphic MMU LUT entry 220 high
@{*/


#define GFXMMU_LUT220H_LO_SHIFT		4
#define GFXMMU_LUT220H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut220h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut221l LUT221L Graphic MMU LUT entry 221 low
@{*/


#define GFXMMU_LUT221L_LVB_SHIFT		16
#define GFXMMU_LUT221L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut221l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT221L_FVB_SHIFT		8
#define GFXMMU_LUT221L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut221l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT221L_EN Enable **/
#define GFXMMU_LUT221L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut221h LUT221H Graphic MMU LUT entry 221 high
@{*/


#define GFXMMU_LUT221H_LO_SHIFT		4
#define GFXMMU_LUT221H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut221h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut222l LUT222L Graphic MMU LUT entry 222 low
@{*/


#define GFXMMU_LUT222L_LVB_SHIFT		16
#define GFXMMU_LUT222L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut222l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT222L_FVB_SHIFT		8
#define GFXMMU_LUT222L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut222l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT222L_EN Enable **/
#define GFXMMU_LUT222L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut222h LUT222H Graphic MMU LUT entry 222 high
@{*/


#define GFXMMU_LUT222H_LO_SHIFT		4
#define GFXMMU_LUT222H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut222h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut223l LUT223L Graphic MMU LUT entry 223 low
@{*/


#define GFXMMU_LUT223L_LVB_SHIFT		16
#define GFXMMU_LUT223L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut223l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT223L_FVB_SHIFT		8
#define GFXMMU_LUT223L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut223l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT223L_EN Enable **/
#define GFXMMU_LUT223L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut223h LUT223H Graphic MMU LUT entry 223 high
@{*/


#define GFXMMU_LUT223H_LO_SHIFT		4
#define GFXMMU_LUT223H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut223h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut224l LUT224L Graphic MMU LUT entry 224 low
@{*/


#define GFXMMU_LUT224L_LVB_SHIFT		16
#define GFXMMU_LUT224L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut224l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT224L_FVB_SHIFT		8
#define GFXMMU_LUT224L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut224l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT224L_EN Enable **/
#define GFXMMU_LUT224L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut224h LUT224H Graphic MMU LUT entry 224 high
@{*/


#define GFXMMU_LUT224H_LO_SHIFT		4
#define GFXMMU_LUT224H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut224h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut225l LUT225L Graphic MMU LUT entry 225 low
@{*/


#define GFXMMU_LUT225L_LVB_SHIFT		16
#define GFXMMU_LUT225L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut225l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT225L_FVB_SHIFT		8
#define GFXMMU_LUT225L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut225l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT225L_EN Enable **/
#define GFXMMU_LUT225L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut225h LUT225H Graphic MMU LUT entry 225 high
@{*/


#define GFXMMU_LUT225H_LO_SHIFT		4
#define GFXMMU_LUT225H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut225h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut226l LUT226L Graphic MMU LUT entry 226 low
@{*/


#define GFXMMU_LUT226L_LVB_SHIFT		16
#define GFXMMU_LUT226L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut226l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT226L_FVB_SHIFT		8
#define GFXMMU_LUT226L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut226l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT226L_EN Enable **/
#define GFXMMU_LUT226L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut226h LUT226H Graphic MMU LUT entry 226 high
@{*/


#define GFXMMU_LUT226H_LO_SHIFT		4
#define GFXMMU_LUT226H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut226h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut227l LUT227L Graphic MMU LUT entry 227 low
@{*/


#define GFXMMU_LUT227L_LVB_SHIFT		16
#define GFXMMU_LUT227L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut227l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT227L_FVB_SHIFT		8
#define GFXMMU_LUT227L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut227l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT227L_EN Enable **/
#define GFXMMU_LUT227L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut227h LUT227H Graphic MMU LUT entry 227 high
@{*/


#define GFXMMU_LUT227H_LO_SHIFT		4
#define GFXMMU_LUT227H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut227h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut228l LUT228L Graphic MMU LUT entry 228 low
@{*/


#define GFXMMU_LUT228L_LVB_SHIFT		16
#define GFXMMU_LUT228L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut228l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT228L_FVB_SHIFT		8
#define GFXMMU_LUT228L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut228l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT228L_EN Enable **/
#define GFXMMU_LUT228L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut228h LUT228H Graphic MMU LUT entry 228 high
@{*/


#define GFXMMU_LUT228H_LO_SHIFT		4
#define GFXMMU_LUT228H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut228h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut229l LUT229L Graphic MMU LUT entry 229 low
@{*/


