grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT229L_LVB_SHIFT		16
#define GFXMMU_LUT229L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut229l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT229L_FVB_SHIFT		8
#define GFXMMU_LUT229L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut229l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT229L_EN Enable **/
#define GFXMMU_LUT229L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut229h LUT229H Graphic MMU LUT entry 229 high
@{*/


#define GFXMMU_LUT229H_LO_SHIFT		4
#define GFXMMU_LUT229H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut229h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut230l LUT230L Graphic MMU LUT entry 230 low
@{*/


#define GFXMMU_LUT230L_LVB_SHIFT		16
#define GFXMMU_LUT230L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut230l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT230L_FVB_SHIFT		8
#define GFXMMU_LUT230L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut230l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT230L_EN Enable **/
#define GFXMMU_LUT230L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut230h LUT230H Graphic MMU LUT entry 230 high
@{*/


#define GFXMMU_LUT230H_LO_SHIFT		4
#define GFXMMU_LUT230H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut230h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut231l LUT231L Graphic MMU LUT entry 231 low
@{*/


#define GFXMMU_LUT231L_LVB_SHIFT		16
#define GFXMMU_LUT231L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut231l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT231L_FVB_SHIFT		8
#define GFXMMU_LUT231L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut231l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT231L_EN Enable **/
#define GFXMMU_LUT231L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut231h LUT231H Graphic MMU LUT entry 231 high
@{*/


#define GFXMMU_LUT231H_LO_SHIFT		4
#define GFXMMU_LUT231H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut231h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut232l LUT232L Graphic MMU LUT entry 232 low
@{*/


#define GFXMMU_LUT232L_LVB_SHIFT		16
#define GFXMMU_LUT232L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut232l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT232L_FVB_SHIFT		8
#define GFXMMU_LUT232L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut232l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT232L_EN Enable **/
#define GFXMMU_LUT232L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut232h LUT232H Graphic MMU LUT entry 232 high
@{*/


#define GFXMMU_LUT232H_LO_SHIFT		4
#define GFXMMU_LUT232H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut232h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut233l LUT233L Graphic MMU LUT entry 233 low
@{*/


#define GFXMMU_LUT233L_LVB_SHIFT		16
#define GFXMMU_LUT233L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut233l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT233L_FVB_SHIFT		8
#define GFXMMU_LUT233L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut233l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT233L_EN Enable **/
#define GFXMMU_LUT233L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut233h LUT233H Graphic MMU LUT entry 233 high
@{*/


#define GFXMMU_LUT233H_LO_SHIFT		4
#define GFXMMU_LUT233H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut233h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut234l LUT234L Graphic MMU LUT entry 234 low
@{*/


#define GFXMMU_LUT234L_LVB_SHIFT		16
#define GFXMMU_LUT234L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut234l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT234L_FVB_SHIFT		8
#define GFXMMU_LUT234L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut234l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT234L_EN Enable **/
#define GFXMMU_LUT234L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut234h LUT234H Graphic MMU LUT entry 234 high
@{*/


#define GFXMMU_LUT234H_LO_SHIFT		4
#define GFXMMU_LUT234H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut234h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut235l LUT235L Graphic MMU LUT entry 235 low
@{*/


#define GFXMMU_LUT235L_LVB_SHIFT		16
#define GFXMMU_LUT235L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut235l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT235L_FVB_SHIFT		8
#define GFXMMU_LUT235L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut235l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT235L_EN Enable **/
#define GFXMMU_LUT235L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut235h LUT235H Graphic MMU LUT entry 235 high
@{*/


#define GFXMMU_LUT235H_LO_SHIFT		4
#define GFXMMU_LUT235H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut235h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut236l LUT236L Graphic MMU LUT entry 236 low
@{*/


#define GFXMMU_LUT236L_LVB_SHIFT		16
#define GFXMMU_LUT236L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut236l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT236L_FVB_SHIFT		8
#define GFXMMU_LUT236L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut236l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT236L_EN Enable **/
#define GFXMMU_LUT236L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut236h LUT236H Graphic MMU LUT entry 236 high
@{*/


#define GFXMMU_LUT236H_LO_SHIFT		4
#define GFXMMU_LUT236H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut236h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut237l LUT237L Graphic MMU LUT entry 237 low
@{*/


#define GFXMMU_LUT237L_LVB_SHIFT		16
#define GFXMMU_LUT237L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut237l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT237L_FVB_SHIFT		8
#define GFXMMU_LUT237L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut237l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT237L_EN Enable **/
#define GFXMMU_LUT237L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut237h LUT237H Graphic MMU LUT entry 237 high
@{*/


#define GFXMMU_LUT237H_LO_SHIFT		4
#define GFXMMU_LUT237H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut237h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut238l LUT238L Graphic MMU LUT entry 238 low
@{*/


#define GFXMMU_LUT238L_LVB_SHIFT		16
#define GFXMMU_LUT238L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut238l_lvb LVB Last Valid Block
@{*/
/**@}*/


