grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT238L_FVB_SHIFT		8
#define GFXMMU_LUT238L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut238l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT238L_EN Enable **/
#define GFXMMU_LUT238L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut238h LUT238H Graphic MMU LUT entry 238 high
@{*/


#define GFXMMU_LUT238H_LO_SHIFT		4
#define GFXMMU_LUT238H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut238h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut239l LUT239L Graphic MMU LUT entry 239 low
@{*/


#define GFXMMU_LUT239L_LVB_SHIFT		16
#define GFXMMU_LUT239L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut239l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT239L_FVB_SHIFT		8
#define GFXMMU_LUT239L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut239l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT239L_EN Enable **/
#define GFXMMU_LUT239L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut239h LUT239H Graphic MMU LUT entry 239 high
@{*/


#define GFXMMU_LUT239H_LO_SHIFT		4
#define GFXMMU_LUT239H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut239h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut240l LUT240L Graphic MMU LUT entry 240 low
@{*/


#define GFXMMU_LUT240L_LVB_SHIFT		16
#define GFXMMU_LUT240L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut240l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT240L_FVB_SHIFT		8
#define GFXMMU_LUT240L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut240l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT240L_EN Enable **/
#define GFXMMU_LUT240L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut240h LUT240H Graphic MMU LUT entry 240 high
@{*/


#define GFXMMU_LUT240H_LO_SHIFT		4
#define GFXMMU_LUT240H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut240h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut241l LUT241L Graphic MMU LUT entry 241 low
@{*/


#define GFXMMU_LUT241L_LVB_SHIFT		16
#define GFXMMU_LUT241L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut241l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT241L_FVB_SHIFT		8
#define GFXMMU_LUT241L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut241l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT241L_EN Enable **/
#define GFXMMU_LUT241L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut241h LUT241H Graphic MMU LUT entry 241 high
@{*/


#define GFXMMU_LUT241H_LO_SHIFT		4
#define GFXMMU_LUT241H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut241h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut242l LUT242L Graphic MMU LUT entry 242 low
@{*/


#define GFXMMU_LUT242L_LVB_SHIFT		16
#define GFXMMU_LUT242L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut242l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT242L_FVB_SHIFT		8
#define GFXMMU_LUT242L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut242l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT242L_EN Enable **/
#define GFXMMU_LUT242L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut242h LUT242H Graphic MMU LUT entry 242 high
@{*/


#define GFXMMU_LUT242H_LO_SHIFT		4
#define GFXMMU_LUT242H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut242h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut243l LUT243L Graphic MMU LUT entry 243 low
@{*/


#define GFXMMU_LUT243L_LVB_SHIFT		16
#define GFXMMU_LUT243L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut243l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT243L_FVB_SHIFT		8
#define GFXMMU_LUT243L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut243l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT243L_EN Enable **/
#define GFXMMU_LUT243L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut243h LUT243H Graphic MMU LUT entry 243 high
@{*/


#define GFXMMU_LUT243H_LO_SHIFT		4
#define GFXMMU_LUT243H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut243h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut244l LUT244L Graphic MMU LUT entry 244 low
@{*/


#define GFXMMU_LUT244L_LVB_SHIFT		16
#define GFXMMU_LUT244L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut244l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT244L_FVB_SHIFT		8
#define GFXMMU_LUT244L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut244l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT244L_EN Enable **/
#define GFXMMU_LUT244L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut244h LUT244H Graphic MMU LUT entry 244 high
@{*/


#define GFXMMU_LUT244H_LO_SHIFT		4
#define GFXMMU_LUT244H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut244h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut245l LUT245L Graphic MMU LUT entry 245 low
@{*/


#define GFXMMU_LUT245L_LVB_SHIFT		16
#define GFXMMU_LUT245L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut245l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT245L_FVB_SHIFT		8
#define GFXMMU_LUT245L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut245l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT245L_EN Enable **/
#define GFXMMU_LUT245L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut245h LUT245H Graphic MMU LUT entry 245 high
@{*/


#define GFXMMU_LUT245H_LO_SHIFT		4
#define GFXMMU_LUT245H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut245h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut246l LUT246L Graphic MMU LUT entry 246 low
@{*/


#define GFXMMU_LUT246L_LVB_SHIFT		16
#define GFXMMU_LUT246L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut246l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT246L_FVB_SHIFT		8
#define GFXMMU_LUT246L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut246l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT246L_EN Enable **/
#define GFXMMU_LUT246L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut246h LUT246H Graphic MMU LUT entry 246 high
@{*/


#define GFXMMU_LUT246H_LO_SHIFT		4
#define GFXMMU_LUT246H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut246h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut247l LUT247L Graphic MMU LUT entry 247 low
@{*/


#define GFXMMU_LUT247L_LVB_SHIFT		16
#define GFXMMU_LUT247L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut247l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT247L_FVB_SHIFT		8
#define GFXMMU_LUT247L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut247l_fvb FVB First Valid Block
@{*/
/**@}*/

