grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT247L_EN Enable **/
#define GFXMMU_LUT247L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut247h LUT247H Graphic MMU LUT entry 247 high
@{*/


#define GFXMMU_LUT247H_LO_SHIFT		4
#define GFXMMU_LUT247H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut247h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut248l LUT248L Graphic MMU LUT entry 248 low
@{*/


#define GFXMMU_LUT248L_LVB_SHIFT		16
#define GFXMMU_LUT248L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut248l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT248L_FVB_SHIFT		8
#define GFXMMU_LUT248L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut248l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT248L_EN Enable **/
#define GFXMMU_LUT248L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut248h LUT248H Graphic MMU LUT entry 248 high
@{*/


#define GFXMMU_LUT248H_LO_SHIFT		4
#define GFXMMU_LUT248H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut248h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut249l LUT249L Graphic MMU LUT entry 249 low
@{*/


#define GFXMMU_LUT249L_LVB_SHIFT		16
#define GFXMMU_LUT249L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut249l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT249L_FVB_SHIFT		8
#define GFXMMU_LUT249L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut249l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT249L_EN Enable **/
#define GFXMMU_LUT249L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut249h LUT249H Graphic MMU LUT entry 249 high
@{*/


#define GFXMMU_LUT249H_LO_SHIFT		4
#define GFXMMU_LUT249H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut249h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut250l LUT250L Graphic MMU LUT entry 250 low
@{*/


#define GFXMMU_LUT250L_LVB_SHIFT		16
#define GFXMMU_LUT250L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut250l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT250L_FVB_SHIFT		8
#define GFXMMU_LUT250L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut250l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT250L_EN Enable **/
#define GFXMMU_LUT250L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut250h LUT250H Graphic MMU LUT entry 250 high
@{*/


#define GFXMMU_LUT250H_LO_SHIFT		4
#define GFXMMU_LUT250H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut250h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut251l LUT251L Graphic MMU LUT entry 251 low
@{*/


#define GFXMMU_LUT251L_LVB_SHIFT		16
#define GFXMMU_LUT251L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut251l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT251L_FVB_SHIFT		8
#define GFXMMU_LUT251L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut251l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT251L_EN Enable **/
#define GFXMMU_LUT251L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut251h LUT251H Graphic MMU LUT entry 251 high
@{*/


#define GFXMMU_LUT251H_LO_SHIFT		4
#define GFXMMU_LUT251H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut251h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut252l LUT252L Graphic MMU LUT entry 252 low
@{*/


#define GFXMMU_LUT252L_LVB_SHIFT		16
#define GFXMMU_LUT252L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut252l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT252L_FVB_SHIFT		8
#define GFXMMU_LUT252L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut252l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT252L_EN Enable **/
#define GFXMMU_LUT252L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut252h LUT252H Graphic MMU LUT entry 252 high
@{*/


#define GFXMMU_LUT252H_LO_SHIFT		4
#define GFXMMU_LUT252H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut252h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut253l LUT253L Graphic MMU LUT entry 253 low
@{*/


#define GFXMMU_LUT253L_LVB_SHIFT		16
#define GFXMMU_LUT253L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut253l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT253L_FVB_SHIFT		8
#define GFXMMU_LUT253L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut253l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT253L_EN Enable **/
#define GFXMMU_LUT253L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut253h LUT253H Graphic MMU LUT entry 253 high
@{*/


#define GFXMMU_LUT253H_LO_SHIFT		4
#define GFXMMU_LUT253H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut253h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut254l LUT254L Graphic MMU LUT entry 254 low
@{*/


#define GFXMMU_LUT254L_LVB_SHIFT		16
#define GFXMMU_LUT254L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut254l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT254L_FVB_SHIFT		8
#define GFXMMU_LUT254L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut254l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT254L_EN Enable **/
#define GFXMMU_LUT254L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut254h LUT254H Graphic MMU LUT entry 254 high
@{*/


#define GFXMMU_LUT254H_LO_SHIFT		4
#define GFXMMU_LUT254H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut254h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut255l LUT255L Graphic MMU LUT entry 255 low
@{*/


#define GFXMMU_LUT255L_LVB_SHIFT		16
#define GFXMMU_LUT255L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut255l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT255L_FVB_SHIFT		8
#define GFXMMU_LUT255L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut255l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT255L_EN Enable **/
#define GFXMMU_LUT255L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut255h LUT255H Graphic MMU LUT entry 255 high
@{*/


#define GFXMMU_LUT255H_LO_SHIFT		4
#define GFXMMU_LUT255H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut255h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut256l LUT256L Graphic MMU LUT entry 256 low
@{*/


#define GFXMMU_LUT256L_LVB_SHIFT		16
#define GFXMMU_LUT256L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut256l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT256L_FVB_SHIFT		8
#define GFXMMU_LUT256L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut256l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT256L_EN Enable **/
#define GFXMMU_LUT256L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut256h LUT256H Graphic MMU LUT entry 256 high
@{*/


#define GFXMMU_LUT256H_LO_SHIFT		4
#define GFXMMU_LUT256H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut256h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut257l LUT257L Graphic MMU LUT entry 257 low
@{*/


