grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT257L_LVB_SHIFT		16
#define GFXMMU_LUT257L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut257l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT257L_FVB_SHIFT		8
#define GFXMMU_LUT257L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut257l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT257L_EN Enable **/
#define GFXMMU_LUT257L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut257h LUT257H Graphic MMU LUT entry 257 high
@{*/


#define GFXMMU_LUT257H_LO_SHIFT		4
#define GFXMMU_LUT257H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut257h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut258l LUT258L Graphic MMU LUT entry 258 low
@{*/


#define GFXMMU_LUT258L_LVB_SHIFT		16
#define GFXMMU_LUT258L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut258l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT258L_FVB_SHIFT		8
#define GFXMMU_LUT258L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut258l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT258L_EN Enable **/
#define GFXMMU_LUT258L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut258h LUT258H Graphic MMU LUT entry 258 high
@{*/


#define GFXMMU_LUT258H_LO_SHIFT		4
#define GFXMMU_LUT258H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut258h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut259l LUT259L Graphic MMU LUT entry 259 low
@{*/


#define GFXMMU_LUT259L_LVB_SHIFT		16
#define GFXMMU_LUT259L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut259l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT259L_FVB_SHIFT		8
#define GFXMMU_LUT259L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut259l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT259L_EN Enable **/
#define GFXMMU_LUT259L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut259h LUT259H Graphic MMU LUT entry 259 high
@{*/


#define GFXMMU_LUT259H_LO_SHIFT		4
#define GFXMMU_LUT259H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut259h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut260l LUT260L Graphic MMU LUT entry 260 low
@{*/


#define GFXMMU_LUT260L_LVB_SHIFT		16
#define GFXMMU_LUT260L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut260l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT260L_FVB_SHIFT		8
#define GFXMMU_LUT260L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut260l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT260L_EN Enable **/
#define GFXMMU_LUT260L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut260h LUT260H Graphic MMU LUT entry 260 high
@{*/


#define GFXMMU_LUT260H_LO_SHIFT		4
#define GFXMMU_LUT260H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut260h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut261l LUT261L Graphic MMU LUT entry 261 low
@{*/


#define GFXMMU_LUT261L_LVB_SHIFT		16
#define GFXMMU_LUT261L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut261l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT261L_FVB_SHIFT		8
#define GFXMMU_LUT261L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut261l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT261L_EN Enable **/
#define GFXMMU_LUT261L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut261h LUT261H Graphic MMU LUT entry 261 high
@{*/


#define GFXMMU_LUT261H_LO_SHIFT		4
#define GFXMMU_LUT261H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut261h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut262l LUT262L Graphic MMU LUT entry 262 low
@{*/


#define GFXMMU_LUT262L_LVB_SHIFT		16
#define GFXMMU_LUT262L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut262l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT262L_FVB_SHIFT		8
#define GFXMMU_LUT262L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut262l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT262L_EN Enable **/
#define GFXMMU_LUT262L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut262h LUT262H Graphic MMU LUT entry 262 high
@{*/


#define GFXMMU_LUT262H_LO_SHIFT		4
#define GFXMMU_LUT262H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut262h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut263l LUT263L Graphic MMU LUT entry 263 low
@{*/


#define GFXMMU_LUT263L_LVB_SHIFT		16
#define GFXMMU_LUT263L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut263l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT263L_FVB_SHIFT		8
#define GFXMMU_LUT263L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut263l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT263L_EN Enable **/
#define GFXMMU_LUT263L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut263h LUT263H Graphic MMU LUT entry 263 high
@{*/


#define GFXMMU_LUT263H_LO_SHIFT		4
#define GFXMMU_LUT263H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut263h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut264l LUT264L Graphic MMU LUT entry 264 low
@{*/


#define GFXMMU_LUT264L_LVB_SHIFT		16
#define GFXMMU_LUT264L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut264l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT264L_FVB_SHIFT		8
#define GFXMMU_LUT264L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut264l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT264L_EN Enable **/
#define GFXMMU_LUT264L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut264h LUT264H Graphic MMU LUT entry 264 high
@{*/


#define GFXMMU_LUT264H_LO_SHIFT		4
#define GFXMMU_LUT264H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut264h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut265l LUT265L Graphic MMU LUT entry 265 low
@{*/


#define GFXMMU_LUT265L_LVB_SHIFT		16
#define GFXMMU_LUT265L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut265l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT265L_FVB_SHIFT		8
#define GFXMMU_LUT265L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut265l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT265L_EN Enable **/
#define GFXMMU_LUT265L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut265h LUT265H Graphic MMU LUT entry 265 high
@{*/


#define GFXMMU_LUT265H_LO_SHIFT		4
#define GFXMMU_LUT265H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut265h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut266l LUT266L Graphic MMU LUT entry 266 low
@{*/


#define GFXMMU_LUT266L_LVB_SHIFT		16
#define GFXMMU_LUT266L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut266l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT266L_FVB_SHIFT		8
#define GFXMMU_LUT266L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut266l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT266L_EN Enable **/
#define GFXMMU_LUT266L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut266h LUT266H Graphic MMU LUT entry 266 high
@{*/


