grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT266H_LO_SHIFT		4
#define GFXMMU_LUT266H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut266h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut267l LUT267L Graphic MMU LUT entry 267 low
@{*/


#define GFXMMU_LUT267L_LVB_SHIFT		16
#define GFXMMU_LUT267L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut267l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT267L_FVB_SHIFT		8
#define GFXMMU_LUT267L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut267l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT267L_EN Enable **/
#define GFXMMU_LUT267L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut267h LUT267H Graphic MMU LUT entry 267 high
@{*/


#define GFXMMU_LUT267H_LO_SHIFT		4
#define GFXMMU_LUT267H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut267h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut268l LUT268L Graphic MMU LUT entry 268 low
@{*/


#define GFXMMU_LUT268L_LVB_SHIFT		16
#define GFXMMU_LUT268L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut268l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT268L_FVB_SHIFT		8
#define GFXMMU_LUT268L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut268l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT268L_EN Enable **/
#define GFXMMU_LUT268L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut268h LUT268H Graphic MMU LUT entry 268 high
@{*/


#define GFXMMU_LUT268H_LO_SHIFT		4
#define GFXMMU_LUT268H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut268h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut269l LUT269L Graphic MMU LUT entry 269 low
@{*/


#define GFXMMU_LUT269L_LVB_SHIFT		16
#define GFXMMU_LUT269L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut269l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT269L_FVB_SHIFT		8
#define GFXMMU_LUT269L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut269l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT269L_EN Enable **/
#define GFXMMU_LUT269L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut269h LUT269H Graphic MMU LUT entry 269 high
@{*/


#define GFXMMU_LUT269H_LO_SHIFT		4
#define GFXMMU_LUT269H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut269h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut270l LUT270L Graphic MMU LUT entry 270 low
@{*/


#define GFXMMU_LUT270L_LVB_SHIFT		16
#define GFXMMU_LUT270L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut270l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT270L_FVB_SHIFT		8
#define GFXMMU_LUT270L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut270l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT270L_EN Enable **/
#define GFXMMU_LUT270L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut270h LUT270H Graphic MMU LUT entry 270 high
@{*/


#define GFXMMU_LUT270H_LO_SHIFT		4
#define GFXMMU_LUT270H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut270h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut271l LUT271L Graphic MMU LUT entry 271 low
@{*/


#define GFXMMU_LUT271L_LVB_SHIFT		16
#define GFXMMU_LUT271L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut271l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT271L_FVB_SHIFT		8
#define GFXMMU_LUT271L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut271l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT271L_EN Enable **/
#define GFXMMU_LUT271L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut271h LUT271H Graphic MMU LUT entry 271 high
@{*/


#define GFXMMU_LUT271H_LO_SHIFT		4
#define GFXMMU_LUT271H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut271h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut272l LUT272L Graphic MMU LUT entry 272 low
@{*/


#define GFXMMU_LUT272L_LVB_SHIFT		16
#define GFXMMU_LUT272L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut272l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT272L_FVB_SHIFT		8
#define GFXMMU_LUT272L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut272l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT272L_EN Enable **/
#define GFXMMU_LUT272L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut272h LUT272H Graphic MMU LUT entry 272 high
@{*/


#define GFXMMU_LUT272H_LO_SHIFT		4
#define GFXMMU_LUT272H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut272h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut273l LUT273L Graphic MMU LUT entry 273 low
@{*/


#define GFXMMU_LUT273L_LVB_SHIFT		16
#define GFXMMU_LUT273L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut273l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT273L_FVB_SHIFT		8
#define GFXMMU_LUT273L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut273l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT273L_EN Enable **/
#define GFXMMU_LUT273L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut273h LUT273H Graphic MMU LUT entry 273 high
@{*/


#define GFXMMU_LUT273H_LO_SHIFT		4
#define GFXMMU_LUT273H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut273h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut274l LUT274L Graphic MMU LUT entry 274 low
@{*/


#define GFXMMU_LUT274L_LVB_SHIFT		16
#define GFXMMU_LUT274L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut274l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT274L_FVB_SHIFT		8
#define GFXMMU_LUT274L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut274l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT274L_EN Enable **/
#define GFXMMU_LUT274L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut274h LUT274H Graphic MMU LUT entry 274 high
@{*/


#define GFXMMU_LUT274H_LO_SHIFT		4
#define GFXMMU_LUT274H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut274h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut275l LUT275L Graphic MMU LUT entry 275 low
@{*/


#define GFXMMU_LUT275L_LVB_SHIFT		16
#define GFXMMU_LUT275L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut275l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT275L_FVB_SHIFT		8
#define GFXMMU_LUT275L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut275l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT275L_EN Enable **/
#define GFXMMU_LUT275L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut275h LUT275H Graphic MMU LUT entry 275 high
@{*/


#define GFXMMU_LUT275H_LO_SHIFT		4
#define GFXMMU_LUT275H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut275h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

