grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut276l LUT276L Graphic MMU LUT entry 276 low
@{*/


#define GFXMMU_LUT276L_LVB_SHIFT		16
#define GFXMMU_LUT276L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut276l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT276L_FVB_SHIFT		8
#define GFXMMU_LUT276L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut276l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT276L_EN Enable **/
#define GFXMMU_LUT276L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut276h LUT276H Graphic MMU LUT entry 276 high
@{*/


#define GFXMMU_LUT276H_LO_SHIFT		4
#define GFXMMU_LUT276H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut276h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut277l LUT277L Graphic MMU LUT entry 277 low
@{*/


#define GFXMMU_LUT277L_LVB_SHIFT		16
#define GFXMMU_LUT277L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut277l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT277L_FVB_SHIFT		8
#define GFXMMU_LUT277L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut277l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT277L_EN Enable **/
#define GFXMMU_LUT277L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut277h LUT277H Graphic MMU LUT entry 277 high
@{*/


#define GFXMMU_LUT277H_LO_SHIFT		4
#define GFXMMU_LUT277H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut277h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut278l LUT278L Graphic MMU LUT entry 278 low
@{*/


#define GFXMMU_LUT278L_LVB_SHIFT		16
#define GFXMMU_LUT278L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut278l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT278L_FVB_SHIFT		8
#define GFXMMU_LUT278L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut278l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT278L_EN Enable **/
#define GFXMMU_LUT278L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut278h LUT278H Graphic MMU LUT entry 278 high
@{*/


#define GFXMMU_LUT278H_LO_SHIFT		4
#define GFXMMU_LUT278H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut278h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut279l LUT279L Graphic MMU LUT entry 279 low
@{*/


#define GFXMMU_LUT279L_LVB_SHIFT		16
#define GFXMMU_LUT279L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut279l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT279L_FVB_SHIFT		8
#define GFXMMU_LUT279L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut279l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT279L_EN Enable **/
#define GFXMMU_LUT279L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut279h LUT279H Graphic MMU LUT entry 279 high
@{*/


#define GFXMMU_LUT279H_LO_SHIFT		4
#define GFXMMU_LUT279H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut279h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut280l LUT280L Graphic MMU LUT entry 280 low
@{*/


#define GFXMMU_LUT280L_LVB_SHIFT		16
#define GFXMMU_LUT280L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut280l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT280L_FVB_SHIFT		8
#define GFXMMU_LUT280L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut280l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT280L_EN Enable **/
#define GFXMMU_LUT280L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut280h LUT280H Graphic MMU LUT entry 280 high
@{*/


#define GFXMMU_LUT280H_LO_SHIFT		4
#define GFXMMU_LUT280H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut280h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut281l LUT281L Graphic MMU LUT entry 281 low
@{*/


#define GFXMMU_LUT281L_LVB_SHIFT		16
#define GFXMMU_LUT281L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut281l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT281L_FVB_SHIFT		8
#define GFXMMU_LUT281L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut281l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT281L_EN Enable **/
#define GFXMMU_LUT281L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut281h LUT281H Graphic MMU LUT entry 281 high
@{*/


#define GFXMMU_LUT281H_LO_SHIFT		4
#define GFXMMU_LUT281H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut281h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut282l LUT282L Graphic MMU LUT entry 282 low
@{*/


#define GFXMMU_LUT282L_LVB_SHIFT		16
#define GFXMMU_LUT282L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut282l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT282L_FVB_SHIFT		8
#define GFXMMU_LUT282L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut282l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT282L_EN Enable **/
#define GFXMMU_LUT282L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut282h LUT282H Graphic MMU LUT entry 282 high
@{*/


#define GFXMMU_LUT282H_LO_SHIFT		4
#define GFXMMU_LUT282H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut282h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut283l LUT283L Graphic MMU LUT entry 283 low
@{*/


#define GFXMMU_LUT283L_LVB_SHIFT		16
#define GFXMMU_LUT283L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut283l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT283L_FVB_SHIFT		8
#define GFXMMU_LUT283L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut283l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT283L_EN Enable **/
#define GFXMMU_LUT283L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut283h LUT283H Graphic MMU LUT entry 283 high
@{*/


#define GFXMMU_LUT283H_LO_SHIFT		4
#define GFXMMU_LUT283H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut283h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut284l LUT284L Graphic MMU LUT entry 284 low
@{*/


#define GFXMMU_LUT284L_LVB_SHIFT		16
#define GFXMMU_LUT284L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut284l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT284L_FVB_SHIFT		8
#define GFXMMU_LUT284L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut284l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT284L_EN Enable **/
#define GFXMMU_LUT284L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut284h LUT284H Graphic MMU LUT entry 284 high
@{*/


#define GFXMMU_LUT284H_LO_SHIFT		4
#define GFXMMU_LUT284H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut284h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut285l LUT285L Graphic MMU LUT entry 285 low
@{*/


#define GFXMMU_LUT285L_LVB_SHIFT		16
#define GFXMMU_LUT285L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut285l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT285L_FVB_SHIFT		8
#define GFXMMU_LUT285L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut285l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT285L_EN Enable **/
#define GFXMMU_LUT285L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut285h LUT285H Graphic MMU LUT entry 285 high
@{*/


#define GFXMMU_LUT285H_LO_SHIFT		4
#define GFXMMU_LUT285H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut285h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut286l LUT286L Graphic MMU LUT entry 286 low
@{*/


#define GFXMMU_LUT286L_LVB_SHIFT		16
#define GFXMMU_LUT286L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut286l_lvb LVB Last Valid Block
@{*/
/**@}*/


