grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT286L_FVB_SHIFT		8
#define GFXMMU_LUT286L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut286l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT286L_EN Enable **/
#define GFXMMU_LUT286L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut286h LUT286H Graphic MMU LUT entry 286 high
@{*/


#define GFXMMU_LUT286H_LO_SHIFT		4
#define GFXMMU_LUT286H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut286h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut287l LUT287L Graphic MMU LUT entry 287 low
@{*/


#define GFXMMU_LUT287L_LVB_SHIFT		16
#define GFXMMU_LUT287L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut287l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT287L_FVB_SHIFT		8
#define GFXMMU_LUT287L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut287l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT287L_EN Enable **/
#define GFXMMU_LUT287L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut287h LUT287H Graphic MMU LUT entry 287 high
@{*/


#define GFXMMU_LUT287H_LO_SHIFT		4
#define GFXMMU_LUT287H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut287h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut288l LUT288L Graphic MMU LUT entry 288 low
@{*/


#define GFXMMU_LUT288L_LVB_SHIFT		16
#define GFXMMU_LUT288L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut288l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT288L_FVB_SHIFT		8
#define GFXMMU_LUT288L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut288l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT288L_EN Enable **/
#define GFXMMU_LUT288L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut288h LUT288H Graphic MMU LUT entry 288 high
@{*/


#define GFXMMU_LUT288H_LO_SHIFT		4
#define GFXMMU_LUT288H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut288h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut289l LUT289L Graphic MMU LUT entry 289 low
@{*/


#define GFXMMU_LUT289L_LVB_SHIFT		16
#define GFXMMU_LUT289L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut289l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT289L_FVB_SHIFT		8
#define GFXMMU_LUT289L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut289l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT289L_EN Enable **/
#define GFXMMU_LUT289L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut289h LUT289H Graphic MMU LUT entry 289 high
@{*/


#define GFXMMU_LUT289H_LO_SHIFT		4
#define GFXMMU_LUT289H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut289h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut290l LUT290L Graphic MMU LUT entry 290 low
@{*/


#define GFXMMU_LUT290L_LVB_SHIFT		16
#define GFXMMU_LUT290L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut290l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT290L_FVB_SHIFT		8
#define GFXMMU_LUT290L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut290l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT290L_EN Enable **/
#define GFXMMU_LUT290L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut290h LUT290H Graphic MMU LUT entry 290 high
@{*/


#define GFXMMU_LUT290H_LO_SHIFT		4
#define GFXMMU_LUT290H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut290h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut291l LUT291L Graphic MMU LUT entry 291 low
@{*/


#define GFXMMU_LUT291L_LVB_SHIFT		16
#define GFXMMU_LUT291L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut291l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT291L_FVB_SHIFT		8
#define GFXMMU_LUT291L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut291l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT291L_EN Enable **/
#define GFXMMU_LUT291L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut291h LUT291H Graphic MMU LUT entry 291 high
@{*/


#define GFXMMU_LUT291H_LO_SHIFT		4
#define GFXMMU_LUT291H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut291h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut292l LUT292L Graphic MMU LUT entry 292 low
@{*/


#define GFXMMU_LUT292L_LVB_SHIFT		16
#define GFXMMU_LUT292L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut292l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT292L_FVB_SHIFT		8
#define GFXMMU_LUT292L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut292l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT292L_EN Enable **/
#define GFXMMU_LUT292L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut292h LUT292H Graphic MMU LUT entry 292 high
@{*/


#define GFXMMU_LUT292H_LO_SHIFT		4
#define GFXMMU_LUT292H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut292h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut293l LUT293L Graphic MMU LUT entry 293 low
@{*/


#define GFXMMU_LUT293L_LVB_SHIFT		16
#define GFXMMU_LUT293L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut293l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT293L_FVB_SHIFT		8
#define GFXMMU_LUT293L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut293l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT293L_EN Enable **/
#define GFXMMU_LUT293L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut293h LUT293H Graphic MMU LUT entry 293 high
@{*/


#define GFXMMU_LUT293H_LO_SHIFT		4
#define GFXMMU_LUT293H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut293h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut294l LUT294L Graphic MMU LUT entry 294 low
@{*/


#define GFXMMU_LUT294L_LVB_SHIFT		16
#define GFXMMU_LUT294L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut294l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT294L_FVB_SHIFT		8
#define GFXMMU_LUT294L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut294l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT294L_EN Enable **/
#define GFXMMU_LUT294L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut294h LUT294H Graphic MMU LUT entry 294 high
@{*/


#define GFXMMU_LUT294H_LO_SHIFT		4
#define GFXMMU_LUT294H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut294h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut295l LUT295L Graphic MMU LUT entry 295 low
@{*/


#define GFXMMU_LUT295L_LVB_SHIFT		16
#define GFXMMU_LUT295L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut295l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT295L_FVB_SHIFT		8
#define GFXMMU_LUT295L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut295l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT295L_EN Enable **/
#define GFXMMU_LUT295L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut295h LUT295H Graphic MMU LUT entry 295 high
@{*/


#define GFXMMU_LUT295H_LO_SHIFT		4
#define GFXMMU_LUT295H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut295h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut296l LUT296L Graphic MMU LUT entry 296 low
@{*/


