grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT296L_LVB_SHIFT		16
#define GFXMMU_LUT296L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut296l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT296L_FVB_SHIFT		8
#define GFXMMU_LUT296L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut296l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT296L_EN Enable **/
#define GFXMMU_LUT296L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut296h LUT296H Graphic MMU LUT entry 296 high
@{*/


#define GFXMMU_LUT296H_LO_SHIFT		4
#define GFXMMU_LUT296H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut296h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut297l LUT297L Graphic MMU LUT entry 297 low
@{*/


#define GFXMMU_LUT297L_LVB_SHIFT		16
#define GFXMMU_LUT297L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut297l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT297L_FVB_SHIFT		8
#define GFXMMU_LUT297L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut297l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT297L_EN Enable **/
#define GFXMMU_LUT297L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut297h LUT297H Graphic MMU LUT entry 297 high
@{*/


#define GFXMMU_LUT297H_LO_SHIFT		4
#define GFXMMU_LUT297H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut297h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut298l LUT298L Graphic MMU LUT entry 298 low
@{*/


#define GFXMMU_LUT298L_LVB_SHIFT		16
#define GFXMMU_LUT298L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut298l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT298L_FVB_SHIFT		8
#define GFXMMU_LUT298L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut298l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT298L_EN Enable **/
#define GFXMMU_LUT298L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut298h LUT298H Graphic MMU LUT entry 298 high
@{*/


#define GFXMMU_LUT298H_LO_SHIFT		4
#define GFXMMU_LUT298H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut298h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut299l LUT299L Graphic MMU LUT entry 299 low
@{*/


#define GFXMMU_LUT299L_LVB_SHIFT		16
#define GFXMMU_LUT299L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut299l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT299L_FVB_SHIFT		8
#define GFXMMU_LUT299L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut299l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT299L_EN Enable **/
#define GFXMMU_LUT299L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut299h LUT299H Graphic MMU LUT entry 299 high
@{*/


#define GFXMMU_LUT299H_LO_SHIFT		4
#define GFXMMU_LUT299H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut299h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut300l LUT300L Graphic MMU LUT entry 300 low
@{*/


#define GFXMMU_LUT300L_LVB_SHIFT		16
#define GFXMMU_LUT300L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut300l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT300L_FVB_SHIFT		8
#define GFXMMU_LUT300L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut300l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT300L_EN Enable **/
#define GFXMMU_LUT300L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut300h LUT300H Graphic MMU LUT entry 300 high
@{*/


#define GFXMMU_LUT300H_LO_SHIFT		4
#define GFXMMU_LUT300H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut300h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut301l LUT301L Graphic MMU LUT entry 301 low
@{*/


#define GFXMMU_LUT301L_LVB_SHIFT		16
#define GFXMMU_LUT301L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut301l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT301L_FVB_SHIFT		8
#define GFXMMU_LUT301L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut301l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT301L_EN Enable **/
#define GFXMMU_LUT301L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut301h LUT301H Graphic MMU LUT entry 301 high
@{*/


#define GFXMMU_LUT301H_LO_SHIFT		4
#define GFXMMU_LUT301H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut301h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut302l LUT302L Graphic MMU LUT entry 302 low
@{*/


#define GFXMMU_LUT302L_LVB_SHIFT		16
#define GFXMMU_LUT302L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut302l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT302L_FVB_SHIFT		8
#define GFXMMU_LUT302L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut302l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT302L_EN Enable **/
#define GFXMMU_LUT302L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut302h LUT302H Graphic MMU LUT entry 302 high
@{*/


#define GFXMMU_LUT302H_LO_SHIFT		4
#define GFXMMU_LUT302H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut302h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut303l LUT303L Graphic MMU LUT entry 303 low
@{*/


#define GFXMMU_LUT303L_LVB_SHIFT		16
#define GFXMMU_LUT303L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut303l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT303L_FVB_SHIFT		8
#define GFXMMU_LUT303L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut303l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT303L_EN Enable **/
#define GFXMMU_LUT303L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut303h LUT303H Graphic MMU LUT entry 303 high
@{*/


#define GFXMMU_LUT303H_LO_SHIFT		4
#define GFXMMU_LUT303H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut303h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut304l LUT304L Graphic MMU LUT entry 304 low
@{*/


#define GFXMMU_LUT304L_LVB_SHIFT		16
#define GFXMMU_LUT304L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut304l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT304L_FVB_SHIFT		8
#define GFXMMU_LUT304L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut304l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT304L_EN Enable **/
#define GFXMMU_LUT304L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut304h LUT304H Graphic MMU LUT entry 304 high
@{*/


#define GFXMMU_LUT304H_LO_SHIFT		4
#define GFXMMU_LUT304H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut304h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut305l LUT305L Graphic MMU LUT entry 305 low
@{*/


#define GFXMMU_LUT305L_LVB_SHIFT		16
#define GFXMMU_LUT305L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut305l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT305L_FVB_SHIFT		8
#define GFXMMU_LUT305L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut305l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT305L_EN Enable **/
#define GFXMMU_LUT305L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut305h LUT305H Graphic MMU LUT entry 305 high
@{*/


