grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT305H_LO_SHIFT		4
#define GFXMMU_LUT305H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut305h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut306l LUT306L Graphic MMU LUT entry 306 low
@{*/


#define GFXMMU_LUT306L_LVB_SHIFT		16
#define GFXMMU_LUT306L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut306l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT306L_FVB_SHIFT		8
#define GFXMMU_LUT306L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut306l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT306L_EN Enable **/
#define GFXMMU_LUT306L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut306h LUT306H Graphic MMU LUT entry 306 high
@{*/


#define GFXMMU_LUT306H_LO_SHIFT		4
#define GFXMMU_LUT306H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut306h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut307l LUT307L Graphic MMU LUT entry 307 low
@{*/


#define GFXMMU_LUT307L_LVB_SHIFT		16
#define GFXMMU_LUT307L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut307l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT307L_FVB_SHIFT		8
#define GFXMMU_LUT307L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut307l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT307L_EN Enable **/
#define GFXMMU_LUT307L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut307h LUT307H Graphic MMU LUT entry 307 high
@{*/


#define GFXMMU_LUT307H_LO_SHIFT		4
#define GFXMMU_LUT307H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut307h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut308l LUT308L Graphic MMU LUT entry 308 low
@{*/


#define GFXMMU_LUT308L_LVB_SHIFT		16
#define GFXMMU_LUT308L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut308l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT308L_FVB_SHIFT		8
#define GFXMMU_LUT308L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut308l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT308L_EN Enable **/
#define GFXMMU_LUT308L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut308h LUT308H Graphic MMU LUT entry 308 high
@{*/


#define GFXMMU_LUT308H_LO_SHIFT		4
#define GFXMMU_LUT308H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut308h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut309l LUT309L Graphic MMU LUT entry 309 low
@{*/


#define GFXMMU_LUT309L_LVB_SHIFT		16
#define GFXMMU_LUT309L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut309l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT309L_FVB_SHIFT		8
#define GFXMMU_LUT309L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut309l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT309L_EN Enable **/
#define GFXMMU_LUT309L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut309h LUT309H Graphic MMU LUT entry 309 high
@{*/


#define GFXMMU_LUT309H_LO_SHIFT		4
#define GFXMMU_LUT309H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut309h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut310l LUT310L Graphic MMU LUT entry 310 low
@{*/


#define GFXMMU_LUT310L_LVB_SHIFT		16
#define GFXMMU_LUT310L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut310l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT310L_FVB_SHIFT		8
#define GFXMMU_LUT310L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut310l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT310L_EN Enable **/
#define GFXMMU_LUT310L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut310h LUT310H Graphic MMU LUT entry 310 high
@{*/


#define GFXMMU_LUT310H_LO_SHIFT		4
#define GFXMMU_LUT310H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut310h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut311l LUT311L Graphic MMU LUT entry 311 low
@{*/


#define GFXMMU_LUT311L_LVB_SHIFT		16
#define GFXMMU_LUT311L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut311l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT311L_FVB_SHIFT		8
#define GFXMMU_LUT311L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut311l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT311L_EN Enable **/
#define GFXMMU_LUT311L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut311h LUT311H Graphic MMU LUT entry 311 high
@{*/


#define GFXMMU_LUT311H_LO_SHIFT		4
#define GFXMMU_LUT311H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut311h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut312l LUT312L Graphic MMU LUT entry 312 low
@{*/


#define GFXMMU_LUT312L_LVB_SHIFT		16
#define GFXMMU_LUT312L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut312l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT312L_FVB_SHIFT		8
#define GFXMMU_LUT312L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut312l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT312L_EN Enable **/
#define GFXMMU_LUT312L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut312h LUT312H Graphic MMU LUT entry 312 high
@{*/


#define GFXMMU_LUT312H_LO_SHIFT		4
#define GFXMMU_LUT312H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut312h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut313l LUT313L Graphic MMU LUT entry 313 low
@{*/


#define GFXMMU_LUT313L_LVB_SHIFT		16
#define GFXMMU_LUT313L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut313l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT313L_FVB_SHIFT		8
#define GFXMMU_LUT313L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut313l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT313L_EN Enable **/
#define GFXMMU_LUT313L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut313h LUT313H Graphic MMU LUT entry 313 high
@{*/


#define GFXMMU_LUT313H_LO_SHIFT		4
#define GFXMMU_LUT313H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut313h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut314l LUT314L Graphic MMU LUT entry 314 low
@{*/


#define GFXMMU_LUT314L_LVB_SHIFT		16
#define GFXMMU_LUT314L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut314l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT314L_FVB_SHIFT		8
#define GFXMMU_LUT314L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut314l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT314L_EN Enable **/
#define GFXMMU_LUT314L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut314h LUT314H Graphic MMU LUT entry 314 high
@{*/


#define GFXMMU_LUT314H_LO_SHIFT		4
#define GFXMMU_LUT314H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut314h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut315l LUT315L Graphic MMU LUT entry 315 low
@{*/


#define GFXMMU_LUT315L_LVB_SHIFT		16
#define GFXMMU_LUT315L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut315l_lvb LVB Last Valid Block
@{*/
/**@}*/


