grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT315L_FVB_SHIFT		8
#define GFXMMU_LUT315L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut315l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT315L_EN Enable **/
#define GFXMMU_LUT315L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut315h LUT315H Graphic MMU LUT entry 315 high
@{*/


#define GFXMMU_LUT315H_LO_SHIFT		4
#define GFXMMU_LUT315H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut315h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut316l LUT316L Graphic MMU LUT entry 316 low
@{*/


#define GFXMMU_LUT316L_LVB_SHIFT		16
#define GFXMMU_LUT316L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut316l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT316L_FVB_SHIFT		8
#define GFXMMU_LUT316L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut316l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT316L_EN Enable **/
#define GFXMMU_LUT316L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut316h LUT316H Graphic MMU LUT entry 316 high
@{*/


#define GFXMMU_LUT316H_LO_SHIFT		4
#define GFXMMU_LUT316H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut316h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut317l LUT317L Graphic MMU LUT entry 317 low
@{*/


#define GFXMMU_LUT317L_LVB_SHIFT		16
#define GFXMMU_LUT317L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut317l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT317L_FVB_SHIFT		8
#define GFXMMU_LUT317L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut317l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT317L_EN Enable **/
#define GFXMMU_LUT317L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut317h LUT317H Graphic MMU LUT entry 317 high
@{*/


#define GFXMMU_LUT317H_LO_SHIFT		4
#define GFXMMU_LUT317H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut317h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut318l LUT318L Graphic MMU LUT entry 318 low
@{*/


#define GFXMMU_LUT318L_LVB_SHIFT		16
#define GFXMMU_LUT318L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut318l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT318L_FVB_SHIFT		8
#define GFXMMU_LUT318L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut318l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT318L_EN Enable **/
#define GFXMMU_LUT318L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut318h LUT318H Graphic MMU LUT entry 318 high
@{*/


#define GFXMMU_LUT318H_LO_SHIFT		4
#define GFXMMU_LUT318H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut318h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut319l LUT319L Graphic MMU LUT entry 319 low
@{*/


#define GFXMMU_LUT319L_LVB_SHIFT		16
#define GFXMMU_LUT319L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut319l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT319L_FVB_SHIFT		8
#define GFXMMU_LUT319L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut319l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT319L_EN Enable **/
#define GFXMMU_LUT319L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut319h LUT319H Graphic MMU LUT entry 319 high
@{*/


#define GFXMMU_LUT319H_LO_SHIFT		4
#define GFXMMU_LUT319H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut319h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut320l LUT320L Graphic MMU LUT entry 320 low
@{*/


#define GFXMMU_LUT320L_LVB_SHIFT		16
#define GFXMMU_LUT320L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut320l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT320L_FVB_SHIFT		8
#define GFXMMU_LUT320L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut320l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT320L_EN Enable **/
#define GFXMMU_LUT320L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut320h LUT320H Graphic MMU LUT entry 320 high
@{*/


#define GFXMMU_LUT320H_LO_SHIFT		4
#define GFXMMU_LUT320H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut320h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut321l LUT321L Graphic MMU LUT entry 321 low
@{*/


#define GFXMMU_LUT321L_LVB_SHIFT		16
#define GFXMMU_LUT321L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut321l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT321L_FVB_SHIFT		8
#define GFXMMU_LUT321L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut321l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT321L_EN Enable **/
#define GFXMMU_LUT321L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut321h LUT321H Graphic MMU LUT entry 321 high
@{*/


#define GFXMMU_LUT321H_LO_SHIFT		4
#define GFXMMU_LUT321H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut321h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut322l LUT322L Graphic MMU LUT entry 322 low
@{*/


#define GFXMMU_LUT322L_LVB_SHIFT		16
#define GFXMMU_LUT322L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut322l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT322L_FVB_SHIFT		8
#define GFXMMU_LUT322L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut322l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT322L_EN Enable **/
#define GFXMMU_LUT322L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut322h LUT322H Graphic MMU LUT entry 322 high
@{*/


#define GFXMMU_LUT322H_LO_SHIFT		4
#define GFXMMU_LUT322H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut322h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut323l LUT323L Graphic MMU LUT entry 323 low
@{*/


#define GFXMMU_LUT323L_LVB_SHIFT		16
#define GFXMMU_LUT323L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut323l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT323L_FVB_SHIFT		8
#define GFXMMU_LUT323L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut323l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT323L_EN Enable **/
#define GFXMMU_LUT323L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut323h LUT323H Graphic MMU LUT entry 323 high
@{*/


#define GFXMMU_LUT323H_LO_SHIFT		4
#define GFXMMU_LUT323H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut323h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut324l LUT324L Graphic MMU LUT entry 324 low
@{*/


#define GFXMMU_LUT324L_LVB_SHIFT		16
#define GFXMMU_LUT324L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut324l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT324L_FVB_SHIFT		8
#define GFXMMU_LUT324L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut324l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT324L_EN Enable **/
#define GFXMMU_LUT324L_EN		(1 << 0)

/**@}*/

