grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut324h LUT324H Graphic MMU LUT entry 324 high
@{*/


#define GFXMMU_LUT324H_LO_SHIFT		4
#define GFXMMU_LUT324H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut324h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut325l LUT325L Graphic MMU LUT entry 325 low
@{*/


#define GFXMMU_LUT325L_LVB_SHIFT		16
#define GFXMMU_LUT325L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut325l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT325L_FVB_SHIFT		8
#define GFXMMU_LUT325L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut325l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT325L_EN Enable **/
#define GFXMMU_LUT325L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut325h LUT325H Graphic MMU LUT entry 325 high
@{*/


#define GFXMMU_LUT325H_LO_SHIFT		4
#define GFXMMU_LUT325H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut325h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut326l LUT326L Graphic MMU LUT entry 326 low
@{*/


#define GFXMMU_LUT326L_LVB_SHIFT		16
#define GFXMMU_LUT326L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut326l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT326L_FVB_SHIFT		8
#define GFXMMU_LUT326L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut326l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT326L_EN Enable **/
#define GFXMMU_LUT326L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut326h LUT326H Graphic MMU LUT entry 326 high
@{*/


#define GFXMMU_LUT326H_LO_SHIFT		4
#define GFXMMU_LUT326H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut326h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut327l LUT327L Graphic MMU LUT entry 327 low
@{*/


#define GFXMMU_LUT327L_LVB_SHIFT		16
#define GFXMMU_LUT327L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut327l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT327L_FVB_SHIFT		8
#define GFXMMU_LUT327L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut327l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT327L_EN Enable **/
#define GFXMMU_LUT327L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut327h LUT327H Graphic MMU LUT entry 327 high
@{*/


#define GFXMMU_LUT327H_LO_SHIFT		4
#define GFXMMU_LUT327H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut327h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut328l LUT328L Graphic MMU LUT entry 328 low
@{*/


#define GFXMMU_LUT328L_LVB_SHIFT		16
#define GFXMMU_LUT328L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut328l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT328L_FVB_SHIFT		8
#define GFXMMU_LUT328L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut328l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT328L_EN Enable **/
#define GFXMMU_LUT328L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut328h LUT328H Graphic MMU LUT entry 328 high
@{*/


#define GFXMMU_LUT328H_LO_SHIFT		4
#define GFXMMU_LUT328H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut328h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut329l LUT329L Graphic MMU LUT entry 329 low
@{*/


#define GFXMMU_LUT329L_LVB_SHIFT		16
#define GFXMMU_LUT329L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut329l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT329L_FVB_SHIFT		8
#define GFXMMU_LUT329L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut329l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT329L_EN Enable **/
#define GFXMMU_LUT329L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut329h LUT329H Graphic MMU LUT entry 329 high
@{*/


#define GFXMMU_LUT329H_LO_SHIFT		4
#define GFXMMU_LUT329H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut329h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut330l LUT330L Graphic MMU LUT entry 330 low
@{*/


#define GFXMMU_LUT330L_LVB_SHIFT		16
#define GFXMMU_LUT330L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut330l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT330L_FVB_SHIFT		8
#define GFXMMU_LUT330L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut330l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT330L_EN Enable **/
#define GFXMMU_LUT330L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut330h LUT330H Graphic MMU LUT entry 330 high
@{*/


#define GFXMMU_LUT330H_LO_SHIFT		4
#define GFXMMU_LUT330H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut330h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut331l LUT331L Graphic MMU LUT entry 331 low
@{*/


#define GFXMMU_LUT331L_LVB_SHIFT		16
#define GFXMMU_LUT331L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut331l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT331L_FVB_SHIFT		8
#define GFXMMU_LUT331L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut331l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT331L_EN Enable **/
#define GFXMMU_LUT331L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut331h LUT331H Graphic MMU LUT entry 331 high
@{*/


#define GFXMMU_LUT331H_LO_SHIFT		4
#define GFXMMU_LUT331H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut331h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut332l LUT332L Graphic MMU LUT entry 332 low
@{*/


#define GFXMMU_LUT332L_LVB_SHIFT		16
#define GFXMMU_LUT332L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut332l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT332L_FVB_SHIFT		8
#define GFXMMU_LUT332L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut332l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT332L_EN Enable **/
#define GFXMMU_LUT332L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut332h LUT332H Graphic MMU LUT entry 332 high
@{*/


#define GFXMMU_LUT332H_LO_SHIFT		4
#define GFXMMU_LUT332H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut332h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut333l LUT333L Graphic MMU LUT entry 333 low
@{*/


#define GFXMMU_LUT333L_LVB_SHIFT		16
#define GFXMMU_LUT333L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut333l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT333L_FVB_SHIFT		8
#define GFXMMU_LUT333L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut333l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT333L_EN Enable **/
#define GFXMMU_LUT333L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut333h LUT333H Graphic MMU LUT entry 333 high
@{*/


#define GFXMMU_LUT333H_LO_SHIFT		4
#define GFXMMU_LUT333H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut333h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut334l LUT334L Graphic MMU LUT entry 334 low
@{*/


#define GFXMMU_LUT334L_LVB_SHIFT		16
#define GFXMMU_LUT334L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut334l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT334L_FVB_SHIFT		8
#define GFXMMU_LUT334L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut334l_fvb FVB First Valid Block
@{*/
/**@}*/

