grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT334L_EN Enable **/
#define GFXMMU_LUT334L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut334h LUT334H Graphic MMU LUT entry 334 high
@{*/


#define GFXMMU_LUT334H_LO_SHIFT		4
#define GFXMMU_LUT334H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut334h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut335l LUT335L Graphic MMU LUT entry 335 low
@{*/


#define GFXMMU_LUT335L_LVB_SHIFT		16
#define GFXMMU_LUT335L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut335l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT335L_FVB_SHIFT		8
#define GFXMMU_LUT335L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut335l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT335L_EN Enable **/
#define GFXMMU_LUT335L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut335h LUT335H Graphic MMU LUT entry 335 high
@{*/


#define GFXMMU_LUT335H_LO_SHIFT		4
#define GFXMMU_LUT335H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut335h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut336l LUT336L Graphic MMU LUT entry 336 low
@{*/


#define GFXMMU_LUT336L_LVB_SHIFT		16
#define GFXMMU_LUT336L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut336l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT336L_FVB_SHIFT		8
#define GFXMMU_LUT336L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut336l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT336L_EN Enable **/
#define GFXMMU_LUT336L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut336h LUT336H Graphic MMU LUT entry 336 high
@{*/


#define GFXMMU_LUT336H_LO_SHIFT		4
#define GFXMMU_LUT336H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut336h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut337l LUT337L Graphic MMU LUT entry 337 low
@{*/


#define GFXMMU_LUT337L_LVB_SHIFT		16
#define GFXMMU_LUT337L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut337l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT337L_FVB_SHIFT		8
#define GFXMMU_LUT337L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut337l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT337L_EN Enable **/
#define GFXMMU_LUT337L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut337h LUT337H Graphic MMU LUT entry 337 high
@{*/


#define GFXMMU_LUT337H_LO_SHIFT		4
#define GFXMMU_LUT337H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut337h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut338l LUT338L Graphic MMU LUT entry 338 low
@{*/


#define GFXMMU_LUT338L_LVB_SHIFT		16
#define GFXMMU_LUT338L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut338l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT338L_FVB_SHIFT		8
#define GFXMMU_LUT338L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut338l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT338L_EN Enable **/
#define GFXMMU_LUT338L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut338h LUT338H Graphic MMU LUT entry 338 high
@{*/


#define GFXMMU_LUT338H_LO_SHIFT		4
#define GFXMMU_LUT338H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut338h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut339l LUT339L Graphic MMU LUT entry 339 low
@{*/


#define GFXMMU_LUT339L_LVB_SHIFT		16
#define GFXMMU_LUT339L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut339l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT339L_FVB_SHIFT		8
#define GFXMMU_LUT339L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut339l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT339L_EN Enable **/
#define GFXMMU_LUT339L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut339h LUT339H Graphic MMU LUT entry 339 high
@{*/


#define GFXMMU_LUT339H_LO_SHIFT		4
#define GFXMMU_LUT339H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut339h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut340l LUT340L Graphic MMU LUT entry 340 low
@{*/


#define GFXMMU_LUT340L_LVB_SHIFT		16
#define GFXMMU_LUT340L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut340l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT340L_FVB_SHIFT		8
#define GFXMMU_LUT340L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut340l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT340L_EN Enable **/
#define GFXMMU_LUT340L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut340h LUT340H Graphic MMU LUT entry 340 high
@{*/


#define GFXMMU_LUT340H_LO_SHIFT		4
#define GFXMMU_LUT340H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut340h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut341l LUT341L Graphic MMU LUT entry 341 low
@{*/


#define GFXMMU_LUT341L_LVB_SHIFT		16
#define GFXMMU_LUT341L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut341l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT341L_FVB_SHIFT		8
#define GFXMMU_LUT341L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut341l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT341L_EN Enable **/
#define GFXMMU_LUT341L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut341h LUT341H Graphic MMU LUT entry 341 high
@{*/


#define GFXMMU_LUT341H_LO_SHIFT		4
#define GFXMMU_LUT341H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut341h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut342l LUT342L Graphic MMU LUT entry 342 low
@{*/


#define GFXMMU_LUT342L_LVB_SHIFT		16
#define GFXMMU_LUT342L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut342l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT342L_FVB_SHIFT		8
#define GFXMMU_LUT342L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut342l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT342L_EN Enable **/
#define GFXMMU_LUT342L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut342h LUT342H Graphic MMU LUT entry 342 high
@{*/


#define GFXMMU_LUT342H_LO_SHIFT		4
#define GFXMMU_LUT342H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut342h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut343l LUT343L Graphic MMU LUT entry 343 low
@{*/


#define GFXMMU_LUT343L_LVB_SHIFT		16
#define GFXMMU_LUT343L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut343l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT343L_FVB_SHIFT		8
#define GFXMMU_LUT343L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut343l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT343L_EN Enable **/
#define GFXMMU_LUT343L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut343h LUT343H Graphic MMU LUT entry 343 high
@{*/


#define GFXMMU_LUT343H_LO_SHIFT		4
#define GFXMMU_LUT343H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut343h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut344l LUT344L Graphic MMU LUT entry 344 low
@{*/


