grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT344L_LVB_SHIFT		16
#define GFXMMU_LUT344L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut344l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT344L_FVB_SHIFT		8
#define GFXMMU_LUT344L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut344l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT344L_EN Enable **/
#define GFXMMU_LUT344L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut344h LUT344H Graphic MMU LUT entry 344 high
@{*/


#define GFXMMU_LUT344H_LO_SHIFT		4
#define GFXMMU_LUT344H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut344h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut345l LUT345L Graphic MMU LUT entry 345 low
@{*/


#define GFXMMU_LUT345L_LVB_SHIFT		16
#define GFXMMU_LUT345L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut345l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT345L_FVB_SHIFT		8
#define GFXMMU_LUT345L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut345l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT345L_EN Enable **/
#define GFXMMU_LUT345L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut345h LUT345H Graphic MMU LUT entry 345 high
@{*/


#define GFXMMU_LUT345H_LO_SHIFT		4
#define GFXMMU_LUT345H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut345h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut346l LUT346L Graphic MMU LUT entry 346 low
@{*/


#define GFXMMU_LUT346L_LVB_SHIFT		16
#define GFXMMU_LUT346L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut346l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT346L_FVB_SHIFT		8
#define GFXMMU_LUT346L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut346l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT346L_EN Enable **/
#define GFXMMU_LUT346L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut346h LUT346H Graphic MMU LUT entry 346 high
@{*/


#define GFXMMU_LUT346H_LO_SHIFT		4
#define GFXMMU_LUT346H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut346h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut347l LUT347L Graphic MMU LUT entry 347 low
@{*/


#define GFXMMU_LUT347L_LVB_SHIFT		16
#define GFXMMU_LUT347L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut347l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT347L_FVB_SHIFT		8
#define GFXMMU_LUT347L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut347l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT347L_EN Enable **/
#define GFXMMU_LUT347L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut347h LUT347H Graphic MMU LUT entry 347 high
@{*/


#define GFXMMU_LUT347H_LO_SHIFT		4
#define GFXMMU_LUT347H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut347h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut348l LUT348L Graphic MMU LUT entry 348 low
@{*/


#define GFXMMU_LUT348L_LVB_SHIFT		16
#define GFXMMU_LUT348L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut348l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT348L_FVB_SHIFT		8
#define GFXMMU_LUT348L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut348l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT348L_EN Enable **/
#define GFXMMU_LUT348L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut348h LUT348H Graphic MMU LUT entry 348 high
@{*/


#define GFXMMU_LUT348H_LO_SHIFT		4
#define GFXMMU_LUT348H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut348h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut349l LUT349L Graphic MMU LUT entry 349 low
@{*/


#define GFXMMU_LUT349L_LVB_SHIFT		16
#define GFXMMU_LUT349L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut349l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT349L_FVB_SHIFT		8
#define GFXMMU_LUT349L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut349l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT349L_EN Enable **/
#define GFXMMU_LUT349L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut349h LUT349H Graphic MMU LUT entry 349 high
@{*/


#define GFXMMU_LUT349H_LO_SHIFT		4
#define GFXMMU_LUT349H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut349h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut350l LUT350L Graphic MMU LUT entry 350 low
@{*/


#define GFXMMU_LUT350L_LVB_SHIFT		16
#define GFXMMU_LUT350L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut350l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT350L_FVB_SHIFT		8
#define GFXMMU_LUT350L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut350l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT350L_EN Enable **/
#define GFXMMU_LUT350L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut350h LUT350H Graphic MMU LUT entry 350 high
@{*/


#define GFXMMU_LUT350H_LO_SHIFT		4
#define GFXMMU_LUT350H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut350h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut351l LUT351L Graphic MMU LUT entry 351 low
@{*/


#define GFXMMU_LUT351L_LVB_SHIFT		16
#define GFXMMU_LUT351L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut351l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT351L_FVB_SHIFT		8
#define GFXMMU_LUT351L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut351l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT351L_EN Enable **/
#define GFXMMU_LUT351L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut351h LUT351H Graphic MMU LUT entry 351 high
@{*/


#define GFXMMU_LUT351H_LO_SHIFT		4
#define GFXMMU_LUT351H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut351h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut352l LUT352L Graphic MMU LUT entry 352 low
@{*/


#define GFXMMU_LUT352L_LVB_SHIFT		16
#define GFXMMU_LUT352L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut352l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT352L_FVB_SHIFT		8
#define GFXMMU_LUT352L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut352l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT352L_EN Enable **/
#define GFXMMU_LUT352L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut352h LUT352H Graphic MMU LUT entry 352 high
@{*/


#define GFXMMU_LUT352H_LO_SHIFT		4
#define GFXMMU_LUT352H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut352h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut353l LUT353L Graphic MMU LUT entry 353 low
@{*/


#define GFXMMU_LUT353L_LVB_SHIFT		16
#define GFXMMU_LUT353L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut353l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT353L_FVB_SHIFT		8
#define GFXMMU_LUT353L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut353l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT353L_EN Enable **/
#define GFXMMU_LUT353L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut353h LUT353H Graphic MMU LUT entry 353 high
@{*/


#define GFXMMU_LUT353H_LO_SHIFT		4
#define GFXMMU_LUT353H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut353h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

