grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut354l LUT354L Graphic MMU LUT entry 354 low
@{*/


#define GFXMMU_LUT354L_LVB_SHIFT		16
#define GFXMMU_LUT354L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut354l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT354L_FVB_SHIFT		8
#define GFXMMU_LUT354L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut354l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT354L_EN Enable **/
#define GFXMMU_LUT354L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut354h LUT354H Graphic MMU LUT entry 354 high
@{*/


#define GFXMMU_LUT354H_LO_SHIFT		4
#define GFXMMU_LUT354H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut354h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut355l LUT355L Graphic MMU LUT entry 355 low
@{*/


#define GFXMMU_LUT355L_LVB_SHIFT		16
#define GFXMMU_LUT355L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut355l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT355L_FVB_SHIFT		8
#define GFXMMU_LUT355L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut355l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT355L_EN Enable **/
#define GFXMMU_LUT355L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut355h LUT355H Graphic MMU LUT entry 355 high
@{*/


#define GFXMMU_LUT355H_LO_SHIFT		4
#define GFXMMU_LUT355H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut355h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut356l LUT356L Graphic MMU LUT entry 356 low
@{*/


#define GFXMMU_LUT356L_LVB_SHIFT		16
#define GFXMMU_LUT356L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut356l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT356L_FVB_SHIFT		8
#define GFXMMU_LUT356L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut356l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT356L_EN Enable **/
#define GFXMMU_LUT356L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut356h LUT356H Graphic MMU LUT entry 356 high
@{*/


#define GFXMMU_LUT356H_LO_SHIFT		4
#define GFXMMU_LUT356H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut356h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut357l LUT357L Graphic MMU LUT entry 357 low
@{*/


#define GFXMMU_LUT357L_LVB_SHIFT		16
#define GFXMMU_LUT357L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut357l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT357L_FVB_SHIFT		8
#define GFXMMU_LUT357L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut357l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT357L_EN Enable **/
#define GFXMMU_LUT357L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut357h LUT357H Graphic MMU LUT entry 357 high
@{*/


#define GFXMMU_LUT357H_LO_SHIFT		4
#define GFXMMU_LUT357H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut357h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut358l LUT358L Graphic MMU LUT entry 358 low
@{*/


#define GFXMMU_LUT358L_LVB_SHIFT		16
#define GFXMMU_LUT358L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut358l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT358L_FVB_SHIFT		8
#define GFXMMU_LUT358L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut358l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT358L_EN Enable **/
#define GFXMMU_LUT358L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut358h LUT358H Graphic MMU LUT entry 358 high
@{*/


#define GFXMMU_LUT358H_LO_SHIFT		4
#define GFXMMU_LUT358H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut358h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut359l LUT359L Graphic MMU LUT entry 359 low
@{*/


#define GFXMMU_LUT359L_LVB_SHIFT		16
#define GFXMMU_LUT359L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut359l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT359L_FVB_SHIFT		8
#define GFXMMU_LUT359L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut359l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT359L_EN Enable **/
#define GFXMMU_LUT359L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut359h LUT359H Graphic MMU LUT entry 359 high
@{*/


#define GFXMMU_LUT359H_LO_SHIFT		4
#define GFXMMU_LUT359H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut359h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut360l LUT360L Graphic MMU LUT entry 360 low
@{*/


#define GFXMMU_LUT360L_LVB_SHIFT		16
#define GFXMMU_LUT360L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut360l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT360L_FVB_SHIFT		8
#define GFXMMU_LUT360L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut360l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT360L_EN Enable **/
#define GFXMMU_LUT360L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut360h LUT360H Graphic MMU LUT entry 360 high
@{*/


#define GFXMMU_LUT360H_LO_SHIFT		4
#define GFXMMU_LUT360H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut360h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut361l LUT361L Graphic MMU LUT entry 361 low
@{*/


#define GFXMMU_LUT361L_LVB_SHIFT		16
#define GFXMMU_LUT361L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut361l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT361L_FVB_SHIFT		8
#define GFXMMU_LUT361L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut361l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT361L_EN Enable **/
#define GFXMMU_LUT361L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut361h LUT361H Graphic MMU LUT entry 361 high
@{*/


#define GFXMMU_LUT361H_LO_SHIFT		4
#define GFXMMU_LUT361H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut361h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut362l LUT362L Graphic MMU LUT entry 362 low
@{*/


#define GFXMMU_LUT362L_LVB_SHIFT		16
#define GFXMMU_LUT362L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut362l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT362L_FVB_SHIFT		8
#define GFXMMU_LUT362L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut362l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT362L_EN Enable **/
#define GFXMMU_LUT362L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut362h LUT362H Graphic MMU LUT entry 362 high
@{*/


#define GFXMMU_LUT362H_LO_SHIFT		4
#define GFXMMU_LUT362H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut362h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut363l LUT363L Graphic MMU LUT entry 363 low
@{*/


#define GFXMMU_LUT363L_LVB_SHIFT		16
#define GFXMMU_LUT363L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut363l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT363L_FVB_SHIFT		8
#define GFXMMU_LUT363L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut363l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT363L_EN Enable **/
#define GFXMMU_LUT363L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut363h LUT363H Graphic MMU LUT entry 363 high
@{*/


