grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT363H_LO_SHIFT		4
#define GFXMMU_LUT363H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut363h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut364l LUT364L Graphic MMU LUT entry 364 low
@{*/


#define GFXMMU_LUT364L_LVB_SHIFT		16
#define GFXMMU_LUT364L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut364l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT364L_FVB_SHIFT		8
#define GFXMMU_LUT364L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut364l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT364L_EN Enable **/
#define GFXMMU_LUT364L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut364h LUT364H Graphic MMU LUT entry 364 high
@{*/


#define GFXMMU_LUT364H_LO_SHIFT		4
#define GFXMMU_LUT364H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut364h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut365l LUT365L Graphic MMU LUT entry 365 low
@{*/


#define GFXMMU_LUT365L_LVB_SHIFT		16
#define GFXMMU_LUT365L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut365l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT365L_FVB_SHIFT		8
#define GFXMMU_LUT365L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut365l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT365L_EN Enable **/
#define GFXMMU_LUT365L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut365h LUT365H Graphic MMU LUT entry 365 high
@{*/


#define GFXMMU_LUT365H_LO_SHIFT		4
#define GFXMMU_LUT365H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut365h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut366l LUT366L Graphic MMU LUT entry 366 low
@{*/


#define GFXMMU_LUT366L_LVB_SHIFT		16
#define GFXMMU_LUT366L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut366l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT366L_FVB_SHIFT		8
#define GFXMMU_LUT366L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut366l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT366L_EN Enable **/
#define GFXMMU_LUT366L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut366h LUT366H Graphic MMU LUT entry 366 high
@{*/


#define GFXMMU_LUT366H_LO_SHIFT		4
#define GFXMMU_LUT366H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut366h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut367l LUT367L Graphic MMU LUT entry 367 low
@{*/


#define GFXMMU_LUT367L_LVB_SHIFT		16
#define GFXMMU_LUT367L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut367l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT367L_FVB_SHIFT		8
#define GFXMMU_LUT367L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut367l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT367L_EN Enable **/
#define GFXMMU_LUT367L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut367h LUT367H Graphic MMU LUT entry 367 high
@{*/


#define GFXMMU_LUT367H_LO_SHIFT		4
#define GFXMMU_LUT367H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut367h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut368l LUT368L Graphic MMU LUT entry 368 low
@{*/


#define GFXMMU_LUT368L_LVB_SHIFT		16
#define GFXMMU_LUT368L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut368l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT368L_FVB_SHIFT		8
#define GFXMMU_LUT368L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut368l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT368L_EN Enable **/
#define GFXMMU_LUT368L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut368h LUT368H Graphic MMU LUT entry 368 high
@{*/


#define GFXMMU_LUT368H_LO_SHIFT		4
#define GFXMMU_LUT368H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut368h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut369l LUT369L Graphic MMU LUT entry 369 low
@{*/


#define GFXMMU_LUT369L_LVB_SHIFT		16
#define GFXMMU_LUT369L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut369l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT369L_FVB_SHIFT		8
#define GFXMMU_LUT369L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut369l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT369L_EN Enable **/
#define GFXMMU_LUT369L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut369h LUT369H Graphic MMU LUT entry 369 high
@{*/


#define GFXMMU_LUT369H_LO_SHIFT		4
#define GFXMMU_LUT369H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut369h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut370l LUT370L Graphic MMU LUT entry 370 low
@{*/


#define GFXMMU_LUT370L_LVB_SHIFT		16
#define GFXMMU_LUT370L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut370l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT370L_FVB_SHIFT		8
#define GFXMMU_LUT370L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut370l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT370L_EN Enable **/
#define GFXMMU_LUT370L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut370h LUT370H Graphic MMU LUT entry 370 high
@{*/


#define GFXMMU_LUT370H_LO_SHIFT		4
#define GFXMMU_LUT370H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut370h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut371l LUT371L Graphic MMU LUT entry 371 low
@{*/


#define GFXMMU_LUT371L_LVB_SHIFT		16
#define GFXMMU_LUT371L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut371l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT371L_FVB_SHIFT		8
#define GFXMMU_LUT371L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut371l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT371L_EN Enable **/
#define GFXMMU_LUT371L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut371h LUT371H Graphic MMU LUT entry 371 high
@{*/


#define GFXMMU_LUT371H_LO_SHIFT		4
#define GFXMMU_LUT371H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut371h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut372l LUT372L Graphic MMU LUT entry 372 low
@{*/


#define GFXMMU_LUT372L_LVB_SHIFT		16
#define GFXMMU_LUT372L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut372l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT372L_FVB_SHIFT		8
#define GFXMMU_LUT372L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut372l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT372L_EN Enable **/
#define GFXMMU_LUT372L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut372h LUT372H Graphic MMU LUT entry 372 high
@{*/


#define GFXMMU_LUT372H_LO_SHIFT		4
#define GFXMMU_LUT372H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut372h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

