grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut373l LUT373L Graphic MMU LUT entry 373 low
@{*/


#define GFXMMU_LUT373L_LVB_SHIFT		16
#define GFXMMU_LUT373L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut373l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT373L_FVB_SHIFT		8
#define GFXMMU_LUT373L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut373l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT373L_EN Enable **/
#define GFXMMU_LUT373L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut373h LUT373H Graphic MMU LUT entry 373 high
@{*/


#define GFXMMU_LUT373H_LO_SHIFT		4
#define GFXMMU_LUT373H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut373h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut374l LUT374L Graphic MMU LUT entry 374 low
@{*/


#define GFXMMU_LUT374L_LVB_SHIFT		16
#define GFXMMU_LUT374L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut374l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT374L_FVB_SHIFT		8
#define GFXMMU_LUT374L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut374l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT374L_EN Enable **/
#define GFXMMU_LUT374L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut374h LUT374H Graphic MMU LUT entry 374 high
@{*/


#define GFXMMU_LUT374H_LO_SHIFT		4
#define GFXMMU_LUT374H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut374h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut375l LUT375L Graphic MMU LUT entry 375 low
@{*/


#define GFXMMU_LUT375L_LVB_SHIFT		16
#define GFXMMU_LUT375L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut375l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT375L_FVB_SHIFT		8
#define GFXMMU_LUT375L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut375l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT375L_EN Enable **/
#define GFXMMU_LUT375L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut375h LUT375H Graphic MMU LUT entry 375 high
@{*/


#define GFXMMU_LUT375H_LO_SHIFT		4
#define GFXMMU_LUT375H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut375h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut376l LUT376L Graphic MMU LUT entry 376 low
@{*/


#define GFXMMU_LUT376L_LVB_SHIFT		16
#define GFXMMU_LUT376L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut376l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT376L_FVB_SHIFT		8
#define GFXMMU_LUT376L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut376l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT376L_EN Enable **/
#define GFXMMU_LUT376L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut376h LUT376H Graphic MMU LUT entry 376 high
@{*/


#define GFXMMU_LUT376H_LO_SHIFT		4
#define GFXMMU_LUT376H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut376h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut377l LUT377L Graphic MMU LUT entry 377 low
@{*/


#define GFXMMU_LUT377L_LVB_SHIFT		16
#define GFXMMU_LUT377L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut377l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT377L_FVB_SHIFT		8
#define GFXMMU_LUT377L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut377l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT377L_EN Enable **/
#define GFXMMU_LUT377L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut377h LUT377H Graphic MMU LUT entry 377 high
@{*/


#define GFXMMU_LUT377H_LO_SHIFT		4
#define GFXMMU_LUT377H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut377h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut378l LUT378L Graphic MMU LUT entry 378 low
@{*/


#define GFXMMU_LUT378L_LVB_SHIFT		16
#define GFXMMU_LUT378L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut378l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT378L_FVB_SHIFT		8
#define GFXMMU_LUT378L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut378l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT378L_EN Enable **/
#define GFXMMU_LUT378L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut378h LUT378H Graphic MMU LUT entry 378 high
@{*/


#define GFXMMU_LUT378H_LO_SHIFT		4
#define GFXMMU_LUT378H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut378h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut379l LUT379L Graphic MMU LUT entry 379 low
@{*/


#define GFXMMU_LUT379L_LVB_SHIFT		16
#define GFXMMU_LUT379L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut379l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT379L_FVB_SHIFT		8
#define GFXMMU_LUT379L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut379l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT379L_EN Enable **/
#define GFXMMU_LUT379L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut379h LUT379H Graphic MMU LUT entry 379 high
@{*/


#define GFXMMU_LUT379H_LO_SHIFT		4
#define GFXMMU_LUT379H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut379h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut380l LUT380L Graphic MMU LUT entry 380 low
@{*/


#define GFXMMU_LUT380L_LVB_SHIFT		16
#define GFXMMU_LUT380L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut380l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT380L_FVB_SHIFT		8
#define GFXMMU_LUT380L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut380l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT380L_EN Enable **/
#define GFXMMU_LUT380L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut380h LUT380H Graphic MMU LUT entry 380 high
@{*/


#define GFXMMU_LUT380H_LO_SHIFT		4
#define GFXMMU_LUT380H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut380h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut381l LUT381L Graphic MMU LUT entry 381 low
@{*/


#define GFXMMU_LUT381L_LVB_SHIFT		16
#define GFXMMU_LUT381L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut381l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT381L_FVB_SHIFT		8
#define GFXMMU_LUT381L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut381l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT381L_EN Enable **/
#define GFXMMU_LUT381L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut381h LUT381H Graphic MMU LUT entry 381 high
@{*/


#define GFXMMU_LUT381H_LO_SHIFT		4
#define GFXMMU_LUT381H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut381h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut382l LUT382L Graphic MMU LUT entry 382 low
@{*/


#define GFXMMU_LUT382L_LVB_SHIFT		16
#define GFXMMU_LUT382L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut382l_lvb LVB Last Valid Block
@{*/
/**@}*/


