grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT382L_FVB_SHIFT		8
#define GFXMMU_LUT382L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut382l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT382L_EN Enable **/
#define GFXMMU_LUT382L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut382h LUT382H Graphic MMU LUT entry 382 high
@{*/


#define GFXMMU_LUT382H_LO_SHIFT		4
#define GFXMMU_LUT382H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut382h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut383l LUT383L Graphic MMU LUT entry 383 low
@{*/


#define GFXMMU_LUT383L_LVB_SHIFT		16
#define GFXMMU_LUT383L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut383l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT383L_FVB_SHIFT		8
#define GFXMMU_LUT383L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut383l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT383L_EN Enable **/
#define GFXMMU_LUT383L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut383h LUT383H Graphic MMU LUT entry 383 high
@{*/


#define GFXMMU_LUT383H_LO_SHIFT		4
#define GFXMMU_LUT383H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut383h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut384l LUT384L Graphic MMU LUT entry 384 low
@{*/


#define GFXMMU_LUT384L_LVB_SHIFT		16
#define GFXMMU_LUT384L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut384l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT384L_FVB_SHIFT		8
#define GFXMMU_LUT384L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut384l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT384L_EN Enable **/
#define GFXMMU_LUT384L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut384h LUT384H Graphic MMU LUT entry 384 high
@{*/


#define GFXMMU_LUT384H_LO_SHIFT		4
#define GFXMMU_LUT384H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut384h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut385l LUT385L Graphic MMU LUT entry 385 low
@{*/


#define GFXMMU_LUT385L_LVB_SHIFT		16
#define GFXMMU_LUT385L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut385l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT385L_FVB_SHIFT		8
#define GFXMMU_LUT385L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut385l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT385L_EN Enable **/
#define GFXMMU_LUT385L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut385h LUT385H Graphic MMU LUT entry 385 high
@{*/


#define GFXMMU_LUT385H_LO_SHIFT		4
#define GFXMMU_LUT385H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut385h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut386l LUT386L Graphic MMU LUT entry 386 low
@{*/


#define GFXMMU_LUT386L_LVB_SHIFT		16
#define GFXMMU_LUT386L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut386l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT386L_FVB_SHIFT		8
#define GFXMMU_LUT386L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut386l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT386L_EN Enable **/
#define GFXMMU_LUT386L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut386h LUT386H Graphic MMU LUT entry 386 high
@{*/


#define GFXMMU_LUT386H_LO_SHIFT		4
#define GFXMMU_LUT386H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut386h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut387l LUT387L Graphic MMU LUT entry 387 low
@{*/


#define GFXMMU_LUT387L_LVB_SHIFT		16
#define GFXMMU_LUT387L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut387l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT387L_FVB_SHIFT		8
#define GFXMMU_LUT387L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut387l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT387L_EN Enable **/
#define GFXMMU_LUT387L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut387h LUT387H Graphic MMU LUT entry 387 high
@{*/


#define GFXMMU_LUT387H_LO_SHIFT		4
#define GFXMMU_LUT387H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut387h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut388l LUT388L Graphic MMU LUT entry 388 low
@{*/


#define GFXMMU_LUT388L_LVB_SHIFT		16
#define GFXMMU_LUT388L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut388l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT388L_FVB_SHIFT		8
#define GFXMMU_LUT388L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut388l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT388L_EN Enable **/
#define GFXMMU_LUT388L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut388h LUT388H Graphic MMU LUT entry 388 high
@{*/


#define GFXMMU_LUT388H_LO_SHIFT		4
#define GFXMMU_LUT388H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut388h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut389l LUT389L Graphic MMU LUT entry 389 low
@{*/


#define GFXMMU_LUT389L_LVB_SHIFT		16
#define GFXMMU_LUT389L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut389l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT389L_FVB_SHIFT		8
#define GFXMMU_LUT389L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut389l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT389L_EN Enable **/
#define GFXMMU_LUT389L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut389h LUT389H Graphic MMU LUT entry 389 high
@{*/


#define GFXMMU_LUT389H_LO_SHIFT		4
#define GFXMMU_LUT389H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut389h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut390l LUT390L Graphic MMU LUT entry 390 low
@{*/


#define GFXMMU_LUT390L_LVB_SHIFT		16
#define GFXMMU_LUT390L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut390l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT390L_FVB_SHIFT		8
#define GFXMMU_LUT390L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut390l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT390L_EN Enable **/
#define GFXMMU_LUT390L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut390h LUT390H Graphic MMU LUT entry 390 high
@{*/


#define GFXMMU_LUT390H_LO_SHIFT		4
#define GFXMMU_LUT390H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut390h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut391l LUT391L Graphic MMU LUT entry 391 low
@{*/


#define GFXMMU_LUT391L_LVB_SHIFT		16
#define GFXMMU_LUT391L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut391l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT391L_FVB_SHIFT		8
#define GFXMMU_LUT391L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut391l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT391L_EN Enable **/
#define GFXMMU_LUT391L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut391h LUT391H Graphic MMU LUT entry 391 high
@{*/


