grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT391H_LO_SHIFT		4
#define GFXMMU_LUT391H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut391h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut392l LUT392L Graphic MMU LUT entry 392 low
@{*/


#define GFXMMU_LUT392L_LVB_SHIFT		16
#define GFXMMU_LUT392L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut392l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT392L_FVB_SHIFT		8
#define GFXMMU_LUT392L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut392l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT392L_EN Enable **/
#define GFXMMU_LUT392L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut392h LUT392H Graphic MMU LUT entry 392 high
@{*/


#define GFXMMU_LUT392H_LO_SHIFT		4
#define GFXMMU_LUT392H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut392h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut393l LUT393L Graphic MMU LUT entry 393 low
@{*/


#define GFXMMU_LUT393L_LVB_SHIFT		16
#define GFXMMU_LUT393L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut393l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT393L_FVB_SHIFT		8
#define GFXMMU_LUT393L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut393l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT393L_EN Enable **/
#define GFXMMU_LUT393L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut393h LUT393H Graphic MMU LUT entry 393 high
@{*/


#define GFXMMU_LUT393H_LO_SHIFT		4
#define GFXMMU_LUT393H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut393h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut394l LUT394L Graphic MMU LUT entry 394 low
@{*/


#define GFXMMU_LUT394L_LVB_SHIFT		16
#define GFXMMU_LUT394L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut394l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT394L_FVB_SHIFT		8
#define GFXMMU_LUT394L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut394l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT394L_EN Enable **/
#define GFXMMU_LUT394L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut394h LUT394H Graphic MMU LUT entry 394 high
@{*/


#define GFXMMU_LUT394H_LO_SHIFT		4
#define GFXMMU_LUT394H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut394h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut395l LUT395L Graphic MMU LUT entry 395 low
@{*/


#define GFXMMU_LUT395L_LVB_SHIFT		16
#define GFXMMU_LUT395L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut395l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT395L_FVB_SHIFT		8
#define GFXMMU_LUT395L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut395l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT395L_EN Enable **/
#define GFXMMU_LUT395L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut395h LUT395H Graphic MMU LUT entry 395 high
@{*/


#define GFXMMU_LUT395H_LO_SHIFT		4
#define GFXMMU_LUT395H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut395h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut396l LUT396L Graphic MMU LUT entry 396 low
@{*/


#define GFXMMU_LUT396L_LVB_SHIFT		16
#define GFXMMU_LUT396L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut396l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT396L_FVB_SHIFT		8
#define GFXMMU_LUT396L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut396l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT396L_EN Enable **/
#define GFXMMU_LUT396L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut396h LUT396H Graphic MMU LUT entry 396 high
@{*/


#define GFXMMU_LUT396H_LO_SHIFT		4
#define GFXMMU_LUT396H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut396h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut397l LUT397L Graphic MMU LUT entry 397 low
@{*/


#define GFXMMU_LUT397L_LVB_SHIFT		16
#define GFXMMU_LUT397L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut397l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT397L_FVB_SHIFT		8
#define GFXMMU_LUT397L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut397l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT397L_EN Enable **/
#define GFXMMU_LUT397L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut397h LUT397H Graphic MMU LUT entry 397 high
@{*/


#define GFXMMU_LUT397H_LO_SHIFT		4
#define GFXMMU_LUT397H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut397h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut398l LUT398L Graphic MMU LUT entry 398 low
@{*/


#define GFXMMU_LUT398L_LVB_SHIFT		16
#define GFXMMU_LUT398L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut398l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT398L_FVB_SHIFT		8
#define GFXMMU_LUT398L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut398l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT398L_EN Enable **/
#define GFXMMU_LUT398L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut398h LUT398H Graphic MMU LUT entry 398 high
@{*/


#define GFXMMU_LUT398H_LO_SHIFT		4
#define GFXMMU_LUT398H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut398h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut399l LUT399L Graphic MMU LUT entry 399 low
@{*/


#define GFXMMU_LUT399L_LVB_SHIFT		16
#define GFXMMU_LUT399L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut399l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT399L_FVB_SHIFT		8
#define GFXMMU_LUT399L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut399l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT399L_EN Enable **/
#define GFXMMU_LUT399L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut399h LUT399H Graphic MMU LUT entry 399 high
@{*/


#define GFXMMU_LUT399H_LO_SHIFT		4
#define GFXMMU_LUT399H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut399h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut400l LUT400L Graphic MMU LUT entry 400 low
@{*/


#define GFXMMU_LUT400L_LVB_SHIFT		16
#define GFXMMU_LUT400L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut400l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT400L_FVB_SHIFT		8
#define GFXMMU_LUT400L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut400l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT400L_EN Enable **/
#define GFXMMU_LUT400L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut400h LUT400H Graphic MMU LUT entry 400 high
@{*/


#define GFXMMU_LUT400H_LO_SHIFT		4
#define GFXMMU_LUT400H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut400h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut401l LUT401L Graphic MMU LUT entry 401 low
@{*/


#define GFXMMU_LUT401L_LVB_SHIFT		16
#define GFXMMU_LUT401L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut401l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT401L_FVB_SHIFT		8
#define GFXMMU_LUT401L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut401l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT401L_EN Enable **/
#define GFXMMU_LUT401L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut401h LUT401H Graphic MMU LUT entry 401 high
@{*/


#define GFXMMU_LUT401H_LO_SHIFT		4
#define GFXMMU_LUT401H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut401h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

