grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut402l LUT402L Graphic MMU LUT entry 402 low
@{*/


#define GFXMMU_LUT402L_LVB_SHIFT		16
#define GFXMMU_LUT402L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut402l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT402L_FVB_SHIFT		8
#define GFXMMU_LUT402L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut402l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT402L_EN Enable **/
#define GFXMMU_LUT402L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut402h LUT402H Graphic MMU LUT entry 402 high
@{*/


#define GFXMMU_LUT402H_LO_SHIFT		4
#define GFXMMU_LUT402H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut402h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut403l LUT403L Graphic MMU LUT entry 403 low
@{*/


#define GFXMMU_LUT403L_LVB_SHIFT		16
#define GFXMMU_LUT403L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut403l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT403L_FVB_SHIFT		8
#define GFXMMU_LUT403L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut403l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT403L_EN Enable **/
#define GFXMMU_LUT403L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut403h LUT403H Graphic MMU LUT entry 403 high
@{*/


#define GFXMMU_LUT403H_LO_SHIFT		4
#define GFXMMU_LUT403H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut403h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut404l LUT404L Graphic MMU LUT entry 404 low
@{*/


#define GFXMMU_LUT404L_LVB_SHIFT		16
#define GFXMMU_LUT404L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut404l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT404L_FVB_SHIFT		8
#define GFXMMU_LUT404L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut404l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT404L_EN Enable **/
#define GFXMMU_LUT404L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut404h LUT404H Graphic MMU LUT entry 404 high
@{*/


#define GFXMMU_LUT404H_LO_SHIFT		4
#define GFXMMU_LUT404H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut404h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut405l LUT405L Graphic MMU LUT entry 405 low
@{*/


#define GFXMMU_LUT405L_LVB_SHIFT		16
#define GFXMMU_LUT405L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut405l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT405L_FVB_SHIFT		8
#define GFXMMU_LUT405L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut405l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT405L_EN Enable **/
#define GFXMMU_LUT405L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut405h LUT405H Graphic MMU LUT entry 405 high
@{*/


#define GFXMMU_LUT405H_LO_SHIFT		4
#define GFXMMU_LUT405H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut405h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut406l LUT406L Graphic MMU LUT entry 406 low
@{*/


#define GFXMMU_LUT406L_LVB_SHIFT		16
#define GFXMMU_LUT406L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut406l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT406L_FVB_SHIFT		8
#define GFXMMU_LUT406L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut406l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT406L_EN Enable **/
#define GFXMMU_LUT406L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut406h LUT406H Graphic MMU LUT entry 406 high
@{*/


#define GFXMMU_LUT406H_LO_SHIFT		4
#define GFXMMU_LUT406H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut406h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut407l LUT407L Graphic MMU LUT entry 407 low
@{*/


#define GFXMMU_LUT407L_LVB_SHIFT		16
#define GFXMMU_LUT407L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut407l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT407L_FVB_SHIFT		8
#define GFXMMU_LUT407L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut407l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT407L_EN Enable **/
#define GFXMMU_LUT407L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut407h LUT407H Graphic MMU LUT entry 407 high
@{*/


#define GFXMMU_LUT407H_LO_SHIFT		4
#define GFXMMU_LUT407H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut407h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut408l LUT408L Graphic MMU LUT entry 408 low
@{*/


#define GFXMMU_LUT408L_LVB_SHIFT		16
#define GFXMMU_LUT408L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut408l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT408L_FVB_SHIFT		8
#define GFXMMU_LUT408L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut408l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT408L_EN Enable **/
#define GFXMMU_LUT408L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut408h LUT408H Graphic MMU LUT entry 408 high
@{*/


#define GFXMMU_LUT408H_LO_SHIFT		4
#define GFXMMU_LUT408H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut408h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut409l LUT409L Graphic MMU LUT entry 409 low
@{*/


#define GFXMMU_LUT409L_LVB_SHIFT		16
#define GFXMMU_LUT409L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut409l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT409L_FVB_SHIFT		8
#define GFXMMU_LUT409L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut409l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT409L_EN Enable **/
#define GFXMMU_LUT409L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut409h LUT409H Graphic MMU LUT entry 409 high
@{*/


#define GFXMMU_LUT409H_LO_SHIFT		4
#define GFXMMU_LUT409H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut409h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut410l LUT410L Graphic MMU LUT entry 410 low
@{*/


#define GFXMMU_LUT410L_LVB_SHIFT		16
#define GFXMMU_LUT410L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut410l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT410L_FVB_SHIFT		8
#define GFXMMU_LUT410L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut410l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT410L_EN Enable **/
#define GFXMMU_LUT410L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut410h LUT410H Graphic MMU LUT entry 410 high
@{*/


#define GFXMMU_LUT410H_LO_SHIFT		4
#define GFXMMU_LUT410H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut410h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut411l LUT411L Graphic MMU LUT entry 411 low
@{*/


#define GFXMMU_LUT411L_LVB_SHIFT		16
#define GFXMMU_LUT411L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut411l_lvb LVB Last Valid Block
@{*/
/**@}*/


