grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT411L_FVB_SHIFT		8
#define GFXMMU_LUT411L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut411l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT411L_EN Enable **/
#define GFXMMU_LUT411L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut411h LUT411H Graphic MMU LUT entry 411 high
@{*/


#define GFXMMU_LUT411H_LO_SHIFT		4
#define GFXMMU_LUT411H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut411h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut412l LUT412L Graphic MMU LUT entry 412 low
@{*/


#define GFXMMU_LUT412L_LVB_SHIFT		16
#define GFXMMU_LUT412L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut412l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT412L_FVB_SHIFT		8
#define GFXMMU_LUT412L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut412l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT412L_EN Enable **/
#define GFXMMU_LUT412L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut412h LUT412H Graphic MMU LUT entry 412 high
@{*/


#define GFXMMU_LUT412H_LO_SHIFT		4
#define GFXMMU_LUT412H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut412h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut413l LUT413L Graphic MMU LUT entry 413 low
@{*/


#define GFXMMU_LUT413L_LVB_SHIFT		16
#define GFXMMU_LUT413L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut413l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT413L_FVB_SHIFT		8
#define GFXMMU_LUT413L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut413l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT413L_EN Enable **/
#define GFXMMU_LUT413L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut413h LUT413H Graphic MMU LUT entry 413 high
@{*/


#define GFXMMU_LUT413H_LO_SHIFT		4
#define GFXMMU_LUT413H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut413h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut414l LUT414L Graphic MMU LUT entry 414 low
@{*/


#define GFXMMU_LUT414L_LVB_SHIFT		16
#define GFXMMU_LUT414L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut414l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT414L_FVB_SHIFT		8
#define GFXMMU_LUT414L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut414l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT414L_EN Enable **/
#define GFXMMU_LUT414L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut414h LUT414H Graphic MMU LUT entry 414 high
@{*/


#define GFXMMU_LUT414H_LO_SHIFT		4
#define GFXMMU_LUT414H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut414h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut415l LUT415L Graphic MMU LUT entry 415 low
@{*/


#define GFXMMU_LUT415L_LVB_SHIFT		16
#define GFXMMU_LUT415L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut415l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT415L_FVB_SHIFT		8
#define GFXMMU_LUT415L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut415l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT415L_EN Enable **/
#define GFXMMU_LUT415L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut415h LUT415H Graphic MMU LUT entry 415 high
@{*/


#define GFXMMU_LUT415H_LO_SHIFT		4
#define GFXMMU_LUT415H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut415h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut416l LUT416L Graphic MMU LUT entry 416 low
@{*/


#define GFXMMU_LUT416L_LVB_SHIFT		16
#define GFXMMU_LUT416L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut416l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT416L_FVB_SHIFT		8
#define GFXMMU_LUT416L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut416l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT416L_EN Enable **/
#define GFXMMU_LUT416L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut416h LUT416H Graphic MMU LUT entry 416 high
@{*/


#define GFXMMU_LUT416H_LO_SHIFT		4
#define GFXMMU_LUT416H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut416h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut417l LUT417L Graphic MMU LUT entry 417 low
@{*/


#define GFXMMU_LUT417L_LVB_SHIFT		16
#define GFXMMU_LUT417L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut417l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT417L_FVB_SHIFT		8
#define GFXMMU_LUT417L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut417l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT417L_EN Enable **/
#define GFXMMU_LUT417L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut417h LUT417H Graphic MMU LUT entry 417 high
@{*/


#define GFXMMU_LUT417H_LO_SHIFT		4
#define GFXMMU_LUT417H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut417h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut418l LUT418L Graphic MMU LUT entry 418 low
@{*/


#define GFXMMU_LUT418L_LVB_SHIFT		16
#define GFXMMU_LUT418L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut418l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT418L_FVB_SHIFT		8
#define GFXMMU_LUT418L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut418l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT418L_EN Enable **/
#define GFXMMU_LUT418L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut418h LUT418H Graphic MMU LUT entry 418 high
@{*/


#define GFXMMU_LUT418H_LO_SHIFT		4
#define GFXMMU_LUT418H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut418h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut419l LUT419L Graphic MMU LUT entry 419 low
@{*/


#define GFXMMU_LUT419L_LVB_SHIFT		16
#define GFXMMU_LUT419L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut419l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT419L_FVB_SHIFT		8
#define GFXMMU_LUT419L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut419l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT419L_EN Enable **/
#define GFXMMU_LUT419L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut419h LUT419H Graphic MMU LUT entry 419 high
@{*/


#define GFXMMU_LUT419H_LO_SHIFT		4
#define GFXMMU_LUT419H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut419h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut420l LUT420L Graphic MMU LUT entry 420 low
@{*/


#define GFXMMU_LUT420L_LVB_SHIFT		16
#define GFXMMU_LUT420L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut420l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT420L_FVB_SHIFT		8
#define GFXMMU_LUT420L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut420l_fvb FVB First Valid Block
@{*/
/**@}*/

