grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT420L_EN Enable **/
#define GFXMMU_LUT420L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut420h LUT420H Graphic MMU LUT entry 420 high
@{*/


#define GFXMMU_LUT420H_LO_SHIFT		4
#define GFXMMU_LUT420H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut420h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut421l LUT421L Graphic MMU LUT entry 421 low
@{*/


#define GFXMMU_LUT421L_LVB_SHIFT		16
#define GFXMMU_LUT421L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut421l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT421L_FVB_SHIFT		8
#define GFXMMU_LUT421L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut421l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT421L_EN Enable **/
#define GFXMMU_LUT421L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut421h LUT421H Graphic MMU LUT entry 421 high
@{*/


#define GFXMMU_LUT421H_LO_SHIFT		4
#define GFXMMU_LUT421H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut421h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut422l LUT422L Graphic MMU LUT entry 422 low
@{*/


#define GFXMMU_LUT422L_LVB_SHIFT		16
#define GFXMMU_LUT422L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut422l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT422L_FVB_SHIFT		8
#define GFXMMU_LUT422L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut422l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT422L_EN Enable **/
#define GFXMMU_LUT422L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut422h LUT422H Graphic MMU LUT entry 422 high
@{*/


#define GFXMMU_LUT422H_LO_SHIFT		4
#define GFXMMU_LUT422H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut422h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut423l LUT423L Graphic MMU LUT entry 423 low
@{*/


#define GFXMMU_LUT423L_LVB_SHIFT		16
#define GFXMMU_LUT423L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut423l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT423L_FVB_SHIFT		8
#define GFXMMU_LUT423L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut423l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT423L_EN Enable **/
#define GFXMMU_LUT423L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut423h LUT423H Graphic MMU LUT entry 423 high
@{*/


#define GFXMMU_LUT423H_LO_SHIFT		4
#define GFXMMU_LUT423H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut423h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut424l LUT424L Graphic MMU LUT entry 424 low
@{*/


#define GFXMMU_LUT424L_LVB_SHIFT		16
#define GFXMMU_LUT424L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut424l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT424L_FVB_SHIFT		8
#define GFXMMU_LUT424L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut424l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT424L_EN Enable **/
#define GFXMMU_LUT424L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut424h LUT424H Graphic MMU LUT entry 424 high
@{*/


#define GFXMMU_LUT424H_LO_SHIFT		4
#define GFXMMU_LUT424H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut424h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut425l LUT425L Graphic MMU LUT entry 425 low
@{*/


#define GFXMMU_LUT425L_LVB_SHIFT		16
#define GFXMMU_LUT425L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut425l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT425L_FVB_SHIFT		8
#define GFXMMU_LUT425L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut425l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT425L_EN Enable **/
#define GFXMMU_LUT425L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut425h LUT425H Graphic MMU LUT entry 425 high
@{*/


#define GFXMMU_LUT425H_LO_SHIFT		4
#define GFXMMU_LUT425H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut425h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut426l LUT426L Graphic MMU LUT entry 426 low
@{*/


#define GFXMMU_LUT426L_LVB_SHIFT		16
#define GFXMMU_LUT426L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut426l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT426L_FVB_SHIFT		8
#define GFXMMU_LUT426L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut426l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT426L_EN Enable **/
#define GFXMMU_LUT426L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut426h LUT426H Graphic MMU LUT entry 426 high
@{*/


#define GFXMMU_LUT426H_LO_SHIFT		4
#define GFXMMU_LUT426H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut426h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut427l LUT427L Graphic MMU LUT entry 427 low
@{*/


#define GFXMMU_LUT427L_LVB_SHIFT		16
#define GFXMMU_LUT427L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut427l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT427L_FVB_SHIFT		8
#define GFXMMU_LUT427L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut427l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT427L_EN Enable **/
#define GFXMMU_LUT427L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut427h LUT427H Graphic MMU LUT entry 427 high
@{*/


#define GFXMMU_LUT427H_LO_SHIFT		4
#define GFXMMU_LUT427H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut427h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut428l LUT428L Graphic MMU LUT entry 428 low
@{*/


#define GFXMMU_LUT428L_LVB_SHIFT		16
#define GFXMMU_LUT428L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut428l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT428L_FVB_SHIFT		8
#define GFXMMU_LUT428L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut428l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT428L_EN Enable **/
#define GFXMMU_LUT428L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut428h LUT428H Graphic MMU LUT entry 428 high
@{*/


#define GFXMMU_LUT428H_LO_SHIFT		4
#define GFXMMU_LUT428H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut428h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut429l LUT429L Graphic MMU LUT entry 429 low
@{*/


#define GFXMMU_LUT429L_LVB_SHIFT		16
#define GFXMMU_LUT429L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut429l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT429L_FVB_SHIFT		8
#define GFXMMU_LUT429L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut429l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT429L_EN Enable **/
#define GFXMMU_LUT429L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut429h LUT429H Graphic MMU LUT entry 429 high
@{*/


#define GFXMMU_LUT429H_LO_SHIFT		4
#define GFXMMU_LUT429H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut429h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut430l LUT430L Graphic MMU LUT entry 430 low
@{*/


