grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT430L_LVB_SHIFT		16
#define GFXMMU_LUT430L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut430l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT430L_FVB_SHIFT		8
#define GFXMMU_LUT430L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut430l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT430L_EN Enable **/
#define GFXMMU_LUT430L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut430h LUT430H Graphic MMU LUT entry 430 high
@{*/


#define GFXMMU_LUT430H_LO_SHIFT		4
#define GFXMMU_LUT430H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut430h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut431l LUT431L Graphic MMU LUT entry 431 low
@{*/


#define GFXMMU_LUT431L_LVB_SHIFT		16
#define GFXMMU_LUT431L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut431l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT431L_FVB_SHIFT		8
#define GFXMMU_LUT431L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut431l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT431L_EN Enable **/
#define GFXMMU_LUT431L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut431h LUT431H Graphic MMU LUT entry 431 high
@{*/


#define GFXMMU_LUT431H_LO_SHIFT		4
#define GFXMMU_LUT431H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut431h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut432l LUT432L Graphic MMU LUT entry 432 low
@{*/


#define GFXMMU_LUT432L_LVB_SHIFT		16
#define GFXMMU_LUT432L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut432l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT432L_FVB_SHIFT		8
#define GFXMMU_LUT432L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut432l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT432L_EN Enable **/
#define GFXMMU_LUT432L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut432h LUT432H Graphic MMU LUT entry 432 high
@{*/


#define GFXMMU_LUT432H_LO_SHIFT		4
#define GFXMMU_LUT432H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut432h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut433l LUT433L Graphic MMU LUT entry 433 low
@{*/


#define GFXMMU_LUT433L_LVB_SHIFT		16
#define GFXMMU_LUT433L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut433l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT433L_FVB_SHIFT		8
#define GFXMMU_LUT433L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut433l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT433L_EN Enable **/
#define GFXMMU_LUT433L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut433h LUT433H Graphic MMU LUT entry 433 high
@{*/


#define GFXMMU_LUT433H_LO_SHIFT		4
#define GFXMMU_LUT433H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut433h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut434l LUT434L Graphic MMU LUT entry 434 low
@{*/


#define GFXMMU_LUT434L_LVB_SHIFT		16
#define GFXMMU_LUT434L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut434l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT434L_FVB_SHIFT		8
#define GFXMMU_LUT434L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut434l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT434L_EN Enable **/
#define GFXMMU_LUT434L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut434h LUT434H Graphic MMU LUT entry 434 high
@{*/


#define GFXMMU_LUT434H_LO_SHIFT		4
#define GFXMMU_LUT434H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut434h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut435l LUT435L Graphic MMU LUT entry 435 low
@{*/


#define GFXMMU_LUT435L_LVB_SHIFT		16
#define GFXMMU_LUT435L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut435l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT435L_FVB_SHIFT		8
#define GFXMMU_LUT435L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut435l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT435L_EN Enable **/
#define GFXMMU_LUT435L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut435h LUT435H Graphic MMU LUT entry 435 high
@{*/


#define GFXMMU_LUT435H_LO_SHIFT		4
#define GFXMMU_LUT435H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut435h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut436l LUT436L Graphic MMU LUT entry 436 low
@{*/


#define GFXMMU_LUT436L_LVB_SHIFT		16
#define GFXMMU_LUT436L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut436l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT436L_FVB_SHIFT		8
#define GFXMMU_LUT436L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut436l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT436L_EN Enable **/
#define GFXMMU_LUT436L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut436h LUT436H Graphic MMU LUT entry 436 high
@{*/


#define GFXMMU_LUT436H_LO_SHIFT		4
#define GFXMMU_LUT436H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut436h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut437l LUT437L Graphic MMU LUT entry 437 low
@{*/


#define GFXMMU_LUT437L_LVB_SHIFT		16
#define GFXMMU_LUT437L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut437l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT437L_FVB_SHIFT		8
#define GFXMMU_LUT437L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut437l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT437L_EN Enable **/
#define GFXMMU_LUT437L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut437h LUT437H Graphic MMU LUT entry 437 high
@{*/


#define GFXMMU_LUT437H_LO_SHIFT		4
#define GFXMMU_LUT437H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut437h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut438l LUT438L Graphic MMU LUT entry 438 low
@{*/


#define GFXMMU_LUT438L_LVB_SHIFT		16
#define GFXMMU_LUT438L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut438l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT438L_FVB_SHIFT		8
#define GFXMMU_LUT438L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut438l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT438L_EN Enable **/
#define GFXMMU_LUT438L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut438h LUT438H Graphic MMU LUT entry 438 high
@{*/


#define GFXMMU_LUT438H_LO_SHIFT		4
#define GFXMMU_LUT438H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut438h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut439l LUT439L Graphic MMU LUT entry 439 low
@{*/


#define GFXMMU_LUT439L_LVB_SHIFT		16
#define GFXMMU_LUT439L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut439l_lvb LVB Last Valid Block
@{*/
/**@}*/


