grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT439L_FVB_SHIFT		8
#define GFXMMU_LUT439L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut439l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT439L_EN Enable **/
#define GFXMMU_LUT439L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut439h LUT439H Graphic MMU LUT entry 439 high
@{*/


#define GFXMMU_LUT439H_LO_SHIFT		4
#define GFXMMU_LUT439H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut439h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut440l LUT440L Graphic MMU LUT entry 440 low
@{*/


#define GFXMMU_LUT440L_LVB_SHIFT		16
#define GFXMMU_LUT440L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut440l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT440L_FVB_SHIFT		8
#define GFXMMU_LUT440L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut440l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT440L_EN Enable **/
#define GFXMMU_LUT440L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut440h LUT440H Graphic MMU LUT entry 440 high
@{*/


#define GFXMMU_LUT440H_LO_SHIFT		4
#define GFXMMU_LUT440H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut440h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut441l LUT441L Graphic MMU LUT entry 441 low
@{*/


#define GFXMMU_LUT441L_LVB_SHIFT		16
#define GFXMMU_LUT441L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut441l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT441L_FVB_SHIFT		8
#define GFXMMU_LUT441L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut441l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT441L_EN Enable **/
#define GFXMMU_LUT441L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut441h LUT441H Graphic MMU LUT entry 441 high
@{*/


#define GFXMMU_LUT441H_LO_SHIFT		4
#define GFXMMU_LUT441H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut441h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut442l LUT442L Graphic MMU LUT entry 442 low
@{*/


#define GFXMMU_LUT442L_LVB_SHIFT		16
#define GFXMMU_LUT442L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut442l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT442L_FVB_SHIFT		8
#define GFXMMU_LUT442L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut442l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT442L_EN Enable **/
#define GFXMMU_LUT442L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut442h LUT442H Graphic MMU LUT entry 442 high
@{*/


#define GFXMMU_LUT442H_LO_SHIFT		4
#define GFXMMU_LUT442H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut442h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut443l LUT443L Graphic MMU LUT entry 443 low
@{*/


#define GFXMMU_LUT443L_LVB_SHIFT		16
#define GFXMMU_LUT443L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut443l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT443L_FVB_SHIFT		8
#define GFXMMU_LUT443L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut443l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT443L_EN Enable **/
#define GFXMMU_LUT443L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut443h LUT443H Graphic MMU LUT entry 443 high
@{*/


#define GFXMMU_LUT443H_LO_SHIFT		4
#define GFXMMU_LUT443H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut443h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut444l LUT444L Graphic MMU LUT entry 444 low
@{*/


#define GFXMMU_LUT444L_LVB_SHIFT		16
#define GFXMMU_LUT444L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut444l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT444L_FVB_SHIFT		8
#define GFXMMU_LUT444L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut444l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT444L_EN Enable **/
#define GFXMMU_LUT444L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut444h LUT444H Graphic MMU LUT entry 444 high
@{*/


#define GFXMMU_LUT444H_LO_SHIFT		4
#define GFXMMU_LUT444H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut444h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut445l LUT445L Graphic MMU LUT entry 445 low
@{*/


#define GFXMMU_LUT445L_LVB_SHIFT		16
#define GFXMMU_LUT445L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut445l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT445L_FVB_SHIFT		8
#define GFXMMU_LUT445L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut445l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT445L_EN Enable **/
#define GFXMMU_LUT445L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut445h LUT445H Graphic MMU LUT entry 445 high
@{*/


#define GFXMMU_LUT445H_LO_SHIFT		4
#define GFXMMU_LUT445H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut445h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut446l LUT446L Graphic MMU LUT entry 446 low
@{*/


#define GFXMMU_LUT446L_LVB_SHIFT		16
#define GFXMMU_LUT446L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut446l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT446L_FVB_SHIFT		8
#define GFXMMU_LUT446L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut446l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT446L_EN Enable **/
#define GFXMMU_LUT446L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut446h LUT446H Graphic MMU LUT entry 446 high
@{*/


#define GFXMMU_LUT446H_LO_SHIFT		4
#define GFXMMU_LUT446H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut446h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut447l LUT447L Graphic MMU LUT entry 447 low
@{*/


#define GFXMMU_LUT447L_LVB_SHIFT		16
#define GFXMMU_LUT447L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut447l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT447L_FVB_SHIFT		8
#define GFXMMU_LUT447L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut447l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT447L_EN Enable **/
#define GFXMMU_LUT447L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut447h LUT447H Graphic MMU LUT entry 447 high
@{*/


#define GFXMMU_LUT447H_LO_SHIFT		4
#define GFXMMU_LUT447H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut447h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut448l LUT448L Graphic MMU LUT entry 448 low
@{*/


#define GFXMMU_LUT448L_LVB_SHIFT		16
#define GFXMMU_LUT448L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut448l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT448L_FVB_SHIFT		8
#define GFXMMU_LUT448L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut448l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT448L_EN Enable **/
#define GFXMMU_LUT448L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut448h LUT448H Graphic MMU LUT entry 448 high
@{*/


#define GFXMMU_LUT448H_LO_SHIFT		4
#define GFXMMU_LUT448H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut448h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut449l LUT449L Graphic MMU LUT entry 449 low
@{*/


#define GFXMMU_LUT449L_LVB_SHIFT		16
#define GFXMMU_LUT449L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut449l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT449L_FVB_SHIFT		8
#define GFXMMU_LUT449L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut449l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT449L_EN Enable **/
#define GFXMMU_LUT449L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut449h LUT449H Graphic MMU LUT entry 449 high
@{*/


#define GFXMMU_LUT449H_LO_SHIFT		4
#define GFXMMU_LUT449H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut449h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut450l LUT450L Graphic MMU LUT entry 450 low
@{*/


