grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT450L_LVB_SHIFT		16
#define GFXMMU_LUT450L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut450l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT450L_FVB_SHIFT		8
#define GFXMMU_LUT450L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut450l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT450L_EN Enable **/
#define GFXMMU_LUT450L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut450h LUT450H Graphic MMU LUT entry 450 high
@{*/


#define GFXMMU_LUT450H_LO_SHIFT		4
#define GFXMMU_LUT450H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut450h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut451l LUT451L Graphic MMU LUT entry 451 low
@{*/


#define GFXMMU_LUT451L_LVB_SHIFT		16
#define GFXMMU_LUT451L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut451l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT451L_FVB_SHIFT		8
#define GFXMMU_LUT451L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut451l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT451L_EN Enable **/
#define GFXMMU_LUT451L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut451h LUT451H Graphic MMU LUT entry 451 high
@{*/


#define GFXMMU_LUT451H_LO_SHIFT		4
#define GFXMMU_LUT451H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut451h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut452l LUT452L Graphic MMU LUT entry 452 low
@{*/


#define GFXMMU_LUT452L_LVB_SHIFT		16
#define GFXMMU_LUT452L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut452l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT452L_FVB_SHIFT		8
#define GFXMMU_LUT452L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut452l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT452L_EN Enable **/
#define GFXMMU_LUT452L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut452h LUT452H Graphic MMU LUT entry 452 high
@{*/


#define GFXMMU_LUT452H_LO_SHIFT		4
#define GFXMMU_LUT452H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut452h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut453l LUT453L Graphic MMU LUT entry 453 low
@{*/


#define GFXMMU_LUT453L_LVB_SHIFT		16
#define GFXMMU_LUT453L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut453l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT453L_FVB_SHIFT		8
#define GFXMMU_LUT453L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut453l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT453L_EN Enable **/
#define GFXMMU_LUT453L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut453h LUT453H Graphic MMU LUT entry 453 high
@{*/


#define GFXMMU_LUT453H_LO_SHIFT		4
#define GFXMMU_LUT453H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut453h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut454l LUT454L Graphic MMU LUT entry 454 low
@{*/


#define GFXMMU_LUT454L_LVB_SHIFT		16
#define GFXMMU_LUT454L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut454l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT454L_FVB_SHIFT		8
#define GFXMMU_LUT454L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut454l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT454L_EN Enable **/
#define GFXMMU_LUT454L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut454h LUT454H Graphic MMU LUT entry 454 high
@{*/


#define GFXMMU_LUT454H_LO_SHIFT		4
#define GFXMMU_LUT454H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut454h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut455l LUT455L Graphic MMU LUT entry 455 low
@{*/


#define GFXMMU_LUT455L_LVB_SHIFT		16
#define GFXMMU_LUT455L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut455l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT455L_FVB_SHIFT		8
#define GFXMMU_LUT455L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut455l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT455L_EN Enable **/
#define GFXMMU_LUT455L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut455h LUT455H Graphic MMU LUT entry 455 high
@{*/


#define GFXMMU_LUT455H_LO_SHIFT		4
#define GFXMMU_LUT455H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut455h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut456l LUT456L Graphic MMU LUT entry 456 low
@{*/


#define GFXMMU_LUT456L_LVB_SHIFT		16
#define GFXMMU_LUT456L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut456l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT456L_FVB_SHIFT		8
#define GFXMMU_LUT456L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut456l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT456L_EN Enable **/
#define GFXMMU_LUT456L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut456h LUT456H Graphic MMU LUT entry 456 high
@{*/


#define GFXMMU_LUT456H_LO_SHIFT		4
#define GFXMMU_LUT456H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut456h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut457l LUT457L Graphic MMU LUT entry 457 low
@{*/


#define GFXMMU_LUT457L_LVB_SHIFT		16
#define GFXMMU_LUT457L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut457l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT457L_FVB_SHIFT		8
#define GFXMMU_LUT457L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut457l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT457L_EN Enable **/
#define GFXMMU_LUT457L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut457h LUT457H Graphic MMU LUT entry 457 high
@{*/


#define GFXMMU_LUT457H_LO_SHIFT		4
#define GFXMMU_LUT457H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut457h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut458l LUT458L Graphic MMU LUT entry 458 low
@{*/


#define GFXMMU_LUT458L_LVB_SHIFT		16
#define GFXMMU_LUT458L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut458l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT458L_FVB_SHIFT		8
#define GFXMMU_LUT458L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut458l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT458L_EN Enable **/
#define GFXMMU_LUT458L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut458h LUT458H Graphic MMU LUT entry 458 high
@{*/


#define GFXMMU_LUT458H_LO_SHIFT		4
#define GFXMMU_LUT458H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut458h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut459l LUT459L Graphic MMU LUT entry 459 low
@{*/


#define GFXMMU_LUT459L_LVB_SHIFT		16
#define GFXMMU_LUT459L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut459l_lvb LVB Last Valid Block
@{*/
/**@}*/


