grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT459L_FVB_SHIFT		8
#define GFXMMU_LUT459L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut459l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT459L_EN Enable **/
#define GFXMMU_LUT459L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut459h LUT459H Graphic MMU LUT entry 459 high
@{*/


#define GFXMMU_LUT459H_LO_SHIFT		4
#define GFXMMU_LUT459H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut459h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut460l LUT460L Graphic MMU LUT entry 460 low
@{*/


#define GFXMMU_LUT460L_LVB_SHIFT		16
#define GFXMMU_LUT460L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut460l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT460L_FVB_SHIFT		8
#define GFXMMU_LUT460L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut460l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT460L_EN Enable **/
#define GFXMMU_LUT460L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut460h LUT460H Graphic MMU LUT entry 460 high
@{*/


#define GFXMMU_LUT460H_LO_SHIFT		4
#define GFXMMU_LUT460H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut460h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut461l LUT461L Graphic MMU LUT entry 461 low
@{*/


#define GFXMMU_LUT461L_LVB_SHIFT		16
#define GFXMMU_LUT461L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut461l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT461L_FVB_SHIFT		8
#define GFXMMU_LUT461L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut461l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT461L_EN Enable **/
#define GFXMMU_LUT461L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut461h LUT461H Graphic MMU LUT entry 461 high
@{*/


#define GFXMMU_LUT461H_LO_SHIFT		4
#define GFXMMU_LUT461H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut461h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut462l LUT462L Graphic MMU LUT entry 462 low
@{*/


#define GFXMMU_LUT462L_LVB_SHIFT		16
#define GFXMMU_LUT462L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut462l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT462L_FVB_SHIFT		8
#define GFXMMU_LUT462L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut462l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT462L_EN Enable **/
#define GFXMMU_LUT462L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut462h LUT462H Graphic MMU LUT entry 462 high
@{*/


#define GFXMMU_LUT462H_LO_SHIFT		4
#define GFXMMU_LUT462H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut462h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut463l LUT463L Graphic MMU LUT entry 463 low
@{*/


#define GFXMMU_LUT463L_LVB_SHIFT		16
#define GFXMMU_LUT463L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut463l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT463L_FVB_SHIFT		8
#define GFXMMU_LUT463L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut463l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT463L_EN Enable **/
#define GFXMMU_LUT463L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut463h LUT463H Graphic MMU LUT entry 463 high
@{*/


#define GFXMMU_LUT463H_LO_SHIFT		4
#define GFXMMU_LUT463H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut463h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut464l LUT464L Graphic MMU LUT entry 464 low
@{*/


#define GFXMMU_LUT464L_LVB_SHIFT		16
#define GFXMMU_LUT464L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut464l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT464L_FVB_SHIFT		8
#define GFXMMU_LUT464L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut464l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT464L_EN Enable **/
#define GFXMMU_LUT464L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut464h LUT464H Graphic MMU LUT entry 464 high
@{*/


#define GFXMMU_LUT464H_LO_SHIFT		4
#define GFXMMU_LUT464H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut464h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut465l LUT465L Graphic MMU LUT entry 465 low
@{*/


#define GFXMMU_LUT465L_LVB_SHIFT		16
#define GFXMMU_LUT465L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut465l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT465L_FVB_SHIFT		8
#define GFXMMU_LUT465L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut465l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT465L_EN Enable **/
#define GFXMMU_LUT465L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut465h LUT465H Graphic MMU LUT entry 465 high
@{*/


#define GFXMMU_LUT465H_LO_SHIFT		4
#define GFXMMU_LUT465H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut465h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut466l LUT466L Graphic MMU LUT entry 466 low
@{*/


#define GFXMMU_LUT466L_LVB_SHIFT		16
#define GFXMMU_LUT466L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut466l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT466L_FVB_SHIFT		8
#define GFXMMU_LUT466L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut466l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT466L_EN Enable **/
#define GFXMMU_LUT466L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut466h LUT466H Graphic MMU LUT entry 466 high
@{*/


#define GFXMMU_LUT466H_LO_SHIFT		4
#define GFXMMU_LUT466H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut466h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut467l LUT467L Graphic MMU LUT entry 467 low
@{*/


#define GFXMMU_LUT467L_LVB_SHIFT		16
#define GFXMMU_LUT467L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut467l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT467L_FVB_SHIFT		8
#define GFXMMU_LUT467L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut467l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT467L_EN Enable **/
#define GFXMMU_LUT467L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut467h LUT467H Graphic MMU LUT entry 467 high
@{*/


#define GFXMMU_LUT467H_LO_SHIFT		4
#define GFXMMU_LUT467H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut467h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut468l LUT468L Graphic MMU LUT entry 468 low
@{*/


#define GFXMMU_LUT468L_LVB_SHIFT		16
#define GFXMMU_LUT468L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut468l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT468L_FVB_SHIFT		8
#define GFXMMU_LUT468L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut468l_fvb FVB First Valid Block
@{*/
/**@}*/

