grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT468L_EN Enable **/
#define GFXMMU_LUT468L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut468h LUT468H Graphic MMU LUT entry 468 high
@{*/


#define GFXMMU_LUT468H_LO_SHIFT		4
#define GFXMMU_LUT468H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut468h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut469l LUT469L Graphic MMU LUT entry 469 low
@{*/


#define GFXMMU_LUT469L_LVB_SHIFT		16
#define GFXMMU_LUT469L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut469l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT469L_FVB_SHIFT		8
#define GFXMMU_LUT469L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut469l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT469L_EN Enable **/
#define GFXMMU_LUT469L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut469h LUT469H Graphic MMU LUT entry 469 high
@{*/


#define GFXMMU_LUT469H_LO_SHIFT		4
#define GFXMMU_LUT469H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut469h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut470l LUT470L Graphic MMU LUT entry 470 low
@{*/


#define GFXMMU_LUT470L_LVB_SHIFT		16
#define GFXMMU_LUT470L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut470l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT470L_FVB_SHIFT		8
#define GFXMMU_LUT470L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut470l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT470L_EN Enable **/
#define GFXMMU_LUT470L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut470h LUT470H Graphic MMU LUT entry 470 high
@{*/


#define GFXMMU_LUT470H_LO_SHIFT		4
#define GFXMMU_LUT470H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut470h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut471l LUT471L Graphic MMU LUT entry 471 low
@{*/


#define GFXMMU_LUT471L_LVB_SHIFT		16
#define GFXMMU_LUT471L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut471l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT471L_FVB_SHIFT		8
#define GFXMMU_LUT471L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut471l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT471L_EN Enable **/
#define GFXMMU_LUT471L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut471h LUT471H Graphic MMU LUT entry 471 high
@{*/


#define GFXMMU_LUT471H_LO_SHIFT		4
#define GFXMMU_LUT471H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut471h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut472l LUT472L Graphic MMU LUT entry 472 low
@{*/


#define GFXMMU_LUT472L_LVB_SHIFT		16
#define GFXMMU_LUT472L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut472l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT472L_FVB_SHIFT		8
#define GFXMMU_LUT472L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut472l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT472L_EN Enable **/
#define GFXMMU_LUT472L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut472h LUT472H Graphic MMU LUT entry 472 high
@{*/


#define GFXMMU_LUT472H_LO_SHIFT		4
#define GFXMMU_LUT472H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut472h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut473l LUT473L Graphic MMU LUT entry 473 low
@{*/


#define GFXMMU_LUT473L_LVB_SHIFT		16
#define GFXMMU_LUT473L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut473l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT473L_FVB_SHIFT		8
#define GFXMMU_LUT473L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut473l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT473L_EN Enable **/
#define GFXMMU_LUT473L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut473h LUT473H Graphic MMU LUT entry 473 high
@{*/


#define GFXMMU_LUT473H_LO_SHIFT		4
#define GFXMMU_LUT473H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut473h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut474l LUT474L Graphic MMU LUT entry 474 low
@{*/


#define GFXMMU_LUT474L_LVB_SHIFT		16
#define GFXMMU_LUT474L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut474l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT474L_FVB_SHIFT		8
#define GFXMMU_LUT474L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut474l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT474L_EN Enable **/
#define GFXMMU_LUT474L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut474h LUT474H Graphic MMU LUT entry 474 high
@{*/


#define GFXMMU_LUT474H_LO_SHIFT		4
#define GFXMMU_LUT474H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut474h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut475l LUT475L Graphic MMU LUT entry 475 low
@{*/


#define GFXMMU_LUT475L_LVB_SHIFT		16
#define GFXMMU_LUT475L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut475l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT475L_FVB_SHIFT		8
#define GFXMMU_LUT475L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut475l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT475L_EN Enable **/
#define GFXMMU_LUT475L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut475h LUT475H Graphic MMU LUT entry 475 high
@{*/


#define GFXMMU_LUT475H_LO_SHIFT		4
#define GFXMMU_LUT475H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut475h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut476l LUT476L Graphic MMU LUT entry 476 low
@{*/


#define GFXMMU_LUT476L_LVB_SHIFT		16
#define GFXMMU_LUT476L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut476l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT476L_FVB_SHIFT		8
#define GFXMMU_LUT476L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut476l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT476L_EN Enable **/
#define GFXMMU_LUT476L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut476h LUT476H Graphic MMU LUT entry 476 high
@{*/


#define GFXMMU_LUT476H_LO_SHIFT		4
#define GFXMMU_LUT476H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut476h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut477l LUT477L Graphic MMU LUT entry 477 low
@{*/


#define GFXMMU_LUT477L_LVB_SHIFT		16
#define GFXMMU_LUT477L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut477l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT477L_FVB_SHIFT		8
#define GFXMMU_LUT477L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut477l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT477L_EN Enable **/
#define GFXMMU_LUT477L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut477h LUT477H Graphic MMU LUT entry 477 high
@{*/


#define GFXMMU_LUT477H_LO_SHIFT		4
#define GFXMMU_LUT477H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut477h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut478l LUT478L Graphic MMU LUT entry 478 low
@{*/


