grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT478L_LVB_SHIFT		16
#define GFXMMU_LUT478L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut478l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT478L_FVB_SHIFT		8
#define GFXMMU_LUT478L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut478l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT478L_EN Enable **/
#define GFXMMU_LUT478L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut478h LUT478H Graphic MMU LUT entry 478 high
@{*/


#define GFXMMU_LUT478H_LO_SHIFT		4
#define GFXMMU_LUT478H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut478h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut479l LUT479L Graphic MMU LUT entry 479 low
@{*/


#define GFXMMU_LUT479L_LVB_SHIFT		16
#define GFXMMU_LUT479L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut479l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT479L_FVB_SHIFT		8
#define GFXMMU_LUT479L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut479l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT479L_EN Enable **/
#define GFXMMU_LUT479L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut479h LUT479H Graphic MMU LUT entry 479 high
@{*/


#define GFXMMU_LUT479H_LO_SHIFT		4
#define GFXMMU_LUT479H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut479h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut480l LUT480L Graphic MMU LUT entry 480 low
@{*/


#define GFXMMU_LUT480L_LVB_SHIFT		16
#define GFXMMU_LUT480L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut480l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT480L_FVB_SHIFT		8
#define GFXMMU_LUT480L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut480l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT480L_EN Enable **/
#define GFXMMU_LUT480L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut480h LUT480H Graphic MMU LUT entry 480 high
@{*/


#define GFXMMU_LUT480H_LO_SHIFT		4
#define GFXMMU_LUT480H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut480h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut481l LUT481L Graphic MMU LUT entry 481 low
@{*/


#define GFXMMU_LUT481L_LVB_SHIFT		16
#define GFXMMU_LUT481L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut481l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT481L_FVB_SHIFT		8
#define GFXMMU_LUT481L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut481l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT481L_EN Enable **/
#define GFXMMU_LUT481L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut481h LUT481H Graphic MMU LUT entry 481 high
@{*/


#define GFXMMU_LUT481H_LO_SHIFT		4
#define GFXMMU_LUT481H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut481h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut482l LUT482L Graphic MMU LUT entry 482 low
@{*/


#define GFXMMU_LUT482L_LVB_SHIFT		16
#define GFXMMU_LUT482L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut482l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT482L_FVB_SHIFT		8
#define GFXMMU_LUT482L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut482l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT482L_EN Enable **/
#define GFXMMU_LUT482L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut482h LUT482H Graphic MMU LUT entry 482 high
@{*/


#define GFXMMU_LUT482H_LO_SHIFT		4
#define GFXMMU_LUT482H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut482h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut483l LUT483L Graphic MMU LUT entry 483 low
@{*/


#define GFXMMU_LUT483L_LVB_SHIFT		16
#define GFXMMU_LUT483L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut483l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT483L_FVB_SHIFT		8
#define GFXMMU_LUT483L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut483l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT483L_EN Enable **/
#define GFXMMU_LUT483L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut483h LUT483H Graphic MMU LUT entry 483 high
@{*/


#define GFXMMU_LUT483H_LO_SHIFT		4
#define GFXMMU_LUT483H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut483h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut484l LUT484L Graphic MMU LUT entry 484 low
@{*/


#define GFXMMU_LUT484L_LVB_SHIFT		16
#define GFXMMU_LUT484L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut484l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT484L_FVB_SHIFT		8
#define GFXMMU_LUT484L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut484l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT484L_EN Enable **/
#define GFXMMU_LUT484L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut484h LUT484H Graphic MMU LUT entry 484 high
@{*/


#define GFXMMU_LUT484H_LO_SHIFT		4
#define GFXMMU_LUT484H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut484h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut485l LUT485L Graphic MMU LUT entry 485 low
@{*/


#define GFXMMU_LUT485L_LVB_SHIFT		16
#define GFXMMU_LUT485L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut485l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT485L_FVB_SHIFT		8
#define GFXMMU_LUT485L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut485l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT485L_EN Enable **/
#define GFXMMU_LUT485L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut485h LUT485H Graphic MMU LUT entry 485 high
@{*/


#define GFXMMU_LUT485H_LO_SHIFT		4
#define GFXMMU_LUT485H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut485h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut486l LUT486L Graphic MMU LUT entry 486 low
@{*/


#define GFXMMU_LUT486L_LVB_SHIFT		16
#define GFXMMU_LUT486L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut486l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT486L_FVB_SHIFT		8
#define GFXMMU_LUT486L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut486l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT486L_EN Enable **/
#define GFXMMU_LUT486L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut486h LUT486H Graphic MMU LUT entry 486 high
@{*/


#define GFXMMU_LUT486H_LO_SHIFT		4
#define GFXMMU_LUT486H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut486h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut487l LUT487L Graphic MMU LUT entry 487 low
@{*/


#define GFXMMU_LUT487L_LVB_SHIFT		16
#define GFXMMU_LUT487L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut487l_lvb LVB Last Valid Block
@{*/
/**@}*/


