grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT487L_FVB_SHIFT		8
#define GFXMMU_LUT487L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut487l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT487L_EN Enable **/
#define GFXMMU_LUT487L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut487h LUT487H Graphic MMU LUT entry 487 high
@{*/


#define GFXMMU_LUT487H_LO_SHIFT		4
#define GFXMMU_LUT487H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut487h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut488l LUT488L Graphic MMU LUT entry 488 low
@{*/


#define GFXMMU_LUT488L_LVB_SHIFT		16
#define GFXMMU_LUT488L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut488l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT488L_FVB_SHIFT		8
#define GFXMMU_LUT488L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut488l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT488L_EN Enable **/
#define GFXMMU_LUT488L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut488h LUT488H Graphic MMU LUT entry 488 high
@{*/


#define GFXMMU_LUT488H_LO_SHIFT		4
#define GFXMMU_LUT488H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut488h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut489l LUT489L Graphic MMU LUT entry 489 low
@{*/


#define GFXMMU_LUT489L_LVB_SHIFT		16
#define GFXMMU_LUT489L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut489l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT489L_FVB_SHIFT		8
#define GFXMMU_LUT489L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut489l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT489L_EN Enable **/
#define GFXMMU_LUT489L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut489h LUT489H Graphic MMU LUT entry 489 high
@{*/


#define GFXMMU_LUT489H_LO_SHIFT		4
#define GFXMMU_LUT489H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut489h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut490l LUT490L Graphic MMU LUT entry 490 low
@{*/


#define GFXMMU_LUT490L_LVB_SHIFT		16
#define GFXMMU_LUT490L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut490l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT490L_FVB_SHIFT		8
#define GFXMMU_LUT490L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut490l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT490L_EN Enable **/
#define GFXMMU_LUT490L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut490h LUT490H Graphic MMU LUT entry 490 high
@{*/


#define GFXMMU_LUT490H_LO_SHIFT		4
#define GFXMMU_LUT490H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut490h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut491l LUT491L Graphic MMU LUT entry 491 low
@{*/


#define GFXMMU_LUT491L_LVB_SHIFT		16
#define GFXMMU_LUT491L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut491l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT491L_FVB_SHIFT		8
#define GFXMMU_LUT491L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut491l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT491L_EN Enable **/
#define GFXMMU_LUT491L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut491h LUT491H Graphic MMU LUT entry 491 high
@{*/


#define GFXMMU_LUT491H_LO_SHIFT		4
#define GFXMMU_LUT491H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut491h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut492l LUT492L Graphic MMU LUT entry 492 low
@{*/


#define GFXMMU_LUT492L_LVB_SHIFT		16
#define GFXMMU_LUT492L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut492l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT492L_FVB_SHIFT		8
#define GFXMMU_LUT492L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut492l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT492L_EN Enable **/
#define GFXMMU_LUT492L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut492h LUT492H Graphic MMU LUT entry 492 high
@{*/


#define GFXMMU_LUT492H_LO_SHIFT		4
#define GFXMMU_LUT492H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut492h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut493l LUT493L Graphic MMU LUT entry 493 low
@{*/


#define GFXMMU_LUT493L_LVB_SHIFT		16
#define GFXMMU_LUT493L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut493l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT493L_FVB_SHIFT		8
#define GFXMMU_LUT493L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut493l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT493L_EN Enable **/
#define GFXMMU_LUT493L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut493h LUT493H Graphic MMU LUT entry 493 high
@{*/


#define GFXMMU_LUT493H_LO_SHIFT		4
#define GFXMMU_LUT493H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut493h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut494l LUT494L Graphic MMU LUT entry 494 low
@{*/


#define GFXMMU_LUT494L_LVB_SHIFT		16
#define GFXMMU_LUT494L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut494l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT494L_FVB_SHIFT		8
#define GFXMMU_LUT494L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut494l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT494L_EN Enable **/
#define GFXMMU_LUT494L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut494h LUT494H Graphic MMU LUT entry 494 high
@{*/


#define GFXMMU_LUT494H_LO_SHIFT		4
#define GFXMMU_LUT494H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut494h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut495l LUT495L Graphic MMU LUT entry 495 low
@{*/


#define GFXMMU_LUT495L_LVB_SHIFT		16
#define GFXMMU_LUT495L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut495l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT495L_FVB_SHIFT		8
#define GFXMMU_LUT495L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut495l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT495L_EN Enable **/
#define GFXMMU_LUT495L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut495h LUT495H Graphic MMU LUT entry 495 high
@{*/


#define GFXMMU_LUT495H_LO_SHIFT		4
#define GFXMMU_LUT495H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut495h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut496l LUT496L Graphic MMU LUT entry 496 low
@{*/


#define GFXMMU_LUT496L_LVB_SHIFT		16
#define GFXMMU_LUT496L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut496l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT496L_FVB_SHIFT		8
#define GFXMMU_LUT496L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut496l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT496L_EN Enable **/
#define GFXMMU_LUT496L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut496h LUT496H Graphic MMU LUT entry 496 high
@{*/


#define GFXMMU_LUT496H_LO_SHIFT		4
#define GFXMMU_LUT496H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut496h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut497l LUT497L Graphic MMU LUT entry 497 low
@{*/


