grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT497L_LVB_SHIFT		16
#define GFXMMU_LUT497L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut497l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT497L_FVB_SHIFT		8
#define GFXMMU_LUT497L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut497l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT497L_EN Enable **/
#define GFXMMU_LUT497L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut497h LUT497H Graphic MMU LUT entry 497 high
@{*/


#define GFXMMU_LUT497H_LO_SHIFT		4
#define GFXMMU_LUT497H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut497h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut498l LUT498L Graphic MMU LUT entry 498 low
@{*/


#define GFXMMU_LUT498L_LVB_SHIFT		16
#define GFXMMU_LUT498L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut498l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT498L_FVB_SHIFT		8
#define GFXMMU_LUT498L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut498l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT498L_EN Enable **/
#define GFXMMU_LUT498L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut498h LUT498H Graphic MMU LUT entry 498 high
@{*/


#define GFXMMU_LUT498H_LO_SHIFT		4
#define GFXMMU_LUT498H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut498h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut499l LUT499L Graphic MMU LUT entry 499 low
@{*/


#define GFXMMU_LUT499L_LVB_SHIFT		16
#define GFXMMU_LUT499L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut499l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT499L_FVB_SHIFT		8
#define GFXMMU_LUT499L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut499l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT499L_EN Enable **/
#define GFXMMU_LUT499L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut499h LUT499H Graphic MMU LUT entry 499 high
@{*/


#define GFXMMU_LUT499H_LO_SHIFT		4
#define GFXMMU_LUT499H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut499h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut500l LUT500L Graphic MMU LUT entry 500 low
@{*/


#define GFXMMU_LUT500L_LVB_SHIFT		16
#define GFXMMU_LUT500L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut500l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT500L_FVB_SHIFT		8
#define GFXMMU_LUT500L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut500l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT500L_EN Enable **/
#define GFXMMU_LUT500L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut500h LUT500H Graphic MMU LUT entry 500 high
@{*/


#define GFXMMU_LUT500H_LO_SHIFT		4
#define GFXMMU_LUT500H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut500h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut501l LUT501L Graphic MMU LUT entry 501 low
@{*/


#define GFXMMU_LUT501L_LVB_SHIFT		16
#define GFXMMU_LUT501L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut501l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT501L_FVB_SHIFT		8
#define GFXMMU_LUT501L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut501l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT501L_EN Enable **/
#define GFXMMU_LUT501L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut501h LUT501H Graphic MMU LUT entry 501 high
@{*/


#define GFXMMU_LUT501H_LO_SHIFT		4
#define GFXMMU_LUT501H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut501h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut502l LUT502L Graphic MMU LUT entry 502 low
@{*/


#define GFXMMU_LUT502L_LVB_SHIFT		16
#define GFXMMU_LUT502L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut502l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT502L_FVB_SHIFT		8
#define GFXMMU_LUT502L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut502l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT502L_EN Enable **/
#define GFXMMU_LUT502L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut502h LUT502H Graphic MMU LUT entry 502 high
@{*/


#define GFXMMU_LUT502H_LO_SHIFT		4
#define GFXMMU_LUT502H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut502h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut503l LUT503L Graphic MMU LUT entry 503 low
@{*/


#define GFXMMU_LUT503L_LVB_SHIFT		16
#define GFXMMU_LUT503L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut503l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT503L_FVB_SHIFT		8
#define GFXMMU_LUT503L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut503l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT503L_EN Enable **/
#define GFXMMU_LUT503L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut503h LUT503H Graphic MMU LUT entry 503 high
@{*/


#define GFXMMU_LUT503H_LO_SHIFT		4
#define GFXMMU_LUT503H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut503h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut504l LUT504L Graphic MMU LUT entry 504 low
@{*/


#define GFXMMU_LUT504L_LVB_SHIFT		16
#define GFXMMU_LUT504L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut504l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT504L_FVB_SHIFT		8
#define GFXMMU_LUT504L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut504l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT504L_EN Enable **/
#define GFXMMU_LUT504L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut504h LUT504H Graphic MMU LUT entry 504 high
@{*/


#define GFXMMU_LUT504H_LO_SHIFT		4
#define GFXMMU_LUT504H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut504h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut505l LUT505L Graphic MMU LUT entry 505 low
@{*/


#define GFXMMU_LUT505L_LVB_SHIFT		16
#define GFXMMU_LUT505L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut505l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT505L_FVB_SHIFT		8
#define GFXMMU_LUT505L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut505l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT505L_EN Enable **/
#define GFXMMU_LUT505L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut505h LUT505H Graphic MMU LUT entry 505 high
@{*/


#define GFXMMU_LUT505H_LO_SHIFT		4
#define GFXMMU_LUT505H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut505h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut506l LUT506L Graphic MMU LUT entry 506 low
@{*/


#define GFXMMU_LUT506L_LVB_SHIFT		16
#define GFXMMU_LUT506L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut506l_lvb LVB Last Valid Block
@{*/
/**@}*/


