grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT506L_FVB_SHIFT		8
#define GFXMMU_LUT506L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut506l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT506L_EN Enable **/
#define GFXMMU_LUT506L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut506h LUT506H Graphic MMU LUT entry 506 high
@{*/


#define GFXMMU_LUT506H_LO_SHIFT		4
#define GFXMMU_LUT506H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut506h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut507l LUT507L Graphic MMU LUT entry 507 low
@{*/


#define GFXMMU_LUT507L_LVB_SHIFT		16
#define GFXMMU_LUT507L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut507l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT507L_FVB_SHIFT		8
#define GFXMMU_LUT507L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut507l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT507L_EN Enable **/
#define GFXMMU_LUT507L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut507h LUT507H Graphic MMU LUT entry 507 high
@{*/


#define GFXMMU_LUT507H_LO_SHIFT		4
#define GFXMMU_LUT507H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut507h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut508l LUT508L Graphic MMU LUT entry 508 low
@{*/


#define GFXMMU_LUT508L_LVB_SHIFT		16
#define GFXMMU_LUT508L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut508l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT508L_FVB_SHIFT		8
#define GFXMMU_LUT508L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut508l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT508L_EN Enable **/
#define GFXMMU_LUT508L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut508h LUT508H Graphic MMU LUT entry 508 high
@{*/


#define GFXMMU_LUT508H_LO_SHIFT		4
#define GFXMMU_LUT508H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut508h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut509l LUT509L Graphic MMU LUT entry 509 low
@{*/


#define GFXMMU_LUT509L_LVB_SHIFT		16
#define GFXMMU_LUT509L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut509l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT509L_FVB_SHIFT		8
#define GFXMMU_LUT509L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut509l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT509L_EN Enable **/
#define GFXMMU_LUT509L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut509h LUT509H Graphic MMU LUT entry 509 high
@{*/


#define GFXMMU_LUT509H_LO_SHIFT		4
#define GFXMMU_LUT509H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut509h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut510l LUT510L Graphic MMU LUT entry 510 low
@{*/


#define GFXMMU_LUT510L_LVB_SHIFT		16
#define GFXMMU_LUT510L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut510l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT510L_FVB_SHIFT		8
#define GFXMMU_LUT510L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut510l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT510L_EN Enable **/
#define GFXMMU_LUT510L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut510h LUT510H Graphic MMU LUT entry 510 high
@{*/


#define GFXMMU_LUT510H_LO_SHIFT		4
#define GFXMMU_LUT510H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut510h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut511l LUT511L Graphic MMU LUT entry 511 low
@{*/


#define GFXMMU_LUT511L_LVB_SHIFT		16
#define GFXMMU_LUT511L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut511l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT511L_FVB_SHIFT		8
#define GFXMMU_LUT511L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut511l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT511L_EN Enable **/
#define GFXMMU_LUT511L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut511h LUT511H Graphic MMU LUT entry 511 high
@{*/


#define GFXMMU_LUT511H_LO_SHIFT		4
#define GFXMMU_LUT511H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut511h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut512l LUT512L Graphic MMU LUT entry 512 low
@{*/


#define GFXMMU_LUT512L_LVB_SHIFT		16
#define GFXMMU_LUT512L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut512l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT512L_FVB_SHIFT		8
#define GFXMMU_LUT512L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut512l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT512L_EN Enable **/
#define GFXMMU_LUT512L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut512h LUT512H Graphic MMU LUT entry 512 high
@{*/


#define GFXMMU_LUT512H_LO_SHIFT		4
#define GFXMMU_LUT512H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut512h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut513l LUT513L Graphic MMU LUT entry 513 low
@{*/


#define GFXMMU_LUT513L_LVB_SHIFT		16
#define GFXMMU_LUT513L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut513l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT513L_FVB_SHIFT		8
#define GFXMMU_LUT513L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut513l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT513L_EN Enable **/
#define GFXMMU_LUT513L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut513h LUT513H Graphic MMU LUT entry 513 high
@{*/


#define GFXMMU_LUT513H_LO_SHIFT		4
#define GFXMMU_LUT513H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut513h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut514l LUT514L Graphic MMU LUT entry 514 low
@{*/


#define GFXMMU_LUT514L_LVB_SHIFT		16
#define GFXMMU_LUT514L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut514l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT514L_FVB_SHIFT		8
#define GFXMMU_LUT514L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut514l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT514L_EN Enable **/
#define GFXMMU_LUT514L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut514h LUT514H Graphic MMU LUT entry 514 high
@{*/


#define GFXMMU_LUT514H_LO_SHIFT		4
#define GFXMMU_LUT514H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut514h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut515l LUT515L Graphic MMU LUT entry 515 low
@{*/


#define GFXMMU_LUT515L_LVB_SHIFT		16
#define GFXMMU_LUT515L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut515l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT515L_FVB_SHIFT		8
#define GFXMMU_LUT515L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut515l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT515L_EN Enable **/
#define GFXMMU_LUT515L_EN		(1 << 0)

/**@}*/

