grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut515h LUT515H Graphic MMU LUT entry 515 high
@{*/


#define GFXMMU_LUT515H_LO_SHIFT		4
#define GFXMMU_LUT515H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut515h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut516l LUT516L Graphic MMU LUT entry 516 low
@{*/


#define GFXMMU_LUT516L_LVB_SHIFT		16
#define GFXMMU_LUT516L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut516l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT516L_FVB_SHIFT		8
#define GFXMMU_LUT516L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut516l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT516L_EN Enable **/
#define GFXMMU_LUT516L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut516h LUT516H Graphic MMU LUT entry 516 high
@{*/


#define GFXMMU_LUT516H_LO_SHIFT		4
#define GFXMMU_LUT516H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut516h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut517l LUT517L Graphic MMU LUT entry 517 low
@{*/


#define GFXMMU_LUT517L_LVB_SHIFT		16
#define GFXMMU_LUT517L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut517l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT517L_FVB_SHIFT		8
#define GFXMMU_LUT517L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut517l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT517L_EN Enable **/
#define GFXMMU_LUT517L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut517h LUT517H Graphic MMU LUT entry 517 high
@{*/


#define GFXMMU_LUT517H_LO_SHIFT		4
#define GFXMMU_LUT517H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut517h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut518l LUT518L Graphic MMU LUT entry 518 low
@{*/


#define GFXMMU_LUT518L_LVB_SHIFT		16
#define GFXMMU_LUT518L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut518l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT518L_FVB_SHIFT		8
#define GFXMMU_LUT518L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut518l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT518L_EN Enable **/
#define GFXMMU_LUT518L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut518h LUT518H Graphic MMU LUT entry 518 high
@{*/


#define GFXMMU_LUT518H_LO_SHIFT		4
#define GFXMMU_LUT518H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut518h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut519l LUT519L Graphic MMU LUT entry 519 low
@{*/


#define GFXMMU_LUT519L_LVB_SHIFT		16
#define GFXMMU_LUT519L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut519l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT519L_FVB_SHIFT		8
#define GFXMMU_LUT519L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut519l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT519L_EN Enable **/
#define GFXMMU_LUT519L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut519h LUT519H Graphic MMU LUT entry 519 high
@{*/


#define GFXMMU_LUT519H_LO_SHIFT		4
#define GFXMMU_LUT519H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut519h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut520l LUT520L Graphic MMU LUT entry 520 low
@{*/


#define GFXMMU_LUT520L_LVB_SHIFT		16
#define GFXMMU_LUT520L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut520l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT520L_FVB_SHIFT		8
#define GFXMMU_LUT520L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut520l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT520L_EN Enable **/
#define GFXMMU_LUT520L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut520h LUT520H Graphic MMU LUT entry 520 high
@{*/


#define GFXMMU_LUT520H_LO_SHIFT		4
#define GFXMMU_LUT520H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut520h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut521l LUT521L Graphic MMU LUT entry 521 low
@{*/


#define GFXMMU_LUT521L_LVB_SHIFT		16
#define GFXMMU_LUT521L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut521l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT521L_FVB_SHIFT		8
#define GFXMMU_LUT521L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut521l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT521L_EN Enable **/
#define GFXMMU_LUT521L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut521h LUT521H Graphic MMU LUT entry 521 high
@{*/


#define GFXMMU_LUT521H_LO_SHIFT		4
#define GFXMMU_LUT521H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut521h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut522l LUT522L Graphic MMU LUT entry 522 low
@{*/


#define GFXMMU_LUT522L_LVB_SHIFT		16
#define GFXMMU_LUT522L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut522l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT522L_FVB_SHIFT		8
#define GFXMMU_LUT522L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut522l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT522L_EN Enable **/
#define GFXMMU_LUT522L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut522h LUT522H Graphic MMU LUT entry 522 high
@{*/


#define GFXMMU_LUT522H_LO_SHIFT		4
#define GFXMMU_LUT522H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut522h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut523l LUT523L Graphic MMU LUT entry 523 low
@{*/


#define GFXMMU_LUT523L_LVB_SHIFT		16
#define GFXMMU_LUT523L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut523l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT523L_FVB_SHIFT		8
#define GFXMMU_LUT523L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut523l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT523L_EN Enable **/
#define GFXMMU_LUT523L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut523h LUT523H Graphic MMU LUT entry 523 high
@{*/


#define GFXMMU_LUT523H_LO_SHIFT		4
#define GFXMMU_LUT523H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut523h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut524l LUT524L Graphic MMU LUT entry 524 low
@{*/


#define GFXMMU_LUT524L_LVB_SHIFT		16
#define GFXMMU_LUT524L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut524l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT524L_FVB_SHIFT		8
#define GFXMMU_LUT524L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut524l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT524L_EN Enable **/
#define GFXMMU_LUT524L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut524h LUT524H Graphic MMU LUT entry 524 high
@{*/


#define GFXMMU_LUT524H_LO_SHIFT		4
#define GFXMMU_LUT524H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut524h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

