grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut525l LUT525L Graphic MMU LUT entry 525 low
@{*/


#define GFXMMU_LUT525L_LVB_SHIFT		16
#define GFXMMU_LUT525L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut525l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT525L_FVB_SHIFT		8
#define GFXMMU_LUT525L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut525l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT525L_EN Enable **/
#define GFXMMU_LUT525L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut525h LUT525H Graphic MMU LUT entry 525 high
@{*/


#define GFXMMU_LUT525H_LO_SHIFT		4
#define GFXMMU_LUT525H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut525h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut526l LUT526L Graphic MMU LUT entry 526 low
@{*/


#define GFXMMU_LUT526L_LVB_SHIFT		16
#define GFXMMU_LUT526L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut526l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT526L_FVB_SHIFT		8
#define GFXMMU_LUT526L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut526l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT526L_EN Enable **/
#define GFXMMU_LUT526L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut526h LUT526H Graphic MMU LUT entry 526 high
@{*/


#define GFXMMU_LUT526H_LO_SHIFT		4
#define GFXMMU_LUT526H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut526h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut527l LUT527L Graphic MMU LUT entry 527 low
@{*/


#define GFXMMU_LUT527L_LVB_SHIFT		16
#define GFXMMU_LUT527L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut527l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT527L_FVB_SHIFT		8
#define GFXMMU_LUT527L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut527l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT527L_EN Enable **/
#define GFXMMU_LUT527L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut527h LUT527H Graphic MMU LUT entry 527 high
@{*/


#define GFXMMU_LUT527H_LO_SHIFT		4
#define GFXMMU_LUT527H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut527h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut528l LUT528L Graphic MMU LUT entry 528 low
@{*/


#define GFXMMU_LUT528L_LVB_SHIFT		16
#define GFXMMU_LUT528L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut528l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT528L_FVB_SHIFT		8
#define GFXMMU_LUT528L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut528l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT528L_EN Enable **/
#define GFXMMU_LUT528L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut528h LUT528H Graphic MMU LUT entry 528 high
@{*/


#define GFXMMU_LUT528H_LO_SHIFT		4
#define GFXMMU_LUT528H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut528h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut529l LUT529L Graphic MMU LUT entry 529 low
@{*/


#define GFXMMU_LUT529L_LVB_SHIFT		16
#define GFXMMU_LUT529L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut529l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT529L_FVB_SHIFT		8
#define GFXMMU_LUT529L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut529l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT529L_EN Enable **/
#define GFXMMU_LUT529L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut529h LUT529H Graphic MMU LUT entry 529 high
@{*/


#define GFXMMU_LUT529H_LO_SHIFT		4
#define GFXMMU_LUT529H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut529h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut530l LUT530L Graphic MMU LUT entry 530 low
@{*/


#define GFXMMU_LUT530L_LVB_SHIFT		16
#define GFXMMU_LUT530L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut530l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT530L_FVB_SHIFT		8
#define GFXMMU_LUT530L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut530l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT530L_EN Enable **/
#define GFXMMU_LUT530L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut530h LUT530H Graphic MMU LUT entry 530 high
@{*/


#define GFXMMU_LUT530H_LO_SHIFT		4
#define GFXMMU_LUT530H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut530h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut531l LUT531L Graphic MMU LUT entry 531 low
@{*/


#define GFXMMU_LUT531L_LVB_SHIFT		16
#define GFXMMU_LUT531L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut531l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT531L_FVB_SHIFT		8
#define GFXMMU_LUT531L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut531l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT531L_EN Enable **/
#define GFXMMU_LUT531L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut531h LUT531H Graphic MMU LUT entry 531 high
@{*/


#define GFXMMU_LUT531H_LO_SHIFT		4
#define GFXMMU_LUT531H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut531h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut532l LUT532L Graphic MMU LUT entry 532 low
@{*/


#define GFXMMU_LUT532L_LVB_SHIFT		16
#define GFXMMU_LUT532L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut532l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT532L_FVB_SHIFT		8
#define GFXMMU_LUT532L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut532l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT532L_EN Enable **/
#define GFXMMU_LUT532L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut532h LUT532H Graphic MMU LUT entry 532 high
@{*/


#define GFXMMU_LUT532H_LO_SHIFT		4
#define GFXMMU_LUT532H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut532h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut533l LUT533L Graphic MMU LUT entry 533 low
@{*/


#define GFXMMU_LUT533L_LVB_SHIFT		16
#define GFXMMU_LUT533L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut533l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT533L_FVB_SHIFT		8
#define GFXMMU_LUT533L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut533l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT533L_EN Enable **/
#define GFXMMU_LUT533L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut533h LUT533H Graphic MMU LUT entry 533 high
@{*/


#define GFXMMU_LUT533H_LO_SHIFT		4
#define GFXMMU_LUT533H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut533h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut534l LUT534L Graphic MMU LUT entry 534 low
@{*/


#define GFXMMU_LUT534L_LVB_SHIFT		16
#define GFXMMU_LUT534L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut534l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT534L_FVB_SHIFT		8
#define GFXMMU_LUT534L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut534l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT534L_EN Enable **/
#define GFXMMU_LUT534L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut534h LUT534H Graphic MMU LUT entry 534 high
@{*/


#define GFXMMU_LUT534H_LO_SHIFT		4
#define GFXMMU_LUT534H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut534h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut535l LUT535L Graphic MMU LUT entry 535 low
@{*/


#define GFXMMU_LUT535L_LVB_SHIFT		16
#define GFXMMU_LUT535L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut535l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT535L_FVB_SHIFT		8
#define GFXMMU_LUT535L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut535l_fvb FVB First Valid Block
@{*/
/**@}*/

