grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT535L_EN Enable **/
#define GFXMMU_LUT535L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut535h LUT535H Graphic MMU LUT entry 535 high
@{*/


#define GFXMMU_LUT535H_LO_SHIFT		4
#define GFXMMU_LUT535H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut535h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut536l LUT536L Graphic MMU LUT entry 536 low
@{*/


#define GFXMMU_LUT536L_LVB_SHIFT		16
#define GFXMMU_LUT536L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut536l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT536L_FVB_SHIFT		8
#define GFXMMU_LUT536L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut536l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT536L_EN Enable **/
#define GFXMMU_LUT536L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut536h LUT536H Graphic MMU LUT entry 536 high
@{*/


#define GFXMMU_LUT536H_LO_SHIFT		4
#define GFXMMU_LUT536H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut536h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut537l LUT537L Graphic MMU LUT entry 537 low
@{*/


#define GFXMMU_LUT537L_LVB_SHIFT		16
#define GFXMMU_LUT537L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut537l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT537L_FVB_SHIFT		8
#define GFXMMU_LUT537L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut537l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT537L_EN Enable **/
#define GFXMMU_LUT537L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut537h LUT537H Graphic MMU LUT entry 537 high
@{*/


#define GFXMMU_LUT537H_LO_SHIFT		4
#define GFXMMU_LUT537H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut537h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut538l LUT538L Graphic MMU LUT entry 538 low
@{*/


#define GFXMMU_LUT538L_LVB_SHIFT		16
#define GFXMMU_LUT538L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut538l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT538L_FVB_SHIFT		8
#define GFXMMU_LUT538L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut538l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT538L_EN Enable **/
#define GFXMMU_LUT538L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut538h LUT538H Graphic MMU LUT entry 538 high
@{*/


#define GFXMMU_LUT538H_LO_SHIFT		4
#define GFXMMU_LUT538H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut538h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut539l LUT539L Graphic MMU LUT entry 539 low
@{*/


#define GFXMMU_LUT539L_LVB_SHIFT		16
#define GFXMMU_LUT539L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut539l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT539L_FVB_SHIFT		8
#define GFXMMU_LUT539L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut539l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT539L_EN Enable **/
#define GFXMMU_LUT539L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut539h LUT539H Graphic MMU LUT entry 539 high
@{*/


#define GFXMMU_LUT539H_LO_SHIFT		4
#define GFXMMU_LUT539H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut539h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut540l LUT540L Graphic MMU LUT entry 540 low
@{*/


#define GFXMMU_LUT540L_LVB_SHIFT		16
#define GFXMMU_LUT540L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut540l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT540L_FVB_SHIFT		8
#define GFXMMU_LUT540L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut540l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT540L_EN Enable **/
#define GFXMMU_LUT540L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut540h LUT540H Graphic MMU LUT entry 540 high
@{*/


#define GFXMMU_LUT540H_LO_SHIFT		4
#define GFXMMU_LUT540H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut540h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut541l LUT541L Graphic MMU LUT entry 541 low
@{*/


#define GFXMMU_LUT541L_LVB_SHIFT		16
#define GFXMMU_LUT541L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut541l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT541L_FVB_SHIFT		8
#define GFXMMU_LUT541L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut541l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT541L_EN Enable **/
#define GFXMMU_LUT541L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut541h LUT541H Graphic MMU LUT entry 541 high
@{*/


#define GFXMMU_LUT541H_LO_SHIFT		4
#define GFXMMU_LUT541H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut541h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut542l LUT542L Graphic MMU LUT entry 542 low
@{*/


#define GFXMMU_LUT542L_LVB_SHIFT		16
#define GFXMMU_LUT542L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut542l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT542L_FVB_SHIFT		8
#define GFXMMU_LUT542L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut542l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT542L_EN Enable **/
#define GFXMMU_LUT542L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut542h LUT542H Graphic MMU LUT entry 542 high
@{*/


#define GFXMMU_LUT542H_LO_SHIFT		4
#define GFXMMU_LUT542H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut542h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut543l LUT543L Graphic MMU LUT entry 543 low
@{*/


#define GFXMMU_LUT543L_LVB_SHIFT		16
#define GFXMMU_LUT543L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut543l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT543L_FVB_SHIFT		8
#define GFXMMU_LUT543L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut543l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT543L_EN Enable **/
#define GFXMMU_LUT543L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut543h LUT543H Graphic MMU LUT entry 543 high
@{*/


#define GFXMMU_LUT543H_LO_SHIFT		4
#define GFXMMU_LUT543H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut543h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut544l LUT544L Graphic MMU LUT entry 544 low
@{*/


#define GFXMMU_LUT544L_LVB_SHIFT		16
#define GFXMMU_LUT544L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut544l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT544L_FVB_SHIFT		8
#define GFXMMU_LUT544L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut544l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT544L_EN Enable **/
#define GFXMMU_LUT544L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut544h LUT544H Graphic MMU LUT entry 544 high
@{*/


#define GFXMMU_LUT544H_LO_SHIFT		4
#define GFXMMU_LUT544H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut544h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut545l LUT545L Graphic MMU LUT entry 545 low
@{*/


