grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT545L_LVB_SHIFT		16
#define GFXMMU_LUT545L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut545l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT545L_FVB_SHIFT		8
#define GFXMMU_LUT545L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut545l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT545L_EN Enable **/
#define GFXMMU_LUT545L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut545h LUT545H Graphic MMU LUT entry 545 high
@{*/


#define GFXMMU_LUT545H_LO_SHIFT		4
#define GFXMMU_LUT545H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut545h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut546l LUT546L Graphic MMU LUT entry 546 low
@{*/


#define GFXMMU_LUT546L_LVB_SHIFT		16
#define GFXMMU_LUT546L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut546l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT546L_FVB_SHIFT		8
#define GFXMMU_LUT546L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut546l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT546L_EN Enable **/
#define GFXMMU_LUT546L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut546h LUT546H Graphic MMU LUT entry 546 high
@{*/


#define GFXMMU_LUT546H_LO_SHIFT		4
#define GFXMMU_LUT546H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut546h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut547l LUT547L Graphic MMU LUT entry 547 low
@{*/


#define GFXMMU_LUT547L_LVB_SHIFT		16
#define GFXMMU_LUT547L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut547l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT547L_FVB_SHIFT		8
#define GFXMMU_LUT547L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut547l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT547L_EN Enable **/
#define GFXMMU_LUT547L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut547h LUT547H Graphic MMU LUT entry 547 high
@{*/


#define GFXMMU_LUT547H_LO_SHIFT		4
#define GFXMMU_LUT547H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut547h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut548l LUT548L Graphic MMU LUT entry 548 low
@{*/


#define GFXMMU_LUT548L_LVB_SHIFT		16
#define GFXMMU_LUT548L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut548l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT548L_FVB_SHIFT		8
#define GFXMMU_LUT548L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut548l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT548L_EN Enable **/
#define GFXMMU_LUT548L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut548h LUT548H Graphic MMU LUT entry 548 high
@{*/


#define GFXMMU_LUT548H_LO_SHIFT		4
#define GFXMMU_LUT548H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut548h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut549l LUT549L Graphic MMU LUT entry 549 low
@{*/


#define GFXMMU_LUT549L_LVB_SHIFT		16
#define GFXMMU_LUT549L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut549l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT549L_FVB_SHIFT		8
#define GFXMMU_LUT549L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut549l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT549L_EN Enable **/
#define GFXMMU_LUT549L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut549h LUT549H Graphic MMU LUT entry 549 high
@{*/


#define GFXMMU_LUT549H_LO_SHIFT		4
#define GFXMMU_LUT549H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut549h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut550l LUT550L Graphic MMU LUT entry 550 low
@{*/


#define GFXMMU_LUT550L_LVB_SHIFT		16
#define GFXMMU_LUT550L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut550l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT550L_FVB_SHIFT		8
#define GFXMMU_LUT550L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut550l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT550L_EN Enable **/
#define GFXMMU_LUT550L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut550h LUT550H Graphic MMU LUT entry 550 high
@{*/


#define GFXMMU_LUT550H_LO_SHIFT		4
#define GFXMMU_LUT550H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut550h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut551l LUT551L Graphic MMU LUT entry 551 low
@{*/


#define GFXMMU_LUT551L_LVB_SHIFT		16
#define GFXMMU_LUT551L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut551l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT551L_FVB_SHIFT		8
#define GFXMMU_LUT551L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut551l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT551L_EN Enable **/
#define GFXMMU_LUT551L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut551h LUT551H Graphic MMU LUT entry 551 high
@{*/


#define GFXMMU_LUT551H_LO_SHIFT		4
#define GFXMMU_LUT551H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut551h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut552l LUT552L Graphic MMU LUT entry 552 low
@{*/


#define GFXMMU_LUT552L_LVB_SHIFT		16
#define GFXMMU_LUT552L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut552l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT552L_FVB_SHIFT		8
#define GFXMMU_LUT552L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut552l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT552L_EN Enable **/
#define GFXMMU_LUT552L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut552h LUT552H Graphic MMU LUT entry 552 high
@{*/


#define GFXMMU_LUT552H_LO_SHIFT		4
#define GFXMMU_LUT552H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut552h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut553l LUT553L Graphic MMU LUT entry 553 low
@{*/


#define GFXMMU_LUT553L_LVB_SHIFT		16
#define GFXMMU_LUT553L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut553l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT553L_FVB_SHIFT		8
#define GFXMMU_LUT553L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut553l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT553L_EN Enable **/
#define GFXMMU_LUT553L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut553h LUT553H Graphic MMU LUT entry 553 high
@{*/


#define GFXMMU_LUT553H_LO_SHIFT		4
#define GFXMMU_LUT553H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut553h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut554l LUT554L Graphic MMU LUT entry 554 low
@{*/


#define GFXMMU_LUT554L_LVB_SHIFT		16
#define GFXMMU_LUT554L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut554l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT554L_FVB_SHIFT		8
#define GFXMMU_LUT554L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut554l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT554L_EN Enable **/
#define GFXMMU_LUT554L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut554h LUT554H Graphic MMU LUT entry 554 high
@{*/


#define GFXMMU_LUT554H_LO_SHIFT		4
#define GFXMMU_LUT554H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut554h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut555l LUT555L Graphic MMU LUT entry 555 low
@{*/


#define GFXMMU_LUT555L_LVB_SHIFT		16
#define GFXMMU_LUT555L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut555l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT555L_FVB_SHIFT		8
#define GFXMMU_LUT555L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut555l_fvb FVB First Valid Block
@{*/
/**@}*/

