grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT555L_EN Enable **/
#define GFXMMU_LUT555L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut555h LUT555H Graphic MMU LUT entry 555 high
@{*/


#define GFXMMU_LUT555H_LO_SHIFT		4
#define GFXMMU_LUT555H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut555h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut556l LUT556L Graphic MMU LUT entry 556 low
@{*/


#define GFXMMU_LUT556L_LVB_SHIFT		16
#define GFXMMU_LUT556L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut556l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT556L_FVB_SHIFT		8
#define GFXMMU_LUT556L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut556l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT556L_EN Enable **/
#define GFXMMU_LUT556L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut556h LUT556H Graphic MMU LUT entry 556 high
@{*/


#define GFXMMU_LUT556H_LO_SHIFT		4
#define GFXMMU_LUT556H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut556h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut557l LUT557L Graphic MMU LUT entry 557 low
@{*/


#define GFXMMU_LUT557L_LVB_SHIFT		16
#define GFXMMU_LUT557L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut557l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT557L_FVB_SHIFT		8
#define GFXMMU_LUT557L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut557l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT557L_EN Enable **/
#define GFXMMU_LUT557L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut557h LUT557H Graphic MMU LUT entry 557 high
@{*/


#define GFXMMU_LUT557H_LO_SHIFT		4
#define GFXMMU_LUT557H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut557h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut558l LUT558L Graphic MMU LUT entry 558 low
@{*/


#define GFXMMU_LUT558L_LVB_SHIFT		16
#define GFXMMU_LUT558L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut558l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT558L_FVB_SHIFT		8
#define GFXMMU_LUT558L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut558l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT558L_EN Enable **/
#define GFXMMU_LUT558L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut558h LUT558H Graphic MMU LUT entry 558 high
@{*/


#define GFXMMU_LUT558H_LO_SHIFT		4
#define GFXMMU_LUT558H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut558h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut559l LUT559L Graphic MMU LUT entry 559 low
@{*/


#define GFXMMU_LUT559L_LVB_SHIFT		16
#define GFXMMU_LUT559L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut559l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT559L_FVB_SHIFT		8
#define GFXMMU_LUT559L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut559l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT559L_EN Enable **/
#define GFXMMU_LUT559L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut559h LUT559H Graphic MMU LUT entry 559 high
@{*/


#define GFXMMU_LUT559H_LO_SHIFT		4
#define GFXMMU_LUT559H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut559h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut560l LUT560L Graphic MMU LUT entry 560 low
@{*/


#define GFXMMU_LUT560L_LVB_SHIFT		16
#define GFXMMU_LUT560L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut560l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT560L_FVB_SHIFT		8
#define GFXMMU_LUT560L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut560l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT560L_EN Enable **/
#define GFXMMU_LUT560L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut560h LUT560H Graphic MMU LUT entry 560 high
@{*/


#define GFXMMU_LUT560H_LO_SHIFT		4
#define GFXMMU_LUT560H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut560h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut561l LUT561L Graphic MMU LUT entry 561 low
@{*/


#define GFXMMU_LUT561L_LVB_SHIFT		16
#define GFXMMU_LUT561L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut561l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT561L_FVB_SHIFT		8
#define GFXMMU_LUT561L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut561l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT561L_EN Enable **/
#define GFXMMU_LUT561L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut561h LUT561H Graphic MMU LUT entry 561 high
@{*/


#define GFXMMU_LUT561H_LO_SHIFT		4
#define GFXMMU_LUT561H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut561h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut562l LUT562L Graphic MMU LUT entry 562 low
@{*/


#define GFXMMU_LUT562L_LVB_SHIFT		16
#define GFXMMU_LUT562L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut562l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT562L_FVB_SHIFT		8
#define GFXMMU_LUT562L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut562l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT562L_EN Enable **/
#define GFXMMU_LUT562L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut562h LUT562H Graphic MMU LUT entry 562 high
@{*/


#define GFXMMU_LUT562H_LO_SHIFT		4
#define GFXMMU_LUT562H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut562h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut563l LUT563L Graphic MMU LUT entry 563 low
@{*/


#define GFXMMU_LUT563L_LVB_SHIFT		16
#define GFXMMU_LUT563L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut563l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT563L_FVB_SHIFT		8
#define GFXMMU_LUT563L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut563l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT563L_EN Enable **/
#define GFXMMU_LUT563L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut563h LUT563H Graphic MMU LUT entry 563 high
@{*/


#define GFXMMU_LUT563H_LO_SHIFT		4
#define GFXMMU_LUT563H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut563h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut564l LUT564L Graphic MMU LUT entry 564 low
@{*/


#define GFXMMU_LUT564L_LVB_SHIFT		16
#define GFXMMU_LUT564L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut564l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT564L_FVB_SHIFT		8
#define GFXMMU_LUT564L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut564l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT564L_EN Enable **/
#define GFXMMU_LUT564L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut564h LUT564H Graphic MMU LUT entry 564 high
@{*/


