grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT564H_LO_SHIFT		4
#define GFXMMU_LUT564H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut564h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut565l LUT565L Graphic MMU LUT entry 565 low
@{*/


#define GFXMMU_LUT565L_LVB_SHIFT		16
#define GFXMMU_LUT565L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut565l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT565L_FVB_SHIFT		8
#define GFXMMU_LUT565L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut565l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT565L_EN Enable **/
#define GFXMMU_LUT565L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut565h LUT565H Graphic MMU LUT entry 565 high
@{*/


#define GFXMMU_LUT565H_LO_SHIFT		4
#define GFXMMU_LUT565H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut565h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut566l LUT566L Graphic MMU LUT entry 566 low
@{*/


#define GFXMMU_LUT566L_LVB_SHIFT		16
#define GFXMMU_LUT566L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut566l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT566L_FVB_SHIFT		8
#define GFXMMU_LUT566L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut566l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT566L_EN Enable **/
#define GFXMMU_LUT566L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut566h LUT566H Graphic MMU LUT entry 566 high
@{*/


#define GFXMMU_LUT566H_LO_SHIFT		4
#define GFXMMU_LUT566H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut566h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut567l LUT567L Graphic MMU LUT entry 567 low
@{*/


#define GFXMMU_LUT567L_LVB_SHIFT		16
#define GFXMMU_LUT567L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut567l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT567L_FVB_SHIFT		8
#define GFXMMU_LUT567L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut567l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT567L_EN Enable **/
#define GFXMMU_LUT567L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut567h LUT567H Graphic MMU LUT entry 567 high
@{*/


#define GFXMMU_LUT567H_LO_SHIFT		4
#define GFXMMU_LUT567H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut567h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut568l LUT568L Graphic MMU LUT entry 568 low
@{*/


#define GFXMMU_LUT568L_LVB_SHIFT		16
#define GFXMMU_LUT568L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut568l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT568L_FVB_SHIFT		8
#define GFXMMU_LUT568L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut568l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT568L_EN Enable **/
#define GFXMMU_LUT568L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut568h LUT568H Graphic MMU LUT entry 568 high
@{*/


#define GFXMMU_LUT568H_LO_SHIFT		4
#define GFXMMU_LUT568H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut568h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut569l LUT569L Graphic MMU LUT entry 569 low
@{*/


#define GFXMMU_LUT569L_LVB_SHIFT		16
#define GFXMMU_LUT569L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut569l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT569L_FVB_SHIFT		8
#define GFXMMU_LUT569L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut569l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT569L_EN Enable **/
#define GFXMMU_LUT569L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut569h LUT569H Graphic MMU LUT entry 569 high
@{*/


#define GFXMMU_LUT569H_LO_SHIFT		4
#define GFXMMU_LUT569H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut569h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut570l LUT570L Graphic MMU LUT entry 570 low
@{*/


#define GFXMMU_LUT570L_LVB_SHIFT		16
#define GFXMMU_LUT570L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut570l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT570L_FVB_SHIFT		8
#define GFXMMU_LUT570L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut570l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT570L_EN Enable **/
#define GFXMMU_LUT570L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut570h LUT570H Graphic MMU LUT entry 570 high
@{*/


#define GFXMMU_LUT570H_LO_SHIFT		4
#define GFXMMU_LUT570H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut570h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut571l LUT571L Graphic MMU LUT entry 571 low
@{*/


#define GFXMMU_LUT571L_LVB_SHIFT		16
#define GFXMMU_LUT571L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut571l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT571L_FVB_SHIFT		8
#define GFXMMU_LUT571L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut571l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT571L_EN Enable **/
#define GFXMMU_LUT571L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut571h LUT571H Graphic MMU LUT entry 571 high
@{*/


#define GFXMMU_LUT571H_LO_SHIFT		4
#define GFXMMU_LUT571H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut571h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut572l LUT572L Graphic MMU LUT entry 572 low
@{*/


#define GFXMMU_LUT572L_LVB_SHIFT		16
#define GFXMMU_LUT572L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut572l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT572L_FVB_SHIFT		8
#define GFXMMU_LUT572L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut572l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT572L_EN Enable **/
#define GFXMMU_LUT572L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut572h LUT572H Graphic MMU LUT entry 572 high
@{*/


#define GFXMMU_LUT572H_LO_SHIFT		4
#define GFXMMU_LUT572H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut572h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut573l LUT573L Graphic MMU LUT entry 573 low
@{*/


#define GFXMMU_LUT573L_LVB_SHIFT		16
#define GFXMMU_LUT573L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut573l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT573L_FVB_SHIFT		8
#define GFXMMU_LUT573L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut573l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT573L_EN Enable **/
#define GFXMMU_LUT573L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut573h LUT573H Graphic MMU LUT entry 573 high
@{*/


#define GFXMMU_LUT573H_LO_SHIFT		4
#define GFXMMU_LUT573H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut573h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut574l LUT574L Graphic MMU LUT entry 574 low
@{*/


#define GFXMMU_LUT574L_LVB_SHIFT		16
#define GFXMMU_LUT574L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut574l_lvb LVB Last Valid Block
@{*/
/**@}*/


