grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT574L_FVB_SHIFT		8
#define GFXMMU_LUT574L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut574l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT574L_EN Enable **/
#define GFXMMU_LUT574L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut574h LUT574H Graphic MMU LUT entry 574 high
@{*/


#define GFXMMU_LUT574H_LO_SHIFT		4
#define GFXMMU_LUT574H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut574h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut575l LUT575L Graphic MMU LUT entry 575 low
@{*/


#define GFXMMU_LUT575L_LVB_SHIFT		16
#define GFXMMU_LUT575L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut575l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT575L_FVB_SHIFT		8
#define GFXMMU_LUT575L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut575l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT575L_EN Enable **/
#define GFXMMU_LUT575L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut575h LUT575H Graphic MMU LUT entry 575 high
@{*/


#define GFXMMU_LUT575H_LO_SHIFT		4
#define GFXMMU_LUT575H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut575h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut576l LUT576L Graphic MMU LUT entry 576 low
@{*/


#define GFXMMU_LUT576L_LVB_SHIFT		16
#define GFXMMU_LUT576L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut576l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT576L_FVB_SHIFT		8
#define GFXMMU_LUT576L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut576l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT576L_EN Enable **/
#define GFXMMU_LUT576L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut576h LUT576H Graphic MMU LUT entry 576 high
@{*/


#define GFXMMU_LUT576H_LO_SHIFT		4
#define GFXMMU_LUT576H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut576h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut577l LUT577L Graphic MMU LUT entry 577 low
@{*/


#define GFXMMU_LUT577L_LVB_SHIFT		16
#define GFXMMU_LUT577L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut577l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT577L_FVB_SHIFT		8
#define GFXMMU_LUT577L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut577l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT577L_EN Enable **/
#define GFXMMU_LUT577L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut577h LUT577H Graphic MMU LUT entry 577 high
@{*/


#define GFXMMU_LUT577H_LO_SHIFT		4
#define GFXMMU_LUT577H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut577h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut578l LUT578L Graphic MMU LUT entry 578 low
@{*/


#define GFXMMU_LUT578L_LVB_SHIFT		16
#define GFXMMU_LUT578L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut578l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT578L_FVB_SHIFT		8
#define GFXMMU_LUT578L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut578l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT578L_EN Enable **/
#define GFXMMU_LUT578L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut578h LUT578H Graphic MMU LUT entry 578 high
@{*/


#define GFXMMU_LUT578H_LO_SHIFT		4
#define GFXMMU_LUT578H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut578h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut579l LUT579L Graphic MMU LUT entry 579 low
@{*/


#define GFXMMU_LUT579L_LVB_SHIFT		16
#define GFXMMU_LUT579L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut579l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT579L_FVB_SHIFT		8
#define GFXMMU_LUT579L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut579l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT579L_EN Enable **/
#define GFXMMU_LUT579L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut579h LUT579H Graphic MMU LUT entry 579 high
@{*/


#define GFXMMU_LUT579H_LO_SHIFT		4
#define GFXMMU_LUT579H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut579h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut580l LUT580L Graphic MMU LUT entry 580 low
@{*/


#define GFXMMU_LUT580L_LVB_SHIFT		16
#define GFXMMU_LUT580L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut580l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT580L_FVB_SHIFT		8
#define GFXMMU_LUT580L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut580l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT580L_EN Enable **/
#define GFXMMU_LUT580L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut580h LUT580H Graphic MMU LUT entry 580 high
@{*/


#define GFXMMU_LUT580H_LO_SHIFT		4
#define GFXMMU_LUT580H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut580h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut581l LUT581L Graphic MMU LUT entry 581 low
@{*/


#define GFXMMU_LUT581L_LVB_SHIFT		16
#define GFXMMU_LUT581L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut581l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT581L_FVB_SHIFT		8
#define GFXMMU_LUT581L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut581l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT581L_EN Enable **/
#define GFXMMU_LUT581L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut581h LUT581H Graphic MMU LUT entry 581 high
@{*/


#define GFXMMU_LUT581H_LO_SHIFT		4
#define GFXMMU_LUT581H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut581h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut582l LUT582L Graphic MMU LUT entry 582 low
@{*/


#define GFXMMU_LUT582L_LVB_SHIFT		16
#define GFXMMU_LUT582L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut582l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT582L_FVB_SHIFT		8
#define GFXMMU_LUT582L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut582l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT582L_EN Enable **/
#define GFXMMU_LUT582L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut582h LUT582H Graphic MMU LUT entry 582 high
@{*/


#define GFXMMU_LUT582H_LO_SHIFT		4
#define GFXMMU_LUT582H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut582h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut583l LUT583L Graphic MMU LUT entry 583 low
@{*/


#define GFXMMU_LUT583L_LVB_SHIFT		16
#define GFXMMU_LUT583L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut583l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT583L_FVB_SHIFT		8
#define GFXMMU_LUT583L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut583l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT583L_EN Enable **/
#define GFXMMU_LUT583L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut583h LUT583H Graphic MMU LUT entry 583 high
@{*/


#define GFXMMU_LUT583H_LO_SHIFT		4
#define GFXMMU_LUT583H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut583h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut584l LUT584L Graphic MMU LUT entry 584 low
@{*/


