grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT584L_LVB_SHIFT		16
#define GFXMMU_LUT584L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut584l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT584L_FVB_SHIFT		8
#define GFXMMU_LUT584L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut584l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT584L_EN Enable **/
#define GFXMMU_LUT584L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut584h LUT584H Graphic MMU LUT entry 584 high
@{*/


#define GFXMMU_LUT584H_LO_SHIFT		4
#define GFXMMU_LUT584H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut584h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut585l LUT585L Graphic MMU LUT entry 585 low
@{*/


#define GFXMMU_LUT585L_LVB_SHIFT		16
#define GFXMMU_LUT585L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut585l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT585L_FVB_SHIFT		8
#define GFXMMU_LUT585L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut585l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT585L_EN Enable **/
#define GFXMMU_LUT585L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut585h LUT585H Graphic MMU LUT entry 585 high
@{*/


#define GFXMMU_LUT585H_LO_SHIFT		4
#define GFXMMU_LUT585H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut585h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut586l LUT586L Graphic MMU LUT entry 586 low
@{*/


#define GFXMMU_LUT586L_LVB_SHIFT		16
#define GFXMMU_LUT586L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut586l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT586L_FVB_SHIFT		8
#define GFXMMU_LUT586L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut586l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT586L_EN Enable **/
#define GFXMMU_LUT586L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut586h LUT586H Graphic MMU LUT entry 586 high
@{*/


#define GFXMMU_LUT586H_LO_SHIFT		4
#define GFXMMU_LUT586H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut586h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut587l LUT587L Graphic MMU LUT entry 587 low
@{*/


#define GFXMMU_LUT587L_LVB_SHIFT		16
#define GFXMMU_LUT587L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut587l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT587L_FVB_SHIFT		8
#define GFXMMU_LUT587L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut587l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT587L_EN Enable **/
#define GFXMMU_LUT587L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut587h LUT587H Graphic MMU LUT entry 587 high
@{*/


#define GFXMMU_LUT587H_LO_SHIFT		4
#define GFXMMU_LUT587H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut587h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut588l LUT588L Graphic MMU LUT entry 588 low
@{*/


#define GFXMMU_LUT588L_LVB_SHIFT		16
#define GFXMMU_LUT588L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut588l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT588L_FVB_SHIFT		8
#define GFXMMU_LUT588L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut588l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT588L_EN Enable **/
#define GFXMMU_LUT588L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut588h LUT588H Graphic MMU LUT entry 588 high
@{*/


#define GFXMMU_LUT588H_LO_SHIFT		4
#define GFXMMU_LUT588H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut588h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut589l LUT589L Graphic MMU LUT entry 589 low
@{*/


#define GFXMMU_LUT589L_LVB_SHIFT		16
#define GFXMMU_LUT589L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut589l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT589L_FVB_SHIFT		8
#define GFXMMU_LUT589L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut589l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT589L_EN Enable **/
#define GFXMMU_LUT589L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut589h LUT589H Graphic MMU LUT entry 589 high
@{*/


#define GFXMMU_LUT589H_LO_SHIFT		4
#define GFXMMU_LUT589H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut589h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut590l LUT590L Graphic MMU LUT entry 590 low
@{*/


#define GFXMMU_LUT590L_LVB_SHIFT		16
#define GFXMMU_LUT590L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut590l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT590L_FVB_SHIFT		8
#define GFXMMU_LUT590L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut590l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT590L_EN Enable **/
#define GFXMMU_LUT590L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut590h LUT590H Graphic MMU LUT entry 590 high
@{*/


#define GFXMMU_LUT590H_LO_SHIFT		4
#define GFXMMU_LUT590H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut590h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut591l LUT591L Graphic MMU LUT entry 591 low
@{*/


#define GFXMMU_LUT591L_LVB_SHIFT		16
#define GFXMMU_LUT591L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut591l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT591L_FVB_SHIFT		8
#define GFXMMU_LUT591L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut591l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT591L_EN Enable **/
#define GFXMMU_LUT591L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut591h LUT591H Graphic MMU LUT entry 591 high
@{*/


#define GFXMMU_LUT591H_LO_SHIFT		4
#define GFXMMU_LUT591H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut591h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut592l LUT592L Graphic MMU LUT entry 592 low
@{*/


#define GFXMMU_LUT592L_LVB_SHIFT		16
#define GFXMMU_LUT592L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut592l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT592L_FVB_SHIFT		8
#define GFXMMU_LUT592L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut592l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT592L_EN Enable **/
#define GFXMMU_LUT592L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut592h LUT592H Graphic MMU LUT entry 592 high
@{*/


#define GFXMMU_LUT592H_LO_SHIFT		4
#define GFXMMU_LUT592H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut592h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut593l LUT593L Graphic MMU LUT entry 593 low
@{*/


#define GFXMMU_LUT593L_LVB_SHIFT		16
#define GFXMMU_LUT593L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut593l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT593L_FVB_SHIFT		8
#define GFXMMU_LUT593L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut593l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT593L_EN Enable **/
#define GFXMMU_LUT593L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut593h LUT593H Graphic MMU LUT entry 593 high
@{*/


#define GFXMMU_LUT593H_LO_SHIFT		4
#define GFXMMU_LUT593H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut593h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

