grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut594l LUT594L Graphic MMU LUT entry 594 low
@{*/


#define GFXMMU_LUT594L_LVB_SHIFT		16
#define GFXMMU_LUT594L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut594l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT594L_FVB_SHIFT		8
#define GFXMMU_LUT594L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut594l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT594L_EN Enable **/
#define GFXMMU_LUT594L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut594h LUT594H Graphic MMU LUT entry 594 high
@{*/


#define GFXMMU_LUT594H_LO_SHIFT		4
#define GFXMMU_LUT594H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut594h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut595l LUT595L Graphic MMU LUT entry 595 low
@{*/


#define GFXMMU_LUT595L_LVB_SHIFT		16
#define GFXMMU_LUT595L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut595l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT595L_FVB_SHIFT		8
#define GFXMMU_LUT595L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut595l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT595L_EN Enable **/
#define GFXMMU_LUT595L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut595h LUT595H Graphic MMU LUT entry 595 high
@{*/


#define GFXMMU_LUT595H_LO_SHIFT		4
#define GFXMMU_LUT595H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut595h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut596l LUT596L Graphic MMU LUT entry 596 low
@{*/


#define GFXMMU_LUT596L_LVB_SHIFT		16
#define GFXMMU_LUT596L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut596l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT596L_FVB_SHIFT		8
#define GFXMMU_LUT596L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut596l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT596L_EN Enable **/
#define GFXMMU_LUT596L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut596h LUT596H Graphic MMU LUT entry 596 high
@{*/


#define GFXMMU_LUT596H_LO_SHIFT		4
#define GFXMMU_LUT596H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut596h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut597l LUT597L Graphic MMU LUT entry 597 low
@{*/


#define GFXMMU_LUT597L_LVB_SHIFT		16
#define GFXMMU_LUT597L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut597l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT597L_FVB_SHIFT		8
#define GFXMMU_LUT597L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut597l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT597L_EN Enable **/
#define GFXMMU_LUT597L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut597h LUT597H Graphic MMU LUT entry 597 high
@{*/


#define GFXMMU_LUT597H_LO_SHIFT		4
#define GFXMMU_LUT597H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut597h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut598l LUT598L Graphic MMU LUT entry 598 low
@{*/


#define GFXMMU_LUT598L_LVB_SHIFT		16
#define GFXMMU_LUT598L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut598l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT598L_FVB_SHIFT		8
#define GFXMMU_LUT598L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut598l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT598L_EN Enable **/
#define GFXMMU_LUT598L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut598h LUT598H Graphic MMU LUT entry 598 high
@{*/


#define GFXMMU_LUT598H_LO_SHIFT		4
#define GFXMMU_LUT598H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut598h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut599l LUT599L Graphic MMU LUT entry 599 low
@{*/


#define GFXMMU_LUT599L_LVB_SHIFT		16
#define GFXMMU_LUT599L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut599l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT599L_FVB_SHIFT		8
#define GFXMMU_LUT599L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut599l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT599L_EN Enable **/
#define GFXMMU_LUT599L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut599h LUT599H Graphic MMU LUT entry 599 high
@{*/


#define GFXMMU_LUT599H_LO_SHIFT		4
#define GFXMMU_LUT599H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut599h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut600l LUT600L Graphic MMU LUT entry 600 low
@{*/


#define GFXMMU_LUT600L_LVB_SHIFT		16
#define GFXMMU_LUT600L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut600l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT600L_FVB_SHIFT		8
#define GFXMMU_LUT600L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut600l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT600L_EN Enable **/
#define GFXMMU_LUT600L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut600h LUT600H Graphic MMU LUT entry 600 high
@{*/


#define GFXMMU_LUT600H_LO_SHIFT		4
#define GFXMMU_LUT600H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut600h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut601l LUT601L Graphic MMU LUT entry 601 low
@{*/


#define GFXMMU_LUT601L_LVB_SHIFT		16
#define GFXMMU_LUT601L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut601l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT601L_FVB_SHIFT		8
#define GFXMMU_LUT601L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut601l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT601L_EN Enable **/
#define GFXMMU_LUT601L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut601h LUT601H Graphic MMU LUT entry 601 high
@{*/


#define GFXMMU_LUT601H_LO_SHIFT		4
#define GFXMMU_LUT601H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut601h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut602l LUT602L Graphic MMU LUT entry 602 low
@{*/


#define GFXMMU_LUT602L_LVB_SHIFT		16
#define GFXMMU_LUT602L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut602l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT602L_FVB_SHIFT		8
#define GFXMMU_LUT602L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut602l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT602L_EN Enable **/
#define GFXMMU_LUT602L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut602h LUT602H Graphic MMU LUT entry 602 high
@{*/


#define GFXMMU_LUT602H_LO_SHIFT		4
#define GFXMMU_LUT602H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut602h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut603l LUT603L Graphic MMU LUT entry 603 low
@{*/


#define GFXMMU_LUT603L_LVB_SHIFT		16
#define GFXMMU_LUT603L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut603l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT603L_FVB_SHIFT		8
#define GFXMMU_LUT603L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut603l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT603L_EN Enable **/
#define GFXMMU_LUT603L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut603h LUT603H Graphic MMU LUT entry 603 high
@{*/


