grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT603H_LO_SHIFT		4
#define GFXMMU_LUT603H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut603h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut604l LUT604L Graphic MMU LUT entry 604 low
@{*/


#define GFXMMU_LUT604L_LVB_SHIFT		16
#define GFXMMU_LUT604L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut604l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT604L_FVB_SHIFT		8
#define GFXMMU_LUT604L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut604l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT604L_EN Enable **/
#define GFXMMU_LUT604L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut604h LUT604H Graphic MMU LUT entry 604 high
@{*/


#define GFXMMU_LUT604H_LO_SHIFT		4
#define GFXMMU_LUT604H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut604h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut605l LUT605L Graphic MMU LUT entry 605 low
@{*/


#define GFXMMU_LUT605L_LVB_SHIFT		16
#define GFXMMU_LUT605L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut605l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT605L_FVB_SHIFT		8
#define GFXMMU_LUT605L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut605l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT605L_EN Enable **/
#define GFXMMU_LUT605L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut605h LUT605H Graphic MMU LUT entry 605 high
@{*/


#define GFXMMU_LUT605H_LO_SHIFT		4
#define GFXMMU_LUT605H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut605h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut606l LUT606L Graphic MMU LUT entry 606 low
@{*/


#define GFXMMU_LUT606L_LVB_SHIFT		16
#define GFXMMU_LUT606L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut606l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT606L_FVB_SHIFT		8
#define GFXMMU_LUT606L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut606l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT606L_EN Enable **/
#define GFXMMU_LUT606L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut606h LUT606H Graphic MMU LUT entry 606 high
@{*/


#define GFXMMU_LUT606H_LO_SHIFT		4
#define GFXMMU_LUT606H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut606h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut607l LUT607L Graphic MMU LUT entry 607 low
@{*/


#define GFXMMU_LUT607L_LVB_SHIFT		16
#define GFXMMU_LUT607L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut607l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT607L_FVB_SHIFT		8
#define GFXMMU_LUT607L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut607l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT607L_EN Enable **/
#define GFXMMU_LUT607L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut607h LUT607H Graphic MMU LUT entry 607 high
@{*/


#define GFXMMU_LUT607H_LO_SHIFT		4
#define GFXMMU_LUT607H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut607h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut608l LUT608L Graphic MMU LUT entry 608 low
@{*/


#define GFXMMU_LUT608L_LVB_SHIFT		16
#define GFXMMU_LUT608L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut608l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT608L_FVB_SHIFT		8
#define GFXMMU_LUT608L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut608l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT608L_EN Enable **/
#define GFXMMU_LUT608L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut608h LUT608H Graphic MMU LUT entry 608 high
@{*/


#define GFXMMU_LUT608H_LO_SHIFT		4
#define GFXMMU_LUT608H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut608h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut609l LUT609L Graphic MMU LUT entry 609 low
@{*/


#define GFXMMU_LUT609L_LVB_SHIFT		16
#define GFXMMU_LUT609L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut609l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT609L_FVB_SHIFT		8
#define GFXMMU_LUT609L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut609l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT609L_EN Enable **/
#define GFXMMU_LUT609L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut609h LUT609H Graphic MMU LUT entry 609 high
@{*/


#define GFXMMU_LUT609H_LO_SHIFT		4
#define GFXMMU_LUT609H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut609h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut610l LUT610L Graphic MMU LUT entry 610 low
@{*/


#define GFXMMU_LUT610L_LVB_SHIFT		16
#define GFXMMU_LUT610L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut610l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT610L_FVB_SHIFT		8
#define GFXMMU_LUT610L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut610l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT610L_EN Enable **/
#define GFXMMU_LUT610L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut610h LUT610H Graphic MMU LUT entry 610 high
@{*/


#define GFXMMU_LUT610H_LO_SHIFT		4
#define GFXMMU_LUT610H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut610h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut611l LUT611L Graphic MMU LUT entry 611 low
@{*/


#define GFXMMU_LUT611L_LVB_SHIFT		16
#define GFXMMU_LUT611L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut611l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT611L_FVB_SHIFT		8
#define GFXMMU_LUT611L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut611l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT611L_EN Enable **/
#define GFXMMU_LUT611L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut611h LUT611H Graphic MMU LUT entry 611 high
@{*/


#define GFXMMU_LUT611H_LO_SHIFT		4
#define GFXMMU_LUT611H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut611h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut612l LUT612L Graphic MMU LUT entry 612 low
@{*/


#define GFXMMU_LUT612L_LVB_SHIFT		16
#define GFXMMU_LUT612L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut612l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT612L_FVB_SHIFT		8
#define GFXMMU_LUT612L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut612l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT612L_EN Enable **/
#define GFXMMU_LUT612L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut612h LUT612H Graphic MMU LUT entry 612 high
@{*/


#define GFXMMU_LUT612H_LO_SHIFT		4
#define GFXMMU_LUT612H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut612h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut613l LUT613L Graphic MMU LUT entry 613 low
@{*/


#define GFXMMU_LUT613L_LVB_SHIFT		16
#define GFXMMU_LUT613L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut613l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT613L_FVB_SHIFT		8
#define GFXMMU_LUT613L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut613l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT613L_EN Enable **/
#define GFXMMU_LUT613L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut613h LUT613H Graphic MMU LUT entry 613 high
@{*/


