grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT613H_LO_SHIFT		4
#define GFXMMU_LUT613H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut613h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut614l LUT614L Graphic MMU LUT entry 614 low
@{*/


#define GFXMMU_LUT614L_LVB_SHIFT		16
#define GFXMMU_LUT614L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut614l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT614L_FVB_SHIFT		8
#define GFXMMU_LUT614L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut614l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT614L_EN Enable **/
#define GFXMMU_LUT614L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut614h LUT614H Graphic MMU LUT entry 614 high
@{*/


#define GFXMMU_LUT614H_LO_SHIFT		4
#define GFXMMU_LUT614H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut614h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut615l LUT615L Graphic MMU LUT entry 615 low
@{*/


#define GFXMMU_LUT615L_LVB_SHIFT		16
#define GFXMMU_LUT615L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut615l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT615L_FVB_SHIFT		8
#define GFXMMU_LUT615L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut615l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT615L_EN Enable **/
#define GFXMMU_LUT615L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut615h LUT615H Graphic MMU LUT entry 615 high
@{*/


#define GFXMMU_LUT615H_LO_SHIFT		4
#define GFXMMU_LUT615H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut615h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut616l LUT616L Graphic MMU LUT entry 616 low
@{*/


#define GFXMMU_LUT616L_LVB_SHIFT		16
#define GFXMMU_LUT616L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut616l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT616L_FVB_SHIFT		8
#define GFXMMU_LUT616L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut616l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT616L_EN Enable **/
#define GFXMMU_LUT616L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut616h LUT616H Graphic MMU LUT entry 616 high
@{*/


#define GFXMMU_LUT616H_LO_SHIFT		4
#define GFXMMU_LUT616H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut616h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut617l LUT617L Graphic MMU LUT entry 617 low
@{*/


#define GFXMMU_LUT617L_LVB_SHIFT		16
#define GFXMMU_LUT617L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut617l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT617L_FVB_SHIFT		8
#define GFXMMU_LUT617L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut617l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT617L_EN Enable **/
#define GFXMMU_LUT617L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut617h LUT617H Graphic MMU LUT entry 617 high
@{*/


#define GFXMMU_LUT617H_LO_SHIFT		4
#define GFXMMU_LUT617H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut617h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut618l LUT618L Graphic MMU LUT entry 618 low
@{*/


#define GFXMMU_LUT618L_LVB_SHIFT		16
#define GFXMMU_LUT618L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut618l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT618L_FVB_SHIFT		8
#define GFXMMU_LUT618L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut618l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT618L_EN Enable **/
#define GFXMMU_LUT618L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut618h LUT618H Graphic MMU LUT entry 618 high
@{*/


#define GFXMMU_LUT618H_LO_SHIFT		4
#define GFXMMU_LUT618H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut618h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut619l LUT619L Graphic MMU LUT entry 619 low
@{*/


#define GFXMMU_LUT619L_LVB_SHIFT		16
#define GFXMMU_LUT619L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut619l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT619L_FVB_SHIFT		8
#define GFXMMU_LUT619L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut619l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT619L_EN Enable **/
#define GFXMMU_LUT619L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut619h LUT619H Graphic MMU LUT entry 619 high
@{*/


#define GFXMMU_LUT619H_LO_SHIFT		4
#define GFXMMU_LUT619H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut619h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut620l LUT620L Graphic MMU LUT entry 620 low
@{*/


#define GFXMMU_LUT620L_LVB_SHIFT		16
#define GFXMMU_LUT620L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut620l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT620L_FVB_SHIFT		8
#define GFXMMU_LUT620L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut620l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT620L_EN Enable **/
#define GFXMMU_LUT620L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut620h LUT620H Graphic MMU LUT entry 620 high
@{*/


#define GFXMMU_LUT620H_LO_SHIFT		4
#define GFXMMU_LUT620H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut620h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut621l LUT621L Graphic MMU LUT entry 621 low
@{*/


#define GFXMMU_LUT621L_LVB_SHIFT		16
#define GFXMMU_LUT621L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut621l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT621L_FVB_SHIFT		8
#define GFXMMU_LUT621L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut621l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT621L_EN Enable **/
#define GFXMMU_LUT621L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut621h LUT621H Graphic MMU LUT entry 621 high
@{*/


#define GFXMMU_LUT621H_LO_SHIFT		4
#define GFXMMU_LUT621H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut621h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut622l LUT622L Graphic MMU LUT entry 622 low
@{*/


#define GFXMMU_LUT622L_LVB_SHIFT		16
#define GFXMMU_LUT622L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut622l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT622L_FVB_SHIFT		8
#define GFXMMU_LUT622L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut622l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT622L_EN Enable **/
#define GFXMMU_LUT622L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut622h LUT622H Graphic MMU LUT entry 622 high
@{*/


#define GFXMMU_LUT622H_LO_SHIFT		4
#define GFXMMU_LUT622H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut622h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut623l LUT623L Graphic MMU LUT entry 623 low
@{*/


#define GFXMMU_LUT623L_LVB_SHIFT		16
#define GFXMMU_LUT623L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut623l_lvb LVB Last Valid Block
@{*/
/**@}*/


