grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT623L_FVB_SHIFT		8
#define GFXMMU_LUT623L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut623l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT623L_EN Enable **/
#define GFXMMU_LUT623L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut623h LUT623H Graphic MMU LUT entry 623 high
@{*/


#define GFXMMU_LUT623H_LO_SHIFT		4
#define GFXMMU_LUT623H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut623h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut624l LUT624L Graphic MMU LUT entry 624 low
@{*/


#define GFXMMU_LUT624L_LVB_SHIFT		16
#define GFXMMU_LUT624L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut624l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT624L_FVB_SHIFT		8
#define GFXMMU_LUT624L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut624l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT624L_EN Enable **/
#define GFXMMU_LUT624L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut624h LUT624H Graphic MMU LUT entry 624 high
@{*/


#define GFXMMU_LUT624H_LO_SHIFT		4
#define GFXMMU_LUT624H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut624h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut625l LUT625L Graphic MMU LUT entry 625 low
@{*/


#define GFXMMU_LUT625L_LVB_SHIFT		16
#define GFXMMU_LUT625L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut625l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT625L_FVB_SHIFT		8
#define GFXMMU_LUT625L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut625l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT625L_EN Enable **/
#define GFXMMU_LUT625L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut625h LUT625H Graphic MMU LUT entry 625 high
@{*/


#define GFXMMU_LUT625H_LO_SHIFT		4
#define GFXMMU_LUT625H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut625h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut626l LUT626L Graphic MMU LUT entry 626 low
@{*/


#define GFXMMU_LUT626L_LVB_SHIFT		16
#define GFXMMU_LUT626L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut626l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT626L_FVB_SHIFT		8
#define GFXMMU_LUT626L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut626l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT626L_EN Enable **/
#define GFXMMU_LUT626L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut626h LUT626H Graphic MMU LUT entry 626 high
@{*/


#define GFXMMU_LUT626H_LO_SHIFT		4
#define GFXMMU_LUT626H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut626h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut627l LUT627L Graphic MMU LUT entry 627 low
@{*/


#define GFXMMU_LUT627L_LVB_SHIFT		16
#define GFXMMU_LUT627L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut627l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT627L_FVB_SHIFT		8
#define GFXMMU_LUT627L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut627l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT627L_EN Enable **/
#define GFXMMU_LUT627L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut627h LUT627H Graphic MMU LUT entry 627 high
@{*/


#define GFXMMU_LUT627H_LO_SHIFT		4
#define GFXMMU_LUT627H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut627h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut628l LUT628L Graphic MMU LUT entry 628 low
@{*/


#define GFXMMU_LUT628L_LVB_SHIFT		16
#define GFXMMU_LUT628L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut628l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT628L_FVB_SHIFT		8
#define GFXMMU_LUT628L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut628l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT628L_EN Enable **/
#define GFXMMU_LUT628L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut628h LUT628H Graphic MMU LUT entry 628 high
@{*/


#define GFXMMU_LUT628H_LO_SHIFT		4
#define GFXMMU_LUT628H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut628h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut629l LUT629L Graphic MMU LUT entry 629 low
@{*/


#define GFXMMU_LUT629L_LVB_SHIFT		16
#define GFXMMU_LUT629L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut629l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT629L_FVB_SHIFT		8
#define GFXMMU_LUT629L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut629l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT629L_EN Enable **/
#define GFXMMU_LUT629L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut629h LUT629H Graphic MMU LUT entry 629 high
@{*/


#define GFXMMU_LUT629H_LO_SHIFT		4
#define GFXMMU_LUT629H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut629h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut630l LUT630L Graphic MMU LUT entry 630 low
@{*/


#define GFXMMU_LUT630L_LVB_SHIFT		16
#define GFXMMU_LUT630L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut630l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT630L_FVB_SHIFT		8
#define GFXMMU_LUT630L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut630l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT630L_EN Enable **/
#define GFXMMU_LUT630L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut630h LUT630H Graphic MMU LUT entry 630 high
@{*/


#define GFXMMU_LUT630H_LO_SHIFT		4
#define GFXMMU_LUT630H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut630h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut631l LUT631L Graphic MMU LUT entry 631 low
@{*/


#define GFXMMU_LUT631L_LVB_SHIFT		16
#define GFXMMU_LUT631L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut631l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT631L_FVB_SHIFT		8
#define GFXMMU_LUT631L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut631l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT631L_EN Enable **/
#define GFXMMU_LUT631L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut631h LUT631H Graphic MMU LUT entry 631 high
@{*/


#define GFXMMU_LUT631H_LO_SHIFT		4
#define GFXMMU_LUT631H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut631h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut632l LUT632L Graphic MMU LUT entry 632 low
@{*/


#define GFXMMU_LUT632L_LVB_SHIFT		16
#define GFXMMU_LUT632L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut632l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT632L_FVB_SHIFT		8
#define GFXMMU_LUT632L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut632l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT632L_EN Enable **/
#define GFXMMU_LUT632L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut632h LUT632H Graphic MMU LUT entry 632 high
@{*/


#define GFXMMU_LUT632H_LO_SHIFT		4
#define GFXMMU_LUT632H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut632h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

