grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut633l LUT633L Graphic MMU LUT entry 633 low
@{*/


#define GFXMMU_LUT633L_LVB_SHIFT		16
#define GFXMMU_LUT633L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut633l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT633L_FVB_SHIFT		8
#define GFXMMU_LUT633L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut633l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT633L_EN Enable **/
#define GFXMMU_LUT633L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut633h LUT633H Graphic MMU LUT entry 633 high
@{*/


#define GFXMMU_LUT633H_LO_SHIFT		4
#define GFXMMU_LUT633H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut633h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut634l LUT634L Graphic MMU LUT entry 634 low
@{*/


#define GFXMMU_LUT634L_LVB_SHIFT		16
#define GFXMMU_LUT634L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut634l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT634L_FVB_SHIFT		8
#define GFXMMU_LUT634L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut634l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT634L_EN Enable **/
#define GFXMMU_LUT634L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut634h LUT634H Graphic MMU LUT entry 634 high
@{*/


#define GFXMMU_LUT634H_LO_SHIFT		4
#define GFXMMU_LUT634H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut634h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut635l LUT635L Graphic MMU LUT entry 635 low
@{*/


#define GFXMMU_LUT635L_LVB_SHIFT		16
#define GFXMMU_LUT635L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut635l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT635L_FVB_SHIFT		8
#define GFXMMU_LUT635L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut635l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT635L_EN Enable **/
#define GFXMMU_LUT635L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut635h LUT635H Graphic MMU LUT entry 635 high
@{*/


#define GFXMMU_LUT635H_LO_SHIFT		4
#define GFXMMU_LUT635H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut635h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut636l LUT636L Graphic MMU LUT entry 636 low
@{*/


#define GFXMMU_LUT636L_LVB_SHIFT		16
#define GFXMMU_LUT636L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut636l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT636L_FVB_SHIFT		8
#define GFXMMU_LUT636L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut636l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT636L_EN Enable **/
#define GFXMMU_LUT636L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut636h LUT636H Graphic MMU LUT entry 636 high
@{*/


#define GFXMMU_LUT636H_LO_SHIFT		4
#define GFXMMU_LUT636H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut636h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut637l LUT637L Graphic MMU LUT entry 637 low
@{*/


#define GFXMMU_LUT637L_LVB_SHIFT		16
#define GFXMMU_LUT637L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut637l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT637L_FVB_SHIFT		8
#define GFXMMU_LUT637L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut637l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT637L_EN Enable **/
#define GFXMMU_LUT637L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut637h LUT637H Graphic MMU LUT entry 637 high
@{*/


#define GFXMMU_LUT637H_LO_SHIFT		4
#define GFXMMU_LUT637H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut637h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut638l LUT638L Graphic MMU LUT entry 638 low
@{*/


#define GFXMMU_LUT638L_LVB_SHIFT		16
#define GFXMMU_LUT638L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut638l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT638L_FVB_SHIFT		8
#define GFXMMU_LUT638L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut638l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT638L_EN Enable **/
#define GFXMMU_LUT638L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut638h LUT638H Graphic MMU LUT entry 638 high
@{*/


#define GFXMMU_LUT638H_LO_SHIFT		4
#define GFXMMU_LUT638H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut638h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut639l LUT639L Graphic MMU LUT entry 639 low
@{*/


#define GFXMMU_LUT639L_LVB_SHIFT		16
#define GFXMMU_LUT639L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut639l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT639L_FVB_SHIFT		8
#define GFXMMU_LUT639L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut639l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT639L_EN Enable **/
#define GFXMMU_LUT639L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut639h LUT639H Graphic MMU LUT entry 639 high
@{*/


#define GFXMMU_LUT639H_LO_SHIFT		4
#define GFXMMU_LUT639H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut639h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut640l LUT640L Graphic MMU LUT entry 640 low
@{*/


#define GFXMMU_LUT640L_LVB_SHIFT		16
#define GFXMMU_LUT640L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut640l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT640L_FVB_SHIFT		8
#define GFXMMU_LUT640L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut640l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT640L_EN Enable **/
#define GFXMMU_LUT640L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut640h LUT640H Graphic MMU LUT entry 640 high
@{*/


#define GFXMMU_LUT640H_LO_SHIFT		4
#define GFXMMU_LUT640H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut640h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut641l LUT641L Graphic MMU LUT entry 641 low
@{*/


#define GFXMMU_LUT641L_LVB_SHIFT		16
#define GFXMMU_LUT641L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut641l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT641L_FVB_SHIFT		8
#define GFXMMU_LUT641L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut641l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT641L_EN Enable **/
#define GFXMMU_LUT641L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut641h LUT641H Graphic MMU LUT entry 641 high
@{*/


#define GFXMMU_LUT641H_LO_SHIFT		4
#define GFXMMU_LUT641H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut641h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut642l LUT642L Graphic MMU LUT entry 642 low
@{*/


#define GFXMMU_LUT642L_LVB_SHIFT		16
#define GFXMMU_LUT642L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut642l_lvb LVB Last Valid Block
@{*/
/**@}*/


