grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT642L_FVB_SHIFT		8
#define GFXMMU_LUT642L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut642l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT642L_EN Enable **/
#define GFXMMU_LUT642L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut642h LUT642H Graphic MMU LUT entry 642 high
@{*/


#define GFXMMU_LUT642H_LO_SHIFT		4
#define GFXMMU_LUT642H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut642h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut643l LUT643L Graphic MMU LUT entry 643 low
@{*/


#define GFXMMU_LUT643L_LVB_SHIFT		16
#define GFXMMU_LUT643L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut643l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT643L_FVB_SHIFT		8
#define GFXMMU_LUT643L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut643l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT643L_EN Enable **/
#define GFXMMU_LUT643L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut643h LUT643H Graphic MMU LUT entry 643 high
@{*/


#define GFXMMU_LUT643H_LO_SHIFT		4
#define GFXMMU_LUT643H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut643h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut644l LUT644L Graphic MMU LUT entry 644 low
@{*/


#define GFXMMU_LUT644L_LVB_SHIFT		16
#define GFXMMU_LUT644L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut644l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT644L_FVB_SHIFT		8
#define GFXMMU_LUT644L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut644l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT644L_EN Enable **/
#define GFXMMU_LUT644L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut644h LUT644H Graphic MMU LUT entry 644 high
@{*/


#define GFXMMU_LUT644H_LO_SHIFT		4
#define GFXMMU_LUT644H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut644h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut645l LUT645L Graphic MMU LUT entry 645 low
@{*/


#define GFXMMU_LUT645L_LVB_SHIFT		16
#define GFXMMU_LUT645L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut645l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT645L_FVB_SHIFT		8
#define GFXMMU_LUT645L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut645l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT645L_EN Enable **/
#define GFXMMU_LUT645L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut645h LUT645H Graphic MMU LUT entry 645 high
@{*/


#define GFXMMU_LUT645H_LO_SHIFT		4
#define GFXMMU_LUT645H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut645h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut646l LUT646L Graphic MMU LUT entry 646 low
@{*/


#define GFXMMU_LUT646L_LVB_SHIFT		16
#define GFXMMU_LUT646L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut646l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT646L_FVB_SHIFT		8
#define GFXMMU_LUT646L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut646l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT646L_EN Enable **/
#define GFXMMU_LUT646L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut646h LUT646H Graphic MMU LUT entry 646 high
@{*/


#define GFXMMU_LUT646H_LO_SHIFT		4
#define GFXMMU_LUT646H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut646h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut647l LUT647L Graphic MMU LUT entry 647 low
@{*/


#define GFXMMU_LUT647L_LVB_SHIFT		16
#define GFXMMU_LUT647L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut647l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT647L_FVB_SHIFT		8
#define GFXMMU_LUT647L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut647l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT647L_EN Enable **/
#define GFXMMU_LUT647L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut647h LUT647H Graphic MMU LUT entry 647 high
@{*/


#define GFXMMU_LUT647H_LO_SHIFT		4
#define GFXMMU_LUT647H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut647h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut648l LUT648L Graphic MMU LUT entry 648 low
@{*/


#define GFXMMU_LUT648L_LVB_SHIFT		16
#define GFXMMU_LUT648L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut648l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT648L_FVB_SHIFT		8
#define GFXMMU_LUT648L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut648l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT648L_EN Enable **/
#define GFXMMU_LUT648L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut648h LUT648H Graphic MMU LUT entry 648 high
@{*/


#define GFXMMU_LUT648H_LO_SHIFT		4
#define GFXMMU_LUT648H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut648h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut649l LUT649L Graphic MMU LUT entry 649 low
@{*/


#define GFXMMU_LUT649L_LVB_SHIFT		16
#define GFXMMU_LUT649L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut649l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT649L_FVB_SHIFT		8
#define GFXMMU_LUT649L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut649l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT649L_EN Enable **/
#define GFXMMU_LUT649L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut649h LUT649H Graphic MMU LUT entry 649 high
@{*/


#define GFXMMU_LUT649H_LO_SHIFT		4
#define GFXMMU_LUT649H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut649h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut650l LUT650L Graphic MMU LUT entry 650 low
@{*/


#define GFXMMU_LUT650L_LVB_SHIFT		16
#define GFXMMU_LUT650L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut650l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT650L_FVB_SHIFT		8
#define GFXMMU_LUT650L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut650l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT650L_EN Enable **/
#define GFXMMU_LUT650L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut650h LUT650H Graphic MMU LUT entry 650 high
@{*/


#define GFXMMU_LUT650H_LO_SHIFT		4
#define GFXMMU_LUT650H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut650h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut651l LUT651L Graphic MMU LUT entry 651 low
@{*/


#define GFXMMU_LUT651L_LVB_SHIFT		16
#define GFXMMU_LUT651L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut651l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT651L_FVB_SHIFT		8
#define GFXMMU_LUT651L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut651l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT651L_EN Enable **/
#define GFXMMU_LUT651L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut651h LUT651H Graphic MMU LUT entry 651 high
@{*/


#define GFXMMU_LUT651H_LO_SHIFT		4
#define GFXMMU_LUT651H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut651h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut652l LUT652L Graphic MMU LUT entry 652 low
@{*/


