grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT652L_LVB_SHIFT		16
#define GFXMMU_LUT652L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut652l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT652L_FVB_SHIFT		8
#define GFXMMU_LUT652L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut652l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT652L_EN Enable **/
#define GFXMMU_LUT652L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut652h LUT652H Graphic MMU LUT entry 652 high
@{*/


#define GFXMMU_LUT652H_LO_SHIFT		4
#define GFXMMU_LUT652H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut652h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut653l LUT653L Graphic MMU LUT entry 653 low
@{*/


#define GFXMMU_LUT653L_LVB_SHIFT		16
#define GFXMMU_LUT653L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut653l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT653L_FVB_SHIFT		8
#define GFXMMU_LUT653L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut653l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT653L_EN Enable **/
#define GFXMMU_LUT653L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut653h LUT653H Graphic MMU LUT entry 653 high
@{*/


#define GFXMMU_LUT653H_LO_SHIFT		4
#define GFXMMU_LUT653H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut653h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut654l LUT654L Graphic MMU LUT entry 654 low
@{*/


#define GFXMMU_LUT654L_LVB_SHIFT		16
#define GFXMMU_LUT654L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut654l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT654L_FVB_SHIFT		8
#define GFXMMU_LUT654L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut654l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT654L_EN Enable **/
#define GFXMMU_LUT654L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut654h LUT654H Graphic MMU LUT entry 654 high
@{*/


#define GFXMMU_LUT654H_LO_SHIFT		4
#define GFXMMU_LUT654H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut654h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut655l LUT655L Graphic MMU LUT entry 655 low
@{*/


#define GFXMMU_LUT655L_LVB_SHIFT		16
#define GFXMMU_LUT655L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut655l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT655L_FVB_SHIFT		8
#define GFXMMU_LUT655L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut655l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT655L_EN Enable **/
#define GFXMMU_LUT655L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut655h LUT655H Graphic MMU LUT entry 655 high
@{*/


#define GFXMMU_LUT655H_LO_SHIFT		4
#define GFXMMU_LUT655H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut655h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut656l LUT656L Graphic MMU LUT entry 656 low
@{*/


#define GFXMMU_LUT656L_LVB_SHIFT		16
#define GFXMMU_LUT656L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut656l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT656L_FVB_SHIFT		8
#define GFXMMU_LUT656L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut656l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT656L_EN Enable **/
#define GFXMMU_LUT656L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut656h LUT656H Graphic MMU LUT entry 656 high
@{*/


#define GFXMMU_LUT656H_LO_SHIFT		4
#define GFXMMU_LUT656H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut656h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut657l LUT657L Graphic MMU LUT entry 657 low
@{*/


#define GFXMMU_LUT657L_LVB_SHIFT		16
#define GFXMMU_LUT657L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut657l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT657L_FVB_SHIFT		8
#define GFXMMU_LUT657L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut657l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT657L_EN Enable **/
#define GFXMMU_LUT657L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut657h LUT657H Graphic MMU LUT entry 657 high
@{*/


#define GFXMMU_LUT657H_LO_SHIFT		4
#define GFXMMU_LUT657H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut657h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut658l LUT658L Graphic MMU LUT entry 658 low
@{*/


#define GFXMMU_LUT658L_LVB_SHIFT		16
#define GFXMMU_LUT658L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut658l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT658L_FVB_SHIFT		8
#define GFXMMU_LUT658L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut658l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT658L_EN Enable **/
#define GFXMMU_LUT658L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut658h LUT658H Graphic MMU LUT entry 658 high
@{*/


#define GFXMMU_LUT658H_LO_SHIFT		4
#define GFXMMU_LUT658H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut658h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut659l LUT659L Graphic MMU LUT entry 659 low
@{*/


#define GFXMMU_LUT659L_LVB_SHIFT		16
#define GFXMMU_LUT659L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut659l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT659L_FVB_SHIFT		8
#define GFXMMU_LUT659L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut659l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT659L_EN Enable **/
#define GFXMMU_LUT659L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut659h LUT659H Graphic MMU LUT entry 659 high
@{*/


#define GFXMMU_LUT659H_LO_SHIFT		4
#define GFXMMU_LUT659H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut659h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut660l LUT660L Graphic MMU LUT entry 660 low
@{*/


#define GFXMMU_LUT660L_LVB_SHIFT		16
#define GFXMMU_LUT660L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut660l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT660L_FVB_SHIFT		8
#define GFXMMU_LUT660L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut660l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT660L_EN Enable **/
#define GFXMMU_LUT660L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut660h LUT660H Graphic MMU LUT entry 660 high
@{*/


#define GFXMMU_LUT660H_LO_SHIFT		4
#define GFXMMU_LUT660H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut660h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut661l LUT661L Graphic MMU LUT entry 661 low
@{*/


#define GFXMMU_LUT661L_LVB_SHIFT		16
#define GFXMMU_LUT661L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut661l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT661L_FVB_SHIFT		8
#define GFXMMU_LUT661L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut661l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT661L_EN Enable **/
#define GFXMMU_LUT661L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut661h LUT661H Graphic MMU LUT entry 661 high
@{*/


#define GFXMMU_LUT661H_LO_SHIFT		4
#define GFXMMU_LUT661H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut661h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut662l LUT662L Graphic MMU LUT entry 662 low
@{*/


