grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT662L_LVB_SHIFT		16
#define GFXMMU_LUT662L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut662l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT662L_FVB_SHIFT		8
#define GFXMMU_LUT662L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut662l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT662L_EN Enable **/
#define GFXMMU_LUT662L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut662h LUT662H Graphic MMU LUT entry 662 high
@{*/


#define GFXMMU_LUT662H_LO_SHIFT		4
#define GFXMMU_LUT662H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut662h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut663l LUT663L Graphic MMU LUT entry 663 low
@{*/


#define GFXMMU_LUT663L_LVB_SHIFT		16
#define GFXMMU_LUT663L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut663l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT663L_FVB_SHIFT		8
#define GFXMMU_LUT663L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut663l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT663L_EN Enable **/
#define GFXMMU_LUT663L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut663h LUT663H Graphic MMU LUT entry 663 high
@{*/


#define GFXMMU_LUT663H_LO_SHIFT		4
#define GFXMMU_LUT663H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut663h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut664l LUT664L Graphic MMU LUT entry 664 low
@{*/


#define GFXMMU_LUT664L_LVB_SHIFT		16
#define GFXMMU_LUT664L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut664l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT664L_FVB_SHIFT		8
#define GFXMMU_LUT664L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut664l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT664L_EN Enable **/
#define GFXMMU_LUT664L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut664h LUT664H Graphic MMU LUT entry 664 high
@{*/


#define GFXMMU_LUT664H_LO_SHIFT		4
#define GFXMMU_LUT664H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut664h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut665l LUT665L Graphic MMU LUT entry 665 low
@{*/


#define GFXMMU_LUT665L_LVB_SHIFT		16
#define GFXMMU_LUT665L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut665l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT665L_FVB_SHIFT		8
#define GFXMMU_LUT665L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut665l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT665L_EN Enable **/
#define GFXMMU_LUT665L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut665h LUT665H Graphic MMU LUT entry 665 high
@{*/


#define GFXMMU_LUT665H_LO_SHIFT		4
#define GFXMMU_LUT665H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut665h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut666l LUT666L Graphic MMU LUT entry 666 low
@{*/


#define GFXMMU_LUT666L_LVB_SHIFT		16
#define GFXMMU_LUT666L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut666l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT666L_FVB_SHIFT		8
#define GFXMMU_LUT666L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut666l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT666L_EN Enable **/
#define GFXMMU_LUT666L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut666h LUT666H Graphic MMU LUT entry 666 high
@{*/


#define GFXMMU_LUT666H_LO_SHIFT		4
#define GFXMMU_LUT666H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut666h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut667l LUT667L Graphic MMU LUT entry 667 low
@{*/


#define GFXMMU_LUT667L_LVB_SHIFT		16
#define GFXMMU_LUT667L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut667l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT667L_FVB_SHIFT		8
#define GFXMMU_LUT667L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut667l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT667L_EN Enable **/
#define GFXMMU_LUT667L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut667h LUT667H Graphic MMU LUT entry 667 high
@{*/


#define GFXMMU_LUT667H_LO_SHIFT		4
#define GFXMMU_LUT667H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut667h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut668l LUT668L Graphic MMU LUT entry 668 low
@{*/


#define GFXMMU_LUT668L_LVB_SHIFT		16
#define GFXMMU_LUT668L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut668l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT668L_FVB_SHIFT		8
#define GFXMMU_LUT668L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut668l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT668L_EN Enable **/
#define GFXMMU_LUT668L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut668h LUT668H Graphic MMU LUT entry 668 high
@{*/


#define GFXMMU_LUT668H_LO_SHIFT		4
#define GFXMMU_LUT668H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut668h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut669l LUT669L Graphic MMU LUT entry 669 low
@{*/


#define GFXMMU_LUT669L_LVB_SHIFT		16
#define GFXMMU_LUT669L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut669l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT669L_FVB_SHIFT		8
#define GFXMMU_LUT669L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut669l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT669L_EN Enable **/
#define GFXMMU_LUT669L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut669h LUT669H Graphic MMU LUT entry 669 high
@{*/


#define GFXMMU_LUT669H_LO_SHIFT		4
#define GFXMMU_LUT669H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut669h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut670l LUT670L Graphic MMU LUT entry 670 low
@{*/


#define GFXMMU_LUT670L_LVB_SHIFT		16
#define GFXMMU_LUT670L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut670l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT670L_FVB_SHIFT		8
#define GFXMMU_LUT670L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut670l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT670L_EN Enable **/
#define GFXMMU_LUT670L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut670h LUT670H Graphic MMU LUT entry 670 high
@{*/


#define GFXMMU_LUT670H_LO_SHIFT		4
#define GFXMMU_LUT670H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut670h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut671l LUT671L Graphic MMU LUT entry 671 low
@{*/


#define GFXMMU_LUT671L_LVB_SHIFT		16
#define GFXMMU_LUT671L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut671l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT671L_FVB_SHIFT		8
#define GFXMMU_LUT671L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut671l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT671L_EN Enable **/
#define GFXMMU_LUT671L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut671h LUT671H Graphic MMU LUT entry 671 high
@{*/


#define GFXMMU_LUT671H_LO_SHIFT		4
#define GFXMMU_LUT671H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut671h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut672l LUT672L Graphic MMU LUT entry 672 low
@{*/


#define GFXMMU_LUT672L_LVB_SHIFT		16
#define GFXMMU_LUT672L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut672l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT672L_FVB_SHIFT		8
#define GFXMMU_LUT672L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut672l_fvb FVB First Valid Block
@{*/
/**@}*/

