grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT672L_EN Enable **/
#define GFXMMU_LUT672L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut672h LUT672H Graphic MMU LUT entry 672 high
@{*/


#define GFXMMU_LUT672H_LO_SHIFT		4
#define GFXMMU_LUT672H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut672h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut673l LUT673L Graphic MMU LUT entry 673 low
@{*/


#define GFXMMU_LUT673L_LVB_SHIFT		16
#define GFXMMU_LUT673L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut673l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT673L_FVB_SHIFT		8
#define GFXMMU_LUT673L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut673l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT673L_EN Enable **/
#define GFXMMU_LUT673L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut673h LUT673H Graphic MMU LUT entry 673 high
@{*/


#define GFXMMU_LUT673H_LO_SHIFT		4
#define GFXMMU_LUT673H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut673h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut674l LUT674L Graphic MMU LUT entry 674 low
@{*/


#define GFXMMU_LUT674L_LVB_SHIFT		16
#define GFXMMU_LUT674L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut674l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT674L_FVB_SHIFT		8
#define GFXMMU_LUT674L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut674l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT674L_EN Enable **/
#define GFXMMU_LUT674L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut674h LUT674H Graphic MMU LUT entry 674 high
@{*/


#define GFXMMU_LUT674H_LO_SHIFT		4
#define GFXMMU_LUT674H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut674h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut675l LUT675L Graphic MMU LUT entry 675 low
@{*/


#define GFXMMU_LUT675L_LVB_SHIFT		16
#define GFXMMU_LUT675L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut675l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT675L_FVB_SHIFT		8
#define GFXMMU_LUT675L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut675l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT675L_EN Enable **/
#define GFXMMU_LUT675L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut675h LUT675H Graphic MMU LUT entry 675 high
@{*/


#define GFXMMU_LUT675H_LO_SHIFT		4
#define GFXMMU_LUT675H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut675h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut676l LUT676L Graphic MMU LUT entry 676 low
@{*/


#define GFXMMU_LUT676L_LVB_SHIFT		16
#define GFXMMU_LUT676L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut676l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT676L_FVB_SHIFT		8
#define GFXMMU_LUT676L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut676l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT676L_EN Enable **/
#define GFXMMU_LUT676L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut676h LUT676H Graphic MMU LUT entry 676 high
@{*/


#define GFXMMU_LUT676H_LO_SHIFT		4
#define GFXMMU_LUT676H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut676h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut677l LUT677L Graphic MMU LUT entry 677 low
@{*/


#define GFXMMU_LUT677L_LVB_SHIFT		16
#define GFXMMU_LUT677L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut677l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT677L_FVB_SHIFT		8
#define GFXMMU_LUT677L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut677l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT677L_EN Enable **/
#define GFXMMU_LUT677L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut677h LUT677H Graphic MMU LUT entry 677 high
@{*/


#define GFXMMU_LUT677H_LO_SHIFT		4
#define GFXMMU_LUT677H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut677h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut678l LUT678L Graphic MMU LUT entry 678 low
@{*/


#define GFXMMU_LUT678L_LVB_SHIFT		16
#define GFXMMU_LUT678L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut678l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT678L_FVB_SHIFT		8
#define GFXMMU_LUT678L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut678l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT678L_EN Enable **/
#define GFXMMU_LUT678L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut678h LUT678H Graphic MMU LUT entry 678 high
@{*/


#define GFXMMU_LUT678H_LO_SHIFT		4
#define GFXMMU_LUT678H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut678h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut679l LUT679L Graphic MMU LUT entry 679 low
@{*/


#define GFXMMU_LUT679L_LVB_SHIFT		16
#define GFXMMU_LUT679L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut679l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT679L_FVB_SHIFT		8
#define GFXMMU_LUT679L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut679l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT679L_EN Enable **/
#define GFXMMU_LUT679L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut679h LUT679H Graphic MMU LUT entry 679 high
@{*/


#define GFXMMU_LUT679H_LO_SHIFT		4
#define GFXMMU_LUT679H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut679h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut680l LUT680L Graphic MMU LUT entry 680 low
@{*/


#define GFXMMU_LUT680L_LVB_SHIFT		16
#define GFXMMU_LUT680L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut680l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT680L_FVB_SHIFT		8
#define GFXMMU_LUT680L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut680l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT680L_EN Enable **/
#define GFXMMU_LUT680L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut680h LUT680H Graphic MMU LUT entry 680 high
@{*/


#define GFXMMU_LUT680H_LO_SHIFT		4
#define GFXMMU_LUT680H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut680h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut681l LUT681L Graphic MMU LUT entry 681 low
@{*/


#define GFXMMU_LUT681L_LVB_SHIFT		16
#define GFXMMU_LUT681L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut681l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT681L_FVB_SHIFT		8
#define GFXMMU_LUT681L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut681l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT681L_EN Enable **/
#define GFXMMU_LUT681L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut681h LUT681H Graphic MMU LUT entry 681 high
@{*/


#define GFXMMU_LUT681H_LO_SHIFT		4
#define GFXMMU_LUT681H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut681h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

