grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut682l LUT682L Graphic MMU LUT entry 682 low
@{*/


#define GFXMMU_LUT682L_LVB_SHIFT		16
#define GFXMMU_LUT682L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut682l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT682L_FVB_SHIFT		8
#define GFXMMU_LUT682L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut682l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT682L_EN Enable **/
#define GFXMMU_LUT682L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut682h LUT682H Graphic MMU LUT entry 682 high
@{*/


#define GFXMMU_LUT682H_LO_SHIFT		4
#define GFXMMU_LUT682H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut682h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut683l LUT683L Graphic MMU LUT entry 683 low
@{*/


#define GFXMMU_LUT683L_LVB_SHIFT		16
#define GFXMMU_LUT683L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut683l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT683L_FVB_SHIFT		8
#define GFXMMU_LUT683L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut683l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT683L_EN Enable **/
#define GFXMMU_LUT683L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut683h LUT683H Graphic MMU LUT entry 683 high
@{*/


#define GFXMMU_LUT683H_LO_SHIFT		4
#define GFXMMU_LUT683H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut683h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut684l LUT684L Graphic MMU LUT entry 684 low
@{*/


#define GFXMMU_LUT684L_LVB_SHIFT		16
#define GFXMMU_LUT684L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut684l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT684L_FVB_SHIFT		8
#define GFXMMU_LUT684L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut684l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT684L_EN Enable **/
#define GFXMMU_LUT684L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut684h LUT684H Graphic MMU LUT entry 684 high
@{*/


#define GFXMMU_LUT684H_LO_SHIFT		4
#define GFXMMU_LUT684H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut684h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut685l LUT685L Graphic MMU LUT entry 685 low
@{*/


#define GFXMMU_LUT685L_LVB_SHIFT		16
#define GFXMMU_LUT685L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut685l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT685L_FVB_SHIFT		8
#define GFXMMU_LUT685L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut685l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT685L_EN Enable **/
#define GFXMMU_LUT685L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut685h LUT685H Graphic MMU LUT entry 685 high
@{*/


#define GFXMMU_LUT685H_LO_SHIFT		4
#define GFXMMU_LUT685H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut685h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut686l LUT686L Graphic MMU LUT entry 686 low
@{*/


#define GFXMMU_LUT686L_LVB_SHIFT		16
#define GFXMMU_LUT686L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut686l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT686L_FVB_SHIFT		8
#define GFXMMU_LUT686L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut686l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT686L_EN Enable **/
#define GFXMMU_LUT686L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut686h LUT686H Graphic MMU LUT entry 686 high
@{*/


#define GFXMMU_LUT686H_LO_SHIFT		4
#define GFXMMU_LUT686H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut686h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut687l LUT687L Graphic MMU LUT entry 687 low
@{*/


#define GFXMMU_LUT687L_LVB_SHIFT		16
#define GFXMMU_LUT687L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut687l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT687L_FVB_SHIFT		8
#define GFXMMU_LUT687L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut687l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT687L_EN Enable **/
#define GFXMMU_LUT687L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut687h LUT687H Graphic MMU LUT entry 687 high
@{*/


#define GFXMMU_LUT687H_LO_SHIFT		4
#define GFXMMU_LUT687H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut687h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut688l LUT688L Graphic MMU LUT entry 688 low
@{*/


#define GFXMMU_LUT688L_LVB_SHIFT		16
#define GFXMMU_LUT688L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut688l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT688L_FVB_SHIFT		8
#define GFXMMU_LUT688L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut688l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT688L_EN Enable **/
#define GFXMMU_LUT688L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut688h LUT688H Graphic MMU LUT entry 688 high
@{*/


#define GFXMMU_LUT688H_LO_SHIFT		4
#define GFXMMU_LUT688H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut688h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut689l LUT689L Graphic MMU LUT entry 689 low
@{*/


#define GFXMMU_LUT689L_LVB_SHIFT		16
#define GFXMMU_LUT689L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut689l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT689L_FVB_SHIFT		8
#define GFXMMU_LUT689L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut689l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT689L_EN Enable **/
#define GFXMMU_LUT689L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut689h LUT689H Graphic MMU LUT entry 689 high
@{*/


#define GFXMMU_LUT689H_LO_SHIFT		4
#define GFXMMU_LUT689H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut689h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut690l LUT690L Graphic MMU LUT entry 690 low
@{*/


#define GFXMMU_LUT690L_LVB_SHIFT		16
#define GFXMMU_LUT690L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut690l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT690L_FVB_SHIFT		8
#define GFXMMU_LUT690L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut690l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT690L_EN Enable **/
#define GFXMMU_LUT690L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut690h LUT690H Graphic MMU LUT entry 690 high
@{*/


#define GFXMMU_LUT690H_LO_SHIFT		4
#define GFXMMU_LUT690H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut690h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut691l LUT691L Graphic MMU LUT entry 691 low
@{*/


#define GFXMMU_LUT691L_LVB_SHIFT		16
#define GFXMMU_LUT691L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut691l_lvb LVB Last Valid Block
@{*/
/**@}*/


