grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT691L_FVB_SHIFT		8
#define GFXMMU_LUT691L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut691l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT691L_EN Enable **/
#define GFXMMU_LUT691L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut691h LUT691H Graphic MMU LUT entry 691 high
@{*/


#define GFXMMU_LUT691H_LO_SHIFT		4
#define GFXMMU_LUT691H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut691h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut692l LUT692L Graphic MMU LUT entry 692 low
@{*/


#define GFXMMU_LUT692L_LVB_SHIFT		16
#define GFXMMU_LUT692L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut692l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT692L_FVB_SHIFT		8
#define GFXMMU_LUT692L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut692l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT692L_EN Enable **/
#define GFXMMU_LUT692L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut692h LUT692H Graphic MMU LUT entry 692 high
@{*/


#define GFXMMU_LUT692H_LO_SHIFT		4
#define GFXMMU_LUT692H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut692h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut693l LUT693L Graphic MMU LUT entry 693 low
@{*/


#define GFXMMU_LUT693L_LVB_SHIFT		16
#define GFXMMU_LUT693L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut693l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT693L_FVB_SHIFT		8
#define GFXMMU_LUT693L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut693l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT693L_EN Enable **/
#define GFXMMU_LUT693L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut693h LUT693H Graphic MMU LUT entry 693 high
@{*/


#define GFXMMU_LUT693H_LO_SHIFT		4
#define GFXMMU_LUT693H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut693h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut694l LUT694L Graphic MMU LUT entry 694 low
@{*/


#define GFXMMU_LUT694L_LVB_SHIFT		16
#define GFXMMU_LUT694L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut694l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT694L_FVB_SHIFT		8
#define GFXMMU_LUT694L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut694l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT694L_EN Enable **/
#define GFXMMU_LUT694L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut694h LUT694H Graphic MMU LUT entry 694 high
@{*/


#define GFXMMU_LUT694H_LO_SHIFT		4
#define GFXMMU_LUT694H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut694h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut695l LUT695L Graphic MMU LUT entry 695 low
@{*/


#define GFXMMU_LUT695L_LVB_SHIFT		16
#define GFXMMU_LUT695L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut695l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT695L_FVB_SHIFT		8
#define GFXMMU_LUT695L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut695l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT695L_EN Enable **/
#define GFXMMU_LUT695L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut695h LUT695H Graphic MMU LUT entry 695 high
@{*/


#define GFXMMU_LUT695H_LO_SHIFT		4
#define GFXMMU_LUT695H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut695h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut696l LUT696L Graphic MMU LUT entry 696 low
@{*/


#define GFXMMU_LUT696L_LVB_SHIFT		16
#define GFXMMU_LUT696L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut696l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT696L_FVB_SHIFT		8
#define GFXMMU_LUT696L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut696l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT696L_EN Enable **/
#define GFXMMU_LUT696L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut696h LUT696H Graphic MMU LUT entry 696 high
@{*/


#define GFXMMU_LUT696H_LO_SHIFT		4
#define GFXMMU_LUT696H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut696h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut697l LUT697L Graphic MMU LUT entry 697 low
@{*/


#define GFXMMU_LUT697L_LVB_SHIFT		16
#define GFXMMU_LUT697L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut697l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT697L_FVB_SHIFT		8
#define GFXMMU_LUT697L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut697l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT697L_EN Enable **/
#define GFXMMU_LUT697L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut697h LUT697H Graphic MMU LUT entry 697 high
@{*/


#define GFXMMU_LUT697H_LO_SHIFT		4
#define GFXMMU_LUT697H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut697h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut698l LUT698L Graphic MMU LUT entry 698 low
@{*/


#define GFXMMU_LUT698L_LVB_SHIFT		16
#define GFXMMU_LUT698L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut698l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT698L_FVB_SHIFT		8
#define GFXMMU_LUT698L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut698l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT698L_EN Enable **/
#define GFXMMU_LUT698L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut698h LUT698H Graphic MMU LUT entry 698 high
@{*/


#define GFXMMU_LUT698H_LO_SHIFT		4
#define GFXMMU_LUT698H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut698h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut699l LUT699L Graphic MMU LUT entry 699 low
@{*/


#define GFXMMU_LUT699L_LVB_SHIFT		16
#define GFXMMU_LUT699L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut699l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT699L_FVB_SHIFT		8
#define GFXMMU_LUT699L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut699l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT699L_EN Enable **/
#define GFXMMU_LUT699L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut699h LUT699H Graphic MMU LUT entry 699 high
@{*/


#define GFXMMU_LUT699H_LO_SHIFT		4
#define GFXMMU_LUT699H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut699h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut700l LUT700L Graphic MMU LUT entry 700 low
@{*/


#define GFXMMU_LUT700L_LVB_SHIFT		16
#define GFXMMU_LUT700L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut700l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT700L_FVB_SHIFT		8
#define GFXMMU_LUT700L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut700l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT700L_EN Enable **/
#define GFXMMU_LUT700L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut700h LUT700H Graphic MMU LUT entry 700 high
@{*/


#define GFXMMU_LUT700H_LO_SHIFT		4
#define GFXMMU_LUT700H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut700h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut701l LUT701L Graphic MMU LUT entry 701 low
@{*/


#define GFXMMU_LUT701L_LVB_SHIFT		16
#define GFXMMU_LUT701L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut701l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT701L_FVB_SHIFT		8
#define GFXMMU_LUT701L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut701l_fvb FVB First Valid Block
@{*/
/**@}*/

