grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT701L_EN Enable **/
#define GFXMMU_LUT701L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut701h LUT701H Graphic MMU LUT entry 701 high
@{*/


#define GFXMMU_LUT701H_LO_SHIFT		4
#define GFXMMU_LUT701H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut701h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut702l LUT702L Graphic MMU LUT entry 702 low
@{*/


#define GFXMMU_LUT702L_LVB_SHIFT		16
#define GFXMMU_LUT702L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut702l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT702L_FVB_SHIFT		8
#define GFXMMU_LUT702L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut702l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT702L_EN Enable **/
#define GFXMMU_LUT702L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut702h LUT702H Graphic MMU LUT entry 702 high
@{*/


#define GFXMMU_LUT702H_LO_SHIFT		4
#define GFXMMU_LUT702H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut702h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut703l LUT703L Graphic MMU LUT entry 703 low
@{*/


#define GFXMMU_LUT703L_LVB_SHIFT		16
#define GFXMMU_LUT703L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut703l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT703L_FVB_SHIFT		8
#define GFXMMU_LUT703L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut703l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT703L_EN Enable **/
#define GFXMMU_LUT703L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut703h LUT703H Graphic MMU LUT entry 703 high
@{*/


#define GFXMMU_LUT703H_LO_SHIFT		4
#define GFXMMU_LUT703H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut703h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut704l LUT704L Graphic MMU LUT entry 704 low
@{*/


#define GFXMMU_LUT704L_LVB_SHIFT		16
#define GFXMMU_LUT704L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut704l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT704L_FVB_SHIFT		8
#define GFXMMU_LUT704L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut704l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT704L_EN Enable **/
#define GFXMMU_LUT704L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut704h LUT704H Graphic MMU LUT entry 704 high
@{*/


#define GFXMMU_LUT704H_LO_SHIFT		4
#define GFXMMU_LUT704H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut704h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut705l LUT705L Graphic MMU LUT entry 705 low
@{*/


#define GFXMMU_LUT705L_LVB_SHIFT		16
#define GFXMMU_LUT705L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut705l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT705L_FVB_SHIFT		8
#define GFXMMU_LUT705L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut705l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT705L_EN Enable **/
#define GFXMMU_LUT705L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut705h LUT705H Graphic MMU LUT entry 705 high
@{*/


#define GFXMMU_LUT705H_LO_SHIFT		4
#define GFXMMU_LUT705H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut705h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut706l LUT706L Graphic MMU LUT entry 706 low
@{*/


#define GFXMMU_LUT706L_LVB_SHIFT		16
#define GFXMMU_LUT706L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut706l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT706L_FVB_SHIFT		8
#define GFXMMU_LUT706L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut706l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT706L_EN Enable **/
#define GFXMMU_LUT706L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut706h LUT706H Graphic MMU LUT entry 706 high
@{*/


#define GFXMMU_LUT706H_LO_SHIFT		4
#define GFXMMU_LUT706H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut706h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut707l LUT707L Graphic MMU LUT entry 707 low
@{*/


#define GFXMMU_LUT707L_LVB_SHIFT		16
#define GFXMMU_LUT707L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut707l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT707L_FVB_SHIFT		8
#define GFXMMU_LUT707L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut707l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT707L_EN Enable **/
#define GFXMMU_LUT707L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut707h LUT707H Graphic MMU LUT entry 707 high
@{*/


#define GFXMMU_LUT707H_LO_SHIFT		4
#define GFXMMU_LUT707H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut707h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut708l LUT708L Graphic MMU LUT entry 708 low
@{*/


#define GFXMMU_LUT708L_LVB_SHIFT		16
#define GFXMMU_LUT708L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut708l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT708L_FVB_SHIFT		8
#define GFXMMU_LUT708L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut708l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT708L_EN Enable **/
#define GFXMMU_LUT708L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut708h LUT708H Graphic MMU LUT entry 708 high
@{*/


#define GFXMMU_LUT708H_LO_SHIFT		4
#define GFXMMU_LUT708H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut708h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut709l LUT709L Graphic MMU LUT entry 709 low
@{*/


#define GFXMMU_LUT709L_LVB_SHIFT		16
#define GFXMMU_LUT709L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut709l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT709L_FVB_SHIFT		8
#define GFXMMU_LUT709L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut709l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT709L_EN Enable **/
#define GFXMMU_LUT709L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut709h LUT709H Graphic MMU LUT entry 709 high
@{*/


#define GFXMMU_LUT709H_LO_SHIFT		4
#define GFXMMU_LUT709H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut709h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut710l LUT710L Graphic MMU LUT entry 710 low
@{*/


#define GFXMMU_LUT710L_LVB_SHIFT		16
#define GFXMMU_LUT710L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut710l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT710L_FVB_SHIFT		8
#define GFXMMU_LUT710L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut710l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT710L_EN Enable **/
#define GFXMMU_LUT710L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut710h LUT710H Graphic MMU LUT entry 710 high
@{*/


#define GFXMMU_LUT710H_LO_SHIFT		4
#define GFXMMU_LUT710H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut710h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

