grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut711l LUT711L Graphic MMU LUT entry 711 low
@{*/


#define GFXMMU_LUT711L_LVB_SHIFT		16
#define GFXMMU_LUT711L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut711l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT711L_FVB_SHIFT		8
#define GFXMMU_LUT711L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut711l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT711L_EN Enable **/
#define GFXMMU_LUT711L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut711h LUT711H Graphic MMU LUT entry 711 high
@{*/


#define GFXMMU_LUT711H_LO_SHIFT		4
#define GFXMMU_LUT711H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut711h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut712l LUT712L Graphic MMU LUT entry 712 low
@{*/


#define GFXMMU_LUT712L_LVB_SHIFT		16
#define GFXMMU_LUT712L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut712l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT712L_FVB_SHIFT		8
#define GFXMMU_LUT712L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut712l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT712L_EN Enable **/
#define GFXMMU_LUT712L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut712h LUT712H Graphic MMU LUT entry 712 high
@{*/


#define GFXMMU_LUT712H_LO_SHIFT		4
#define GFXMMU_LUT712H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut712h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut713l LUT713L Graphic MMU LUT entry 713 low
@{*/


#define GFXMMU_LUT713L_LVB_SHIFT		16
#define GFXMMU_LUT713L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut713l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT713L_FVB_SHIFT		8
#define GFXMMU_LUT713L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut713l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT713L_EN Enable **/
#define GFXMMU_LUT713L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut713h LUT713H Graphic MMU LUT entry 713 high
@{*/


#define GFXMMU_LUT713H_LO_SHIFT		4
#define GFXMMU_LUT713H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut713h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut714l LUT714L Graphic MMU LUT entry 714 low
@{*/


#define GFXMMU_LUT714L_LVB_SHIFT		16
#define GFXMMU_LUT714L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut714l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT714L_FVB_SHIFT		8
#define GFXMMU_LUT714L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut714l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT714L_EN Enable **/
#define GFXMMU_LUT714L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut714h LUT714H Graphic MMU LUT entry 714 high
@{*/


#define GFXMMU_LUT714H_LO_SHIFT		4
#define GFXMMU_LUT714H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut714h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut715l LUT715L Graphic MMU LUT entry 715 low
@{*/


#define GFXMMU_LUT715L_LVB_SHIFT		16
#define GFXMMU_LUT715L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut715l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT715L_FVB_SHIFT		8
#define GFXMMU_LUT715L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut715l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT715L_EN Enable **/
#define GFXMMU_LUT715L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut715h LUT715H Graphic MMU LUT entry 715 high
@{*/


#define GFXMMU_LUT715H_LO_SHIFT		4
#define GFXMMU_LUT715H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut715h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut716l LUT716L Graphic MMU LUT entry 716 low
@{*/


#define GFXMMU_LUT716L_LVB_SHIFT		16
#define GFXMMU_LUT716L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut716l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT716L_FVB_SHIFT		8
#define GFXMMU_LUT716L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut716l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT716L_EN Enable **/
#define GFXMMU_LUT716L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut716h LUT716H Graphic MMU LUT entry 716 high
@{*/


#define GFXMMU_LUT716H_LO_SHIFT		4
#define GFXMMU_LUT716H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut716h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut717l LUT717L Graphic MMU LUT entry 717 low
@{*/


#define GFXMMU_LUT717L_LVB_SHIFT		16
#define GFXMMU_LUT717L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut717l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT717L_FVB_SHIFT		8
#define GFXMMU_LUT717L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut717l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT717L_EN Enable **/
#define GFXMMU_LUT717L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut717h LUT717H Graphic MMU LUT entry 717 high
@{*/


#define GFXMMU_LUT717H_LO_SHIFT		4
#define GFXMMU_LUT717H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut717h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut718l LUT718L Graphic MMU LUT entry 718 low
@{*/


#define GFXMMU_LUT718L_LVB_SHIFT		16
#define GFXMMU_LUT718L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut718l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT718L_FVB_SHIFT		8
#define GFXMMU_LUT718L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut718l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT718L_EN Enable **/
#define GFXMMU_LUT718L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut718h LUT718H Graphic MMU LUT entry 718 high
@{*/


#define GFXMMU_LUT718H_LO_SHIFT		4
#define GFXMMU_LUT718H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut718h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut719l LUT719L Graphic MMU LUT entry 719 low
@{*/


#define GFXMMU_LUT719L_LVB_SHIFT		16
#define GFXMMU_LUT719L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut719l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT719L_FVB_SHIFT		8
#define GFXMMU_LUT719L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut719l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT719L_EN Enable **/
#define GFXMMU_LUT719L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut719h LUT719H Graphic MMU LUT entry 719 high
@{*/


#define GFXMMU_LUT719H_LO_SHIFT		4
#define GFXMMU_LUT719H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut719h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut720l LUT720L Graphic MMU LUT entry 720 low
@{*/


#define GFXMMU_LUT720L_LVB_SHIFT		16
#define GFXMMU_LUT720L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut720l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT720L_FVB_SHIFT		8
#define GFXMMU_LUT720L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut720l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT720L_EN Enable **/
#define GFXMMU_LUT720L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut720h LUT720H Graphic MMU LUT entry 720 high
@{*/


#define GFXMMU_LUT720H_LO_SHIFT		4
#define GFXMMU_LUT720H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut720h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut721l LUT721L Graphic MMU LUT entry 721 low
@{*/


