grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT721L_LVB_SHIFT		16
#define GFXMMU_LUT721L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut721l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT721L_FVB_SHIFT		8
#define GFXMMU_LUT721L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut721l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT721L_EN Enable **/
#define GFXMMU_LUT721L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut721h LUT721H Graphic MMU LUT entry 721 high
@{*/


#define GFXMMU_LUT721H_LO_SHIFT		4
#define GFXMMU_LUT721H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut721h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut722l LUT722L Graphic MMU LUT entry 722 low
@{*/


#define GFXMMU_LUT722L_LVB_SHIFT		16
#define GFXMMU_LUT722L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut722l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT722L_FVB_SHIFT		8
#define GFXMMU_LUT722L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut722l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT722L_EN Enable **/
#define GFXMMU_LUT722L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut722h LUT722H Graphic MMU LUT entry 722 high
@{*/


#define GFXMMU_LUT722H_LO_SHIFT		4
#define GFXMMU_LUT722H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut722h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut723l LUT723L Graphic MMU LUT entry 723 low
@{*/


#define GFXMMU_LUT723L_LVB_SHIFT		16
#define GFXMMU_LUT723L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut723l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT723L_FVB_SHIFT		8
#define GFXMMU_LUT723L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut723l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT723L_EN Enable **/
#define GFXMMU_LUT723L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut723h LUT723H Graphic MMU LUT entry 723 high
@{*/


#define GFXMMU_LUT723H_LO_SHIFT		4
#define GFXMMU_LUT723H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut723h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut724l LUT724L Graphic MMU LUT entry 724 low
@{*/


#define GFXMMU_LUT724L_LVB_SHIFT		16
#define GFXMMU_LUT724L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut724l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT724L_FVB_SHIFT		8
#define GFXMMU_LUT724L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut724l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT724L_EN Enable **/
#define GFXMMU_LUT724L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut724h LUT724H Graphic MMU LUT entry 724 high
@{*/


#define GFXMMU_LUT724H_LO_SHIFT		4
#define GFXMMU_LUT724H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut724h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut725l LUT725L Graphic MMU LUT entry 725 low
@{*/


#define GFXMMU_LUT725L_LVB_SHIFT		16
#define GFXMMU_LUT725L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut725l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT725L_FVB_SHIFT		8
#define GFXMMU_LUT725L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut725l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT725L_EN Enable **/
#define GFXMMU_LUT725L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut725h LUT725H Graphic MMU LUT entry 725 high
@{*/


#define GFXMMU_LUT725H_LO_SHIFT		4
#define GFXMMU_LUT725H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut725h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut726l LUT726L Graphic MMU LUT entry 726 low
@{*/


#define GFXMMU_LUT726L_LVB_SHIFT		16
#define GFXMMU_LUT726L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut726l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT726L_FVB_SHIFT		8
#define GFXMMU_LUT726L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut726l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT726L_EN Enable **/
#define GFXMMU_LUT726L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut726h LUT726H Graphic MMU LUT entry 726 high
@{*/


#define GFXMMU_LUT726H_LO_SHIFT		4
#define GFXMMU_LUT726H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut726h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut727l LUT727L Graphic MMU LUT entry 727 low
@{*/


#define GFXMMU_LUT727L_LVB_SHIFT		16
#define GFXMMU_LUT727L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut727l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT727L_FVB_SHIFT		8
#define GFXMMU_LUT727L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut727l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT727L_EN Enable **/
#define GFXMMU_LUT727L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut727h LUT727H Graphic MMU LUT entry 727 high
@{*/


#define GFXMMU_LUT727H_LO_SHIFT		4
#define GFXMMU_LUT727H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut727h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut728l LUT728L Graphic MMU LUT entry 728 low
@{*/


#define GFXMMU_LUT728L_LVB_SHIFT		16
#define GFXMMU_LUT728L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut728l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT728L_FVB_SHIFT		8
#define GFXMMU_LUT728L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut728l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT728L_EN Enable **/
#define GFXMMU_LUT728L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut728h LUT728H Graphic MMU LUT entry 728 high
@{*/


#define GFXMMU_LUT728H_LO_SHIFT		4
#define GFXMMU_LUT728H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut728h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut729l LUT729L Graphic MMU LUT entry 729 low
@{*/


#define GFXMMU_LUT729L_LVB_SHIFT		16
#define GFXMMU_LUT729L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut729l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT729L_FVB_SHIFT		8
#define GFXMMU_LUT729L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut729l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT729L_EN Enable **/
#define GFXMMU_LUT729L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut729h LUT729H Graphic MMU LUT entry 729 high
@{*/


#define GFXMMU_LUT729H_LO_SHIFT		4
#define GFXMMU_LUT729H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut729h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut730l LUT730L Graphic MMU LUT entry 730 low
@{*/


#define GFXMMU_LUT730L_LVB_SHIFT		16
#define GFXMMU_LUT730L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut730l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT730L_FVB_SHIFT		8
#define GFXMMU_LUT730L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut730l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT730L_EN Enable **/
#define GFXMMU_LUT730L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut730h LUT730H Graphic MMU LUT entry 730 high
@{*/


#define GFXMMU_LUT730H_LO_SHIFT		4
#define GFXMMU_LUT730H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut730h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut731l LUT731L Graphic MMU LUT entry 731 low
@{*/


#define GFXMMU_LUT731L_LVB_SHIFT		16
#define GFXMMU_LUT731L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut731l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT731L_FVB_SHIFT		8
#define GFXMMU_LUT731L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut731l_fvb FVB First Valid Block
@{*/
/**@}*/

