grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT731L_EN Enable **/
#define GFXMMU_LUT731L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut731h LUT731H Graphic MMU LUT entry 731 high
@{*/


#define GFXMMU_LUT731H_LO_SHIFT		4
#define GFXMMU_LUT731H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut731h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut732l LUT732L Graphic MMU LUT entry 732 low
@{*/


#define GFXMMU_LUT732L_LVB_SHIFT		16
#define GFXMMU_LUT732L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut732l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT732L_FVB_SHIFT		8
#define GFXMMU_LUT732L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut732l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT732L_EN Enable **/
#define GFXMMU_LUT732L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut732h LUT732H Graphic MMU LUT entry 732 high
@{*/


#define GFXMMU_LUT732H_LO_SHIFT		4
#define GFXMMU_LUT732H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut732h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut733l LUT733L Graphic MMU LUT entry 733 low
@{*/


#define GFXMMU_LUT733L_LVB_SHIFT		16
#define GFXMMU_LUT733L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut733l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT733L_FVB_SHIFT		8
#define GFXMMU_LUT733L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut733l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT733L_EN Enable **/
#define GFXMMU_LUT733L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut733h LUT733H Graphic MMU LUT entry 733 high
@{*/


#define GFXMMU_LUT733H_LO_SHIFT		4
#define GFXMMU_LUT733H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut733h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut734l LUT734L Graphic MMU LUT entry 734 low
@{*/


#define GFXMMU_LUT734L_LVB_SHIFT		16
#define GFXMMU_LUT734L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut734l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT734L_FVB_SHIFT		8
#define GFXMMU_LUT734L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut734l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT734L_EN Enable **/
#define GFXMMU_LUT734L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut734h LUT734H Graphic MMU LUT entry 734 high
@{*/


#define GFXMMU_LUT734H_LO_SHIFT		4
#define GFXMMU_LUT734H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut734h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut735l LUT735L Graphic MMU LUT entry 735 low
@{*/


#define GFXMMU_LUT735L_LVB_SHIFT		16
#define GFXMMU_LUT735L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut735l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT735L_FVB_SHIFT		8
#define GFXMMU_LUT735L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut735l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT735L_EN Enable **/
#define GFXMMU_LUT735L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut735h LUT735H Graphic MMU LUT entry 735 high
@{*/


#define GFXMMU_LUT735H_LO_SHIFT		4
#define GFXMMU_LUT735H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut735h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut736l LUT736L Graphic MMU LUT entry 736 low
@{*/


#define GFXMMU_LUT736L_LVB_SHIFT		16
#define GFXMMU_LUT736L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut736l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT736L_FVB_SHIFT		8
#define GFXMMU_LUT736L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut736l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT736L_EN Enable **/
#define GFXMMU_LUT736L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut736h LUT736H Graphic MMU LUT entry 736 high
@{*/


#define GFXMMU_LUT736H_LO_SHIFT		4
#define GFXMMU_LUT736H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut736h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut737l LUT737L Graphic MMU LUT entry 737 low
@{*/


#define GFXMMU_LUT737L_LVB_SHIFT		16
#define GFXMMU_LUT737L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut737l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT737L_FVB_SHIFT		8
#define GFXMMU_LUT737L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut737l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT737L_EN Enable **/
#define GFXMMU_LUT737L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut737h LUT737H Graphic MMU LUT entry 737 high
@{*/


#define GFXMMU_LUT737H_LO_SHIFT		4
#define GFXMMU_LUT737H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut737h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut738l LUT738L Graphic MMU LUT entry 738 low
@{*/


#define GFXMMU_LUT738L_LVB_SHIFT		16
#define GFXMMU_LUT738L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut738l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT738L_FVB_SHIFT		8
#define GFXMMU_LUT738L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut738l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT738L_EN Enable **/
#define GFXMMU_LUT738L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut738h LUT738H Graphic MMU LUT entry 738 high
@{*/


#define GFXMMU_LUT738H_LO_SHIFT		4
#define GFXMMU_LUT738H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut738h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut739l LUT739L Graphic MMU LUT entry 739 low
@{*/


#define GFXMMU_LUT739L_LVB_SHIFT		16
#define GFXMMU_LUT739L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut739l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT739L_FVB_SHIFT		8
#define GFXMMU_LUT739L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut739l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT739L_EN Enable **/
#define GFXMMU_LUT739L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut739h LUT739H Graphic MMU LUT entry 739 high
@{*/


#define GFXMMU_LUT739H_LO_SHIFT		4
#define GFXMMU_LUT739H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut739h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut740l LUT740L Graphic MMU LUT entry 740 low
@{*/


#define GFXMMU_LUT740L_LVB_SHIFT		16
#define GFXMMU_LUT740L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut740l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT740L_FVB_SHIFT		8
#define GFXMMU_LUT740L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut740l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT740L_EN Enable **/
#define GFXMMU_LUT740L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut740h LUT740H Graphic MMU LUT entry 740 high
@{*/


#define GFXMMU_LUT740H_LO_SHIFT		4
#define GFXMMU_LUT740H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut740h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut741l LUT741L Graphic MMU LUT entry 741 low
@{*/


