grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT741L_LVB_SHIFT		16
#define GFXMMU_LUT741L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut741l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT741L_FVB_SHIFT		8
#define GFXMMU_LUT741L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut741l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT741L_EN Enable **/
#define GFXMMU_LUT741L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut741h LUT741H Graphic MMU LUT entry 741 high
@{*/


#define GFXMMU_LUT741H_LO_SHIFT		4
#define GFXMMU_LUT741H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut741h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut742l LUT742L Graphic MMU LUT entry 742 low
@{*/


#define GFXMMU_LUT742L_LVB_SHIFT		16
#define GFXMMU_LUT742L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut742l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT742L_FVB_SHIFT		8
#define GFXMMU_LUT742L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut742l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT742L_EN Enable **/
#define GFXMMU_LUT742L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut742h LUT742H Graphic MMU LUT entry 742 high
@{*/


#define GFXMMU_LUT742H_LO_SHIFT		4
#define GFXMMU_LUT742H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut742h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut743l LUT743L Graphic MMU LUT entry 743 low
@{*/


#define GFXMMU_LUT743L_LVB_SHIFT		16
#define GFXMMU_LUT743L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut743l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT743L_FVB_SHIFT		8
#define GFXMMU_LUT743L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut743l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT743L_EN Enable **/
#define GFXMMU_LUT743L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut743h LUT743H Graphic MMU LUT entry 743 high
@{*/


#define GFXMMU_LUT743H_LO_SHIFT		4
#define GFXMMU_LUT743H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut743h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut744l LUT744L Graphic MMU LUT entry 744 low
@{*/


#define GFXMMU_LUT744L_LVB_SHIFT		16
#define GFXMMU_LUT744L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut744l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT744L_FVB_SHIFT		8
#define GFXMMU_LUT744L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut744l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT744L_EN Enable **/
#define GFXMMU_LUT744L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut744h LUT744H Graphic MMU LUT entry 744 high
@{*/


#define GFXMMU_LUT744H_LO_SHIFT		4
#define GFXMMU_LUT744H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut744h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut745l LUT745L Graphic MMU LUT entry 745 low
@{*/


#define GFXMMU_LUT745L_LVB_SHIFT		16
#define GFXMMU_LUT745L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut745l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT745L_FVB_SHIFT		8
#define GFXMMU_LUT745L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut745l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT745L_EN Enable **/
#define GFXMMU_LUT745L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut745h LUT745H Graphic MMU LUT entry 745 high
@{*/


#define GFXMMU_LUT745H_LO_SHIFT		4
#define GFXMMU_LUT745H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut745h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut746l LUT746L Graphic MMU LUT entry 746 low
@{*/


#define GFXMMU_LUT746L_LVB_SHIFT		16
#define GFXMMU_LUT746L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut746l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT746L_FVB_SHIFT		8
#define GFXMMU_LUT746L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut746l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT746L_EN Enable **/
#define GFXMMU_LUT746L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut746h LUT746H Graphic MMU LUT entry 746 high
@{*/


#define GFXMMU_LUT746H_LO_SHIFT		4
#define GFXMMU_LUT746H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut746h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut747l LUT747L Graphic MMU LUT entry 747 low
@{*/


#define GFXMMU_LUT747L_LVB_SHIFT		16
#define GFXMMU_LUT747L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut747l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT747L_FVB_SHIFT		8
#define GFXMMU_LUT747L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut747l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT747L_EN Enable **/
#define GFXMMU_LUT747L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut747h LUT747H Graphic MMU LUT entry 747 high
@{*/


#define GFXMMU_LUT747H_LO_SHIFT		4
#define GFXMMU_LUT747H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut747h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut748l LUT748L Graphic MMU LUT entry 748 low
@{*/


#define GFXMMU_LUT748L_LVB_SHIFT		16
#define GFXMMU_LUT748L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut748l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT748L_FVB_SHIFT		8
#define GFXMMU_LUT748L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut748l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT748L_EN Enable **/
#define GFXMMU_LUT748L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut748h LUT748H Graphic MMU LUT entry 748 high
@{*/


#define GFXMMU_LUT748H_LO_SHIFT		4
#define GFXMMU_LUT748H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut748h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut749l LUT749L Graphic MMU LUT entry 749 low
@{*/


#define GFXMMU_LUT749L_LVB_SHIFT		16
#define GFXMMU_LUT749L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut749l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT749L_FVB_SHIFT		8
#define GFXMMU_LUT749L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut749l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT749L_EN Enable **/
#define GFXMMU_LUT749L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut749h LUT749H Graphic MMU LUT entry 749 high
@{*/


#define GFXMMU_LUT749H_LO_SHIFT		4
#define GFXMMU_LUT749H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut749h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut750l LUT750L Graphic MMU LUT entry 750 low
@{*/


#define GFXMMU_LUT750L_LVB_SHIFT		16
#define GFXMMU_LUT750L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut750l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT750L_FVB_SHIFT		8
#define GFXMMU_LUT750L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut750l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT750L_EN Enable **/
#define GFXMMU_LUT750L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut750h LUT750H Graphic MMU LUT entry 750 high
@{*/


#define GFXMMU_LUT750H_LO_SHIFT		4
#define GFXMMU_LUT750H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut750h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

