grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut751l LUT751L Graphic MMU LUT entry 751 low
@{*/


#define GFXMMU_LUT751L_LVB_SHIFT		16
#define GFXMMU_LUT751L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut751l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT751L_FVB_SHIFT		8
#define GFXMMU_LUT751L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut751l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT751L_EN Enable **/
#define GFXMMU_LUT751L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut751h LUT751H Graphic MMU LUT entry 751 high
@{*/


#define GFXMMU_LUT751H_LO_SHIFT		4
#define GFXMMU_LUT751H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut751h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut752l LUT752L Graphic MMU LUT entry 752 low
@{*/


#define GFXMMU_LUT752L_LVB_SHIFT		16
#define GFXMMU_LUT752L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut752l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT752L_FVB_SHIFT		8
#define GFXMMU_LUT752L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut752l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT752L_EN Enable **/
#define GFXMMU_LUT752L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut752h LUT752H Graphic MMU LUT entry 752 high
@{*/


#define GFXMMU_LUT752H_LO_SHIFT		4
#define GFXMMU_LUT752H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut752h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut753l LUT753L Graphic MMU LUT entry 753 low
@{*/


#define GFXMMU_LUT753L_LVB_SHIFT		16
#define GFXMMU_LUT753L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut753l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT753L_FVB_SHIFT		8
#define GFXMMU_LUT753L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut753l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT753L_EN Enable **/
#define GFXMMU_LUT753L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut753h LUT753H Graphic MMU LUT entry 753 high
@{*/


#define GFXMMU_LUT753H_LO_SHIFT		4
#define GFXMMU_LUT753H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut753h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut754l LUT754L Graphic MMU LUT entry 754 low
@{*/


#define GFXMMU_LUT754L_LVB_SHIFT		16
#define GFXMMU_LUT754L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut754l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT754L_FVB_SHIFT		8
#define GFXMMU_LUT754L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut754l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT754L_EN Enable **/
#define GFXMMU_LUT754L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut754h LUT754H Graphic MMU LUT entry 754 high
@{*/


#define GFXMMU_LUT754H_LO_SHIFT		4
#define GFXMMU_LUT754H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut754h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut755l LUT755L Graphic MMU LUT entry 755 low
@{*/


#define GFXMMU_LUT755L_LVB_SHIFT		16
#define GFXMMU_LUT755L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut755l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT755L_FVB_SHIFT		8
#define GFXMMU_LUT755L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut755l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT755L_EN Enable **/
#define GFXMMU_LUT755L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut755h LUT755H Graphic MMU LUT entry 755 high
@{*/


#define GFXMMU_LUT755H_LO_SHIFT		4
#define GFXMMU_LUT755H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut755h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut756l LUT756L Graphic MMU LUT entry 756 low
@{*/


#define GFXMMU_LUT756L_LVB_SHIFT		16
#define GFXMMU_LUT756L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut756l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT756L_FVB_SHIFT		8
#define GFXMMU_LUT756L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut756l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT756L_EN Enable **/
#define GFXMMU_LUT756L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut756h LUT756H Graphic MMU LUT entry 756 high
@{*/


#define GFXMMU_LUT756H_LO_SHIFT		4
#define GFXMMU_LUT756H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut756h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut757l LUT757L Graphic MMU LUT entry 757 low
@{*/


#define GFXMMU_LUT757L_LVB_SHIFT		16
#define GFXMMU_LUT757L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut757l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT757L_FVB_SHIFT		8
#define GFXMMU_LUT757L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut757l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT757L_EN Enable **/
#define GFXMMU_LUT757L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut757h LUT757H Graphic MMU LUT entry 757 high
@{*/


#define GFXMMU_LUT757H_LO_SHIFT		4
#define GFXMMU_LUT757H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut757h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut758l LUT758L Graphic MMU LUT entry 758 low
@{*/


#define GFXMMU_LUT758L_LVB_SHIFT		16
#define GFXMMU_LUT758L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut758l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT758L_FVB_SHIFT		8
#define GFXMMU_LUT758L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut758l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT758L_EN Enable **/
#define GFXMMU_LUT758L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut758h LUT758H Graphic MMU LUT entry 758 high
@{*/


#define GFXMMU_LUT758H_LO_SHIFT		4
#define GFXMMU_LUT758H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut758h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut759l LUT759L Graphic MMU LUT entry 759 low
@{*/


#define GFXMMU_LUT759L_LVB_SHIFT		16
#define GFXMMU_LUT759L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut759l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT759L_FVB_SHIFT		8
#define GFXMMU_LUT759L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut759l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT759L_EN Enable **/
#define GFXMMU_LUT759L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut759h LUT759H Graphic MMU LUT entry 759 high
@{*/


#define GFXMMU_LUT759H_LO_SHIFT		4
#define GFXMMU_LUT759H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut759h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut760l LUT760L Graphic MMU LUT entry 760 low
@{*/


#define GFXMMU_LUT760L_LVB_SHIFT		16
#define GFXMMU_LUT760L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut760l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT760L_FVB_SHIFT		8
#define GFXMMU_LUT760L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut760l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT760L_EN Enable **/
#define GFXMMU_LUT760L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut760h LUT760H Graphic MMU LUT entry 760 high
@{*/


