grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT760H_LO_SHIFT		4
#define GFXMMU_LUT760H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut760h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut761l LUT761L Graphic MMU LUT entry 761 low
@{*/


#define GFXMMU_LUT761L_LVB_SHIFT		16
#define GFXMMU_LUT761L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut761l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT761L_FVB_SHIFT		8
#define GFXMMU_LUT761L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut761l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT761L_EN Enable **/
#define GFXMMU_LUT761L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut761h LUT761H Graphic MMU LUT entry 761 high
@{*/


#define GFXMMU_LUT761H_LO_SHIFT		4
#define GFXMMU_LUT761H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut761h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut762l LUT762L Graphic MMU LUT entry 762 low
@{*/


#define GFXMMU_LUT762L_LVB_SHIFT		16
#define GFXMMU_LUT762L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut762l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT762L_FVB_SHIFT		8
#define GFXMMU_LUT762L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut762l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT762L_EN Enable **/
#define GFXMMU_LUT762L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut762h LUT762H Graphic MMU LUT entry 762 high
@{*/


#define GFXMMU_LUT762H_LO_SHIFT		4
#define GFXMMU_LUT762H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut762h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut763l LUT763L Graphic MMU LUT entry 763 low
@{*/


#define GFXMMU_LUT763L_LVB_SHIFT		16
#define GFXMMU_LUT763L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut763l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT763L_FVB_SHIFT		8
#define GFXMMU_LUT763L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut763l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT763L_EN Enable **/
#define GFXMMU_LUT763L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut763h LUT763H Graphic MMU LUT entry 763 high
@{*/


#define GFXMMU_LUT763H_LO_SHIFT		4
#define GFXMMU_LUT763H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut763h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut764l LUT764L Graphic MMU LUT entry 764 low
@{*/


#define GFXMMU_LUT764L_LVB_SHIFT		16
#define GFXMMU_LUT764L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut764l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT764L_FVB_SHIFT		8
#define GFXMMU_LUT764L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut764l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT764L_EN Enable **/
#define GFXMMU_LUT764L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut764h LUT764H Graphic MMU LUT entry 764 high
@{*/


#define GFXMMU_LUT764H_LO_SHIFT		4
#define GFXMMU_LUT764H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut764h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut765l LUT765L Graphic MMU LUT entry 765 low
@{*/


#define GFXMMU_LUT765L_LVB_SHIFT		16
#define GFXMMU_LUT765L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut765l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT765L_FVB_SHIFT		8
#define GFXMMU_LUT765L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut765l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT765L_EN Enable **/
#define GFXMMU_LUT765L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut765h LUT765H Graphic MMU LUT entry 765 high
@{*/


#define GFXMMU_LUT765H_LO_SHIFT		4
#define GFXMMU_LUT765H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut765h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut766l LUT766L Graphic MMU LUT entry 766 low
@{*/


#define GFXMMU_LUT766L_LVB_SHIFT		16
#define GFXMMU_LUT766L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut766l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT766L_FVB_SHIFT		8
#define GFXMMU_LUT766L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut766l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT766L_EN Enable **/
#define GFXMMU_LUT766L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut766h LUT766H Graphic MMU LUT entry 766 high
@{*/


#define GFXMMU_LUT766H_LO_SHIFT		4
#define GFXMMU_LUT766H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut766h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut767l LUT767L Graphic MMU LUT entry 767 low
@{*/


#define GFXMMU_LUT767L_LVB_SHIFT		16
#define GFXMMU_LUT767L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut767l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT767L_FVB_SHIFT		8
#define GFXMMU_LUT767L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut767l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT767L_EN Enable **/
#define GFXMMU_LUT767L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut767h LUT767H Graphic MMU LUT entry 767 high
@{*/


#define GFXMMU_LUT767H_LO_SHIFT		4
#define GFXMMU_LUT767H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut767h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut768l LUT768L Graphic MMU LUT entry 768 low
@{*/


#define GFXMMU_LUT768L_LVB_SHIFT		16
#define GFXMMU_LUT768L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut768l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT768L_FVB_SHIFT		8
#define GFXMMU_LUT768L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut768l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT768L_EN Enable **/
#define GFXMMU_LUT768L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut768h LUT768H Graphic MMU LUT entry 768 high
@{*/


#define GFXMMU_LUT768H_LO_SHIFT		4
#define GFXMMU_LUT768H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut768h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut769l LUT769L Graphic MMU LUT entry 769 low
@{*/


#define GFXMMU_LUT769L_LVB_SHIFT		16
#define GFXMMU_LUT769L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut769l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT769L_FVB_SHIFT		8
#define GFXMMU_LUT769L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut769l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT769L_EN Enable **/
#define GFXMMU_LUT769L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut769h LUT769H Graphic MMU LUT entry 769 high
@{*/


#define GFXMMU_LUT769H_LO_SHIFT		4
#define GFXMMU_LUT769H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut769h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut770l LUT770L Graphic MMU LUT entry 770 low
@{*/


#define GFXMMU_LUT770L_LVB_SHIFT		16
#define GFXMMU_LUT770L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut770l_lvb LVB Last Valid Block
@{*/
/**@}*/


