grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT770L_FVB_SHIFT		8
#define GFXMMU_LUT770L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut770l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT770L_EN Enable **/
#define GFXMMU_LUT770L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut770h LUT770H Graphic MMU LUT entry 770 high
@{*/


#define GFXMMU_LUT770H_LO_SHIFT		4
#define GFXMMU_LUT770H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut770h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut771l LUT771L Graphic MMU LUT entry 771 low
@{*/


#define GFXMMU_LUT771L_LVB_SHIFT		16
#define GFXMMU_LUT771L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut771l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT771L_FVB_SHIFT		8
#define GFXMMU_LUT771L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut771l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT771L_EN Enable **/
#define GFXMMU_LUT771L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut771h LUT771H Graphic MMU LUT entry 771 high
@{*/


#define GFXMMU_LUT771H_LO_SHIFT		4
#define GFXMMU_LUT771H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut771h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut772l LUT772L Graphic MMU LUT entry 772 low
@{*/


#define GFXMMU_LUT772L_LVB_SHIFT		16
#define GFXMMU_LUT772L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut772l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT772L_FVB_SHIFT		8
#define GFXMMU_LUT772L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut772l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT772L_EN Enable **/
#define GFXMMU_LUT772L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut772h LUT772H Graphic MMU LUT entry 772 high
@{*/


#define GFXMMU_LUT772H_LO_SHIFT		4
#define GFXMMU_LUT772H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut772h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut773l LUT773L Graphic MMU LUT entry 773 low
@{*/


#define GFXMMU_LUT773L_LVB_SHIFT		16
#define GFXMMU_LUT773L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut773l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT773L_FVB_SHIFT		8
#define GFXMMU_LUT773L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut773l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT773L_EN Enable **/
#define GFXMMU_LUT773L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut773h LUT773H Graphic MMU LUT entry 773 high
@{*/


#define GFXMMU_LUT773H_LO_SHIFT		4
#define GFXMMU_LUT773H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut773h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut774l LUT774L Graphic MMU LUT entry 774 low
@{*/


#define GFXMMU_LUT774L_LVB_SHIFT		16
#define GFXMMU_LUT774L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut774l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT774L_FVB_SHIFT		8
#define GFXMMU_LUT774L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut774l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT774L_EN Enable **/
#define GFXMMU_LUT774L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut774h LUT774H Graphic MMU LUT entry 774 high
@{*/


#define GFXMMU_LUT774H_LO_SHIFT		4
#define GFXMMU_LUT774H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut774h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut775l LUT775L Graphic MMU LUT entry 775 low
@{*/


#define GFXMMU_LUT775L_LVB_SHIFT		16
#define GFXMMU_LUT775L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut775l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT775L_FVB_SHIFT		8
#define GFXMMU_LUT775L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut775l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT775L_EN Enable **/
#define GFXMMU_LUT775L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut775h LUT775H Graphic MMU LUT entry 775 high
@{*/


#define GFXMMU_LUT775H_LO_SHIFT		4
#define GFXMMU_LUT775H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut775h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut776l LUT776L Graphic MMU LUT entry 776 low
@{*/


#define GFXMMU_LUT776L_LVB_SHIFT		16
#define GFXMMU_LUT776L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut776l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT776L_FVB_SHIFT		8
#define GFXMMU_LUT776L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut776l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT776L_EN Enable **/
#define GFXMMU_LUT776L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut776h LUT776H Graphic MMU LUT entry 776 high
@{*/


#define GFXMMU_LUT776H_LO_SHIFT		4
#define GFXMMU_LUT776H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut776h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut777l LUT777L Graphic MMU LUT entry 777 low
@{*/


#define GFXMMU_LUT777L_LVB_SHIFT		16
#define GFXMMU_LUT777L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut777l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT777L_FVB_SHIFT		8
#define GFXMMU_LUT777L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut777l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT777L_EN Enable **/
#define GFXMMU_LUT777L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut777h LUT777H Graphic MMU LUT entry 777 high
@{*/


#define GFXMMU_LUT777H_LO_SHIFT		4
#define GFXMMU_LUT777H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut777h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut778l LUT778L Graphic MMU LUT entry 778 low
@{*/


#define GFXMMU_LUT778L_LVB_SHIFT		16
#define GFXMMU_LUT778L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut778l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT778L_FVB_SHIFT		8
#define GFXMMU_LUT778L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut778l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT778L_EN Enable **/
#define GFXMMU_LUT778L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut778h LUT778H Graphic MMU LUT entry 778 high
@{*/


#define GFXMMU_LUT778H_LO_SHIFT		4
#define GFXMMU_LUT778H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut778h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut779l LUT779L Graphic MMU LUT entry 779 low
@{*/


#define GFXMMU_LUT779L_LVB_SHIFT		16
#define GFXMMU_LUT779L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut779l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT779L_FVB_SHIFT		8
#define GFXMMU_LUT779L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut779l_fvb FVB First Valid Block
@{*/
/**@}*/

