grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT779L_EN Enable **/
#define GFXMMU_LUT779L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut779h LUT779H Graphic MMU LUT entry 779 high
@{*/


#define GFXMMU_LUT779H_LO_SHIFT		4
#define GFXMMU_LUT779H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut779h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut780l LUT780L Graphic MMU LUT entry 780 low
@{*/


#define GFXMMU_LUT780L_LVB_SHIFT		16
#define GFXMMU_LUT780L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut780l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT780L_FVB_SHIFT		8
#define GFXMMU_LUT780L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut780l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT780L_EN Enable **/
#define GFXMMU_LUT780L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut780h LUT780H Graphic MMU LUT entry 780 high
@{*/


#define GFXMMU_LUT780H_LO_SHIFT		4
#define GFXMMU_LUT780H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut780h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut781l LUT781L Graphic MMU LUT entry 781 low
@{*/


#define GFXMMU_LUT781L_LVB_SHIFT		16
#define GFXMMU_LUT781L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut781l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT781L_FVB_SHIFT		8
#define GFXMMU_LUT781L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut781l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT781L_EN Enable **/
#define GFXMMU_LUT781L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut781h LUT781H Graphic MMU LUT entry 781 high
@{*/


#define GFXMMU_LUT781H_LO_SHIFT		4
#define GFXMMU_LUT781H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut781h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut782l LUT782L Graphic MMU LUT entry 782 low
@{*/


#define GFXMMU_LUT782L_LVB_SHIFT		16
#define GFXMMU_LUT782L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut782l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT782L_FVB_SHIFT		8
#define GFXMMU_LUT782L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut782l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT782L_EN Enable **/
#define GFXMMU_LUT782L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut782h LUT782H Graphic MMU LUT entry 782 high
@{*/


#define GFXMMU_LUT782H_LO_SHIFT		4
#define GFXMMU_LUT782H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut782h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut783l LUT783L Graphic MMU LUT entry 783 low
@{*/


#define GFXMMU_LUT783L_LVB_SHIFT		16
#define GFXMMU_LUT783L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut783l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT783L_FVB_SHIFT		8
#define GFXMMU_LUT783L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut783l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT783L_EN Enable **/
#define GFXMMU_LUT783L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut783h LUT783H Graphic MMU LUT entry 783 high
@{*/


#define GFXMMU_LUT783H_LO_SHIFT		4
#define GFXMMU_LUT783H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut783h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut784l LUT784L Graphic MMU LUT entry 784 low
@{*/


#define GFXMMU_LUT784L_LVB_SHIFT		16
#define GFXMMU_LUT784L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut784l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT784L_FVB_SHIFT		8
#define GFXMMU_LUT784L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut784l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT784L_EN Enable **/
#define GFXMMU_LUT784L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut784h LUT784H Graphic MMU LUT entry 784 high
@{*/


#define GFXMMU_LUT784H_LO_SHIFT		4
#define GFXMMU_LUT784H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut784h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut785l LUT785L Graphic MMU LUT entry 785 low
@{*/


#define GFXMMU_LUT785L_LVB_SHIFT		16
#define GFXMMU_LUT785L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut785l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT785L_FVB_SHIFT		8
#define GFXMMU_LUT785L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut785l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT785L_EN Enable **/
#define GFXMMU_LUT785L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut785h LUT785H Graphic MMU LUT entry 785 high
@{*/


#define GFXMMU_LUT785H_LO_SHIFT		4
#define GFXMMU_LUT785H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut785h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut786l LUT786L Graphic MMU LUT entry 786 low
@{*/


#define GFXMMU_LUT786L_LVB_SHIFT		16
#define GFXMMU_LUT786L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut786l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT786L_FVB_SHIFT		8
#define GFXMMU_LUT786L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut786l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT786L_EN Enable **/
#define GFXMMU_LUT786L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut786h LUT786H Graphic MMU LUT entry 786 high
@{*/


#define GFXMMU_LUT786H_LO_SHIFT		4
#define GFXMMU_LUT786H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut786h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut787l LUT787L Graphic MMU LUT entry 787 low
@{*/


#define GFXMMU_LUT787L_LVB_SHIFT		16
#define GFXMMU_LUT787L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut787l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT787L_FVB_SHIFT		8
#define GFXMMU_LUT787L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut787l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT787L_EN Enable **/
#define GFXMMU_LUT787L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut787h LUT787H Graphic MMU LUT entry 787 high
@{*/


#define GFXMMU_LUT787H_LO_SHIFT		4
#define GFXMMU_LUT787H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut787h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut788l LUT788L Graphic MMU LUT entry 788 low
@{*/


#define GFXMMU_LUT788L_LVB_SHIFT		16
#define GFXMMU_LUT788L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut788l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT788L_FVB_SHIFT		8
#define GFXMMU_LUT788L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut788l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT788L_EN Enable **/
#define GFXMMU_LUT788L_EN		(1 << 0)

/**@}*/

