grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut788h LUT788H Graphic MMU LUT entry 788 high
@{*/


#define GFXMMU_LUT788H_LO_SHIFT		4
#define GFXMMU_LUT788H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut788h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut789l LUT789L Graphic MMU LUT entry 789 low
@{*/


#define GFXMMU_LUT789L_LVB_SHIFT		16
#define GFXMMU_LUT789L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut789l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT789L_FVB_SHIFT		8
#define GFXMMU_LUT789L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut789l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT789L_EN Enable **/
#define GFXMMU_LUT789L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut789h LUT789H Graphic MMU LUT entry 789 high
@{*/


#define GFXMMU_LUT789H_LO_SHIFT		4
#define GFXMMU_LUT789H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut789h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut790l LUT790L Graphic MMU LUT entry 790 low
@{*/


#define GFXMMU_LUT790L_LVB_SHIFT		16
#define GFXMMU_LUT790L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut790l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT790L_FVB_SHIFT		8
#define GFXMMU_LUT790L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut790l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT790L_EN Enable **/
#define GFXMMU_LUT790L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut790h LUT790H Graphic MMU LUT entry 790 high
@{*/


#define GFXMMU_LUT790H_LO_SHIFT		4
#define GFXMMU_LUT790H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut790h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut791l LUT791L Graphic MMU LUT entry 791 low
@{*/


#define GFXMMU_LUT791L_LVB_SHIFT		16
#define GFXMMU_LUT791L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut791l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT791L_FVB_SHIFT		8
#define GFXMMU_LUT791L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut791l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT791L_EN Enable **/
#define GFXMMU_LUT791L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut791h LUT791H Graphic MMU LUT entry 791 high
@{*/


#define GFXMMU_LUT791H_LO_SHIFT		4
#define GFXMMU_LUT791H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut791h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut792l LUT792L Graphic MMU LUT entry 792 low
@{*/


#define GFXMMU_LUT792L_LVB_SHIFT		16
#define GFXMMU_LUT792L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut792l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT792L_FVB_SHIFT		8
#define GFXMMU_LUT792L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut792l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT792L_EN Enable **/
#define GFXMMU_LUT792L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut792h LUT792H Graphic MMU LUT entry 792 high
@{*/


#define GFXMMU_LUT792H_LO_SHIFT		4
#define GFXMMU_LUT792H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut792h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut793l LUT793L Graphic MMU LUT entry 793 low
@{*/


#define GFXMMU_LUT793L_LVB_SHIFT		16
#define GFXMMU_LUT793L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut793l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT793L_FVB_SHIFT		8
#define GFXMMU_LUT793L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut793l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT793L_EN Enable **/
#define GFXMMU_LUT793L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut793h LUT793H Graphic MMU LUT entry 793 high
@{*/


#define GFXMMU_LUT793H_LO_SHIFT		4
#define GFXMMU_LUT793H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut793h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut794l LUT794L Graphic MMU LUT entry 794 low
@{*/


#define GFXMMU_LUT794L_LVB_SHIFT		16
#define GFXMMU_LUT794L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut794l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT794L_FVB_SHIFT		8
#define GFXMMU_LUT794L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut794l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT794L_EN Enable **/
#define GFXMMU_LUT794L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut794h LUT794H Graphic MMU LUT entry 794 high
@{*/


#define GFXMMU_LUT794H_LO_SHIFT		4
#define GFXMMU_LUT794H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut794h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut795l LUT795L Graphic MMU LUT entry 795 low
@{*/


#define GFXMMU_LUT795L_LVB_SHIFT		16
#define GFXMMU_LUT795L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut795l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT795L_FVB_SHIFT		8
#define GFXMMU_LUT795L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut795l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT795L_EN Enable **/
#define GFXMMU_LUT795L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut795h LUT795H Graphic MMU LUT entry 795 high
@{*/


#define GFXMMU_LUT795H_LO_SHIFT		4
#define GFXMMU_LUT795H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut795h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut796l LUT796L Graphic MMU LUT entry 796 low
@{*/


#define GFXMMU_LUT796L_LVB_SHIFT		16
#define GFXMMU_LUT796L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut796l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT796L_FVB_SHIFT		8
#define GFXMMU_LUT796L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut796l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT796L_EN Enable **/
#define GFXMMU_LUT796L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut796h LUT796H Graphic MMU LUT entry 796 high
@{*/


#define GFXMMU_LUT796H_LO_SHIFT		4
#define GFXMMU_LUT796H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut796h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut797l LUT797L Graphic MMU LUT entry 797 low
@{*/


#define GFXMMU_LUT797L_LVB_SHIFT		16
#define GFXMMU_LUT797L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut797l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT797L_FVB_SHIFT		8
#define GFXMMU_LUT797L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut797l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT797L_EN Enable **/
#define GFXMMU_LUT797L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut797h LUT797H Graphic MMU LUT entry 797 high
@{*/


#define GFXMMU_LUT797H_LO_SHIFT		4
#define GFXMMU_LUT797H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut797h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut798l LUT798L Graphic MMU LUT entry 798 low
@{*/


