grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT798L_LVB_SHIFT		16
#define GFXMMU_LUT798L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut798l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT798L_FVB_SHIFT		8
#define GFXMMU_LUT798L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut798l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT798L_EN Enable **/
#define GFXMMU_LUT798L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut798h LUT798H Graphic MMU LUT entry 798 high
@{*/


#define GFXMMU_LUT798H_LO_SHIFT		4
#define GFXMMU_LUT798H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut798h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut799l LUT799L Graphic MMU LUT entry 799 low
@{*/


#define GFXMMU_LUT799L_LVB_SHIFT		16
#define GFXMMU_LUT799L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut799l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT799L_FVB_SHIFT		8
#define GFXMMU_LUT799L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut799l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT799L_EN Enable **/
#define GFXMMU_LUT799L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut799h LUT799H Graphic MMU LUT entry 799 high
@{*/


#define GFXMMU_LUT799H_LO_SHIFT		4
#define GFXMMU_LUT799H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut799h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut800l LUT800L Graphic MMU LUT entry 800 low
@{*/


#define GFXMMU_LUT800L_LVB_SHIFT		16
#define GFXMMU_LUT800L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut800l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT800L_FVB_SHIFT		8
#define GFXMMU_LUT800L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut800l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT800L_EN Enable **/
#define GFXMMU_LUT800L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut800h LUT800H Graphic MMU LUT entry 800 high
@{*/


#define GFXMMU_LUT800H_LO_SHIFT		4
#define GFXMMU_LUT800H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut800h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut801l LUT801L Graphic MMU LUT entry 801 low
@{*/


#define GFXMMU_LUT801L_LVB_SHIFT		16
#define GFXMMU_LUT801L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut801l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT801L_FVB_SHIFT		8
#define GFXMMU_LUT801L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut801l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT801L_EN Enable **/
#define GFXMMU_LUT801L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut801h LUT801H Graphic MMU LUT entry 801 high
@{*/


#define GFXMMU_LUT801H_LO_SHIFT		4
#define GFXMMU_LUT801H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut801h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut802l LUT802L Graphic MMU LUT entry 802 low
@{*/


#define GFXMMU_LUT802L_LVB_SHIFT		16
#define GFXMMU_LUT802L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut802l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT802L_FVB_SHIFT		8
#define GFXMMU_LUT802L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut802l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT802L_EN Enable **/
#define GFXMMU_LUT802L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut802h LUT802H Graphic MMU LUT entry 802 high
@{*/


#define GFXMMU_LUT802H_LO_SHIFT		4
#define GFXMMU_LUT802H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut802h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut803l LUT803L Graphic MMU LUT entry 803 low
@{*/


#define GFXMMU_LUT803L_LVB_SHIFT		16
#define GFXMMU_LUT803L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut803l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT803L_FVB_SHIFT		8
#define GFXMMU_LUT803L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut803l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT803L_EN Enable **/
#define GFXMMU_LUT803L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut803h LUT803H Graphic MMU LUT entry 803 high
@{*/


#define GFXMMU_LUT803H_LO_SHIFT		4
#define GFXMMU_LUT803H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut803h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut804l LUT804L Graphic MMU LUT entry 804 low
@{*/


#define GFXMMU_LUT804L_LVB_SHIFT		16
#define GFXMMU_LUT804L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut804l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT804L_FVB_SHIFT		8
#define GFXMMU_LUT804L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut804l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT804L_EN Enable **/
#define GFXMMU_LUT804L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut804h LUT804H Graphic MMU LUT entry 804 high
@{*/


#define GFXMMU_LUT804H_LO_SHIFT		4
#define GFXMMU_LUT804H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut804h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut805l LUT805L Graphic MMU LUT entry 805 low
@{*/


#define GFXMMU_LUT805L_LVB_SHIFT		16
#define GFXMMU_LUT805L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut805l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT805L_FVB_SHIFT		8
#define GFXMMU_LUT805L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut805l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT805L_EN Enable **/
#define GFXMMU_LUT805L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut805h LUT805H Graphic MMU LUT entry 805 high
@{*/


#define GFXMMU_LUT805H_LO_SHIFT		4
#define GFXMMU_LUT805H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut805h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut806l LUT806L Graphic MMU LUT entry 806 low
@{*/


#define GFXMMU_LUT806L_LVB_SHIFT		16
#define GFXMMU_LUT806L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut806l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT806L_FVB_SHIFT		8
#define GFXMMU_LUT806L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut806l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT806L_EN Enable **/
#define GFXMMU_LUT806L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut806h LUT806H Graphic MMU LUT entry 806 high
@{*/


#define GFXMMU_LUT806H_LO_SHIFT		4
#define GFXMMU_LUT806H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut806h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut807l LUT807L Graphic MMU LUT entry 807 low
@{*/


#define GFXMMU_LUT807L_LVB_SHIFT		16
#define GFXMMU_LUT807L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut807l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT807L_FVB_SHIFT		8
#define GFXMMU_LUT807L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut807l_fvb FVB First Valid Block
@{*/
/**@}*/

