grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT807L_EN Enable **/
#define GFXMMU_LUT807L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut807h LUT807H Graphic MMU LUT entry 807 high
@{*/


#define GFXMMU_LUT807H_LO_SHIFT		4
#define GFXMMU_LUT807H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut807h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut808l LUT808L Graphic MMU LUT entry 808 low
@{*/


#define GFXMMU_LUT808L_LVB_SHIFT		16
#define GFXMMU_LUT808L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut808l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT808L_FVB_SHIFT		8
#define GFXMMU_LUT808L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut808l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT808L_EN Enable **/
#define GFXMMU_LUT808L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut808h LUT808H Graphic MMU LUT entry 808 high
@{*/


#define GFXMMU_LUT808H_LO_SHIFT		4
#define GFXMMU_LUT808H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut808h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut809l LUT809L Graphic MMU LUT entry 809 low
@{*/


#define GFXMMU_LUT809L_LVB_SHIFT		16
#define GFXMMU_LUT809L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut809l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT809L_FVB_SHIFT		8
#define GFXMMU_LUT809L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut809l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT809L_EN Enable **/
#define GFXMMU_LUT809L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut809h LUT809H Graphic MMU LUT entry 809 high
@{*/


#define GFXMMU_LUT809H_LO_SHIFT		4
#define GFXMMU_LUT809H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut809h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut810l LUT810L Graphic MMU LUT entry 810 low
@{*/


#define GFXMMU_LUT810L_LVB_SHIFT		16
#define GFXMMU_LUT810L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut810l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT810L_FVB_SHIFT		8
#define GFXMMU_LUT810L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut810l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT810L_EN Enable **/
#define GFXMMU_LUT810L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut810h LUT810H Graphic MMU LUT entry 810 high
@{*/


#define GFXMMU_LUT810H_LO_SHIFT		4
#define GFXMMU_LUT810H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut810h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut811l LUT811L Graphic MMU LUT entry 811 low
@{*/


#define GFXMMU_LUT811L_LVB_SHIFT		16
#define GFXMMU_LUT811L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut811l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT811L_FVB_SHIFT		8
#define GFXMMU_LUT811L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut811l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT811L_EN Enable **/
#define GFXMMU_LUT811L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut811h LUT811H Graphic MMU LUT entry 811 high
@{*/


#define GFXMMU_LUT811H_LO_SHIFT		4
#define GFXMMU_LUT811H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut811h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut812l LUT812L Graphic MMU LUT entry 812 low
@{*/


#define GFXMMU_LUT812L_LVB_SHIFT		16
#define GFXMMU_LUT812L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut812l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT812L_FVB_SHIFT		8
#define GFXMMU_LUT812L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut812l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT812L_EN Enable **/
#define GFXMMU_LUT812L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut812h LUT812H Graphic MMU LUT entry 812 high
@{*/


#define GFXMMU_LUT812H_LO_SHIFT		4
#define GFXMMU_LUT812H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut812h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut813l LUT813L Graphic MMU LUT entry 813 low
@{*/


#define GFXMMU_LUT813L_LVB_SHIFT		16
#define GFXMMU_LUT813L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut813l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT813L_FVB_SHIFT		8
#define GFXMMU_LUT813L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut813l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT813L_EN Enable **/
#define GFXMMU_LUT813L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut813h LUT813H Graphic MMU LUT entry 813 high
@{*/


#define GFXMMU_LUT813H_LO_SHIFT		4
#define GFXMMU_LUT813H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut813h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut814l LUT814L Graphic MMU LUT entry 814 low
@{*/


#define GFXMMU_LUT814L_LVB_SHIFT		16
#define GFXMMU_LUT814L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut814l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT814L_FVB_SHIFT		8
#define GFXMMU_LUT814L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut814l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT814L_EN Enable **/
#define GFXMMU_LUT814L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut814h LUT814H Graphic MMU LUT entry 814 high
@{*/


#define GFXMMU_LUT814H_LO_SHIFT		4
#define GFXMMU_LUT814H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut814h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut815l LUT815L Graphic MMU LUT entry 815 low
@{*/


#define GFXMMU_LUT815L_LVB_SHIFT		16
#define GFXMMU_LUT815L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut815l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT815L_FVB_SHIFT		8
#define GFXMMU_LUT815L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut815l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT815L_EN Enable **/
#define GFXMMU_LUT815L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut815h LUT815H Graphic MMU LUT entry 815 high
@{*/


#define GFXMMU_LUT815H_LO_SHIFT		4
#define GFXMMU_LUT815H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut815h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut816l LUT816L Graphic MMU LUT entry 816 low
@{*/


#define GFXMMU_LUT816L_LVB_SHIFT		16
#define GFXMMU_LUT816L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut816l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT816L_FVB_SHIFT		8
#define GFXMMU_LUT816L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut816l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT816L_EN Enable **/
#define GFXMMU_LUT816L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut816h LUT816H Graphic MMU LUT entry 816 high
@{*/


#define GFXMMU_LUT816H_LO_SHIFT		4
#define GFXMMU_LUT816H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut816h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut817l LUT817L Graphic MMU LUT entry 817 low
@{*/


