grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT817L_LVB_SHIFT		16
#define GFXMMU_LUT817L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut817l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT817L_FVB_SHIFT		8
#define GFXMMU_LUT817L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut817l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT817L_EN Enable **/
#define GFXMMU_LUT817L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut817h LUT817H Graphic MMU LUT entry 817 high
@{*/


#define GFXMMU_LUT817H_LO_SHIFT		4
#define GFXMMU_LUT817H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut817h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut818l LUT818L Graphic MMU LUT entry 818 low
@{*/


#define GFXMMU_LUT818L_LVB_SHIFT		16
#define GFXMMU_LUT818L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut818l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT818L_FVB_SHIFT		8
#define GFXMMU_LUT818L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut818l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT818L_EN Enable **/
#define GFXMMU_LUT818L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut818h LUT818H Graphic MMU LUT entry 818 high
@{*/


#define GFXMMU_LUT818H_LO_SHIFT		4
#define GFXMMU_LUT818H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut818h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut819l LUT819L Graphic MMU LUT entry 819 low
@{*/


#define GFXMMU_LUT819L_LVB_SHIFT		16
#define GFXMMU_LUT819L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut819l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT819L_FVB_SHIFT		8
#define GFXMMU_LUT819L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut819l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT819L_EN Enable **/
#define GFXMMU_LUT819L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut819h LUT819H Graphic MMU LUT entry 819 high
@{*/


#define GFXMMU_LUT819H_LO_SHIFT		4
#define GFXMMU_LUT819H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut819h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut820l LUT820L Graphic MMU LUT entry 820 low
@{*/


#define GFXMMU_LUT820L_LVB_SHIFT		16
#define GFXMMU_LUT820L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut820l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT820L_FVB_SHIFT		8
#define GFXMMU_LUT820L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut820l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT820L_EN Enable **/
#define GFXMMU_LUT820L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut820h LUT820H Graphic MMU LUT entry 820 high
@{*/


#define GFXMMU_LUT820H_LO_SHIFT		4
#define GFXMMU_LUT820H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut820h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut821l LUT821L Graphic MMU LUT entry 821 low
@{*/


#define GFXMMU_LUT821L_LVB_SHIFT		16
#define GFXMMU_LUT821L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut821l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT821L_FVB_SHIFT		8
#define GFXMMU_LUT821L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut821l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT821L_EN Enable **/
#define GFXMMU_LUT821L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut821h LUT821H Graphic MMU LUT entry 821 high
@{*/


#define GFXMMU_LUT821H_LO_SHIFT		4
#define GFXMMU_LUT821H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut821h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut822l LUT822L Graphic MMU LUT entry 822 low
@{*/


#define GFXMMU_LUT822L_LVB_SHIFT		16
#define GFXMMU_LUT822L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut822l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT822L_FVB_SHIFT		8
#define GFXMMU_LUT822L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut822l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT822L_EN Enable **/
#define GFXMMU_LUT822L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut822h LUT822H Graphic MMU LUT entry 822 high
@{*/


#define GFXMMU_LUT822H_LO_SHIFT		4
#define GFXMMU_LUT822H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut822h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut823l LUT823L Graphic MMU LUT entry 823 low
@{*/


#define GFXMMU_LUT823L_LVB_SHIFT		16
#define GFXMMU_LUT823L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut823l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT823L_FVB_SHIFT		8
#define GFXMMU_LUT823L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut823l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT823L_EN Enable **/
#define GFXMMU_LUT823L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut823h LUT823H Graphic MMU LUT entry 823 high
@{*/


#define GFXMMU_LUT823H_LO_SHIFT		4
#define GFXMMU_LUT823H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut823h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut824l LUT824L Graphic MMU LUT entry 824 low
@{*/


#define GFXMMU_LUT824L_LVB_SHIFT		16
#define GFXMMU_LUT824L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut824l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT824L_FVB_SHIFT		8
#define GFXMMU_LUT824L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut824l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT824L_EN Enable **/
#define GFXMMU_LUT824L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut824h LUT824H Graphic MMU LUT entry 824 high
@{*/


#define GFXMMU_LUT824H_LO_SHIFT		4
#define GFXMMU_LUT824H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut824h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut825l LUT825L Graphic MMU LUT entry 825 low
@{*/


#define GFXMMU_LUT825L_LVB_SHIFT		16
#define GFXMMU_LUT825L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut825l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT825L_FVB_SHIFT		8
#define GFXMMU_LUT825L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut825l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT825L_EN Enable **/
#define GFXMMU_LUT825L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut825h LUT825H Graphic MMU LUT entry 825 high
@{*/


#define GFXMMU_LUT825H_LO_SHIFT		4
#define GFXMMU_LUT825H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut825h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut826l LUT826L Graphic MMU LUT entry 826 low
@{*/


#define GFXMMU_LUT826L_LVB_SHIFT		16
#define GFXMMU_LUT826L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut826l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT826L_FVB_SHIFT		8
#define GFXMMU_LUT826L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut826l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT826L_EN Enable **/
#define GFXMMU_LUT826L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut826h LUT826H Graphic MMU LUT entry 826 high
@{*/


#define GFXMMU_LUT826H_LO_SHIFT		4
#define GFXMMU_LUT826H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut826h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut827l LUT827L Graphic MMU LUT entry 827 low
@{*/


