grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT827L_LVB_SHIFT		16
#define GFXMMU_LUT827L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut827l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT827L_FVB_SHIFT		8
#define GFXMMU_LUT827L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut827l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT827L_EN Enable **/
#define GFXMMU_LUT827L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut827h LUT827H Graphic MMU LUT entry 827 high
@{*/


#define GFXMMU_LUT827H_LO_SHIFT		4
#define GFXMMU_LUT827H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut827h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut828l LUT828L Graphic MMU LUT entry 828 low
@{*/


#define GFXMMU_LUT828L_LVB_SHIFT		16
#define GFXMMU_LUT828L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut828l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT828L_FVB_SHIFT		8
#define GFXMMU_LUT828L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut828l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT828L_EN Enable **/
#define GFXMMU_LUT828L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut828h LUT828H Graphic MMU LUT entry 828 high
@{*/


#define GFXMMU_LUT828H_LO_SHIFT		4
#define GFXMMU_LUT828H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut828h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut829l LUT829L Graphic MMU LUT entry 829 low
@{*/


#define GFXMMU_LUT829L_LVB_SHIFT		16
#define GFXMMU_LUT829L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut829l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT829L_FVB_SHIFT		8
#define GFXMMU_LUT829L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut829l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT829L_EN Enable **/
#define GFXMMU_LUT829L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut829h LUT829H Graphic MMU LUT entry 829 high
@{*/


#define GFXMMU_LUT829H_LO_SHIFT		4
#define GFXMMU_LUT829H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut829h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut830l LUT830L Graphic MMU LUT entry 830 low
@{*/


#define GFXMMU_LUT830L_LVB_SHIFT		16
#define GFXMMU_LUT830L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut830l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT830L_FVB_SHIFT		8
#define GFXMMU_LUT830L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut830l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT830L_EN Enable **/
#define GFXMMU_LUT830L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut830h LUT830H Graphic MMU LUT entry 830 high
@{*/


#define GFXMMU_LUT830H_LO_SHIFT		4
#define GFXMMU_LUT830H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut830h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut831l LUT831L Graphic MMU LUT entry 831 low
@{*/


#define GFXMMU_LUT831L_LVB_SHIFT		16
#define GFXMMU_LUT831L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut831l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT831L_FVB_SHIFT		8
#define GFXMMU_LUT831L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut831l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT831L_EN Enable **/
#define GFXMMU_LUT831L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut831h LUT831H Graphic MMU LUT entry 831 high
@{*/


#define GFXMMU_LUT831H_LO_SHIFT		4
#define GFXMMU_LUT831H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut831h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut832l LUT832L Graphic MMU LUT entry 832 low
@{*/


#define GFXMMU_LUT832L_LVB_SHIFT		16
#define GFXMMU_LUT832L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut832l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT832L_FVB_SHIFT		8
#define GFXMMU_LUT832L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut832l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT832L_EN Enable **/
#define GFXMMU_LUT832L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut832h LUT832H Graphic MMU LUT entry 832 high
@{*/


#define GFXMMU_LUT832H_LO_SHIFT		4
#define GFXMMU_LUT832H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut832h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut833l LUT833L Graphic MMU LUT entry 833 low
@{*/


#define GFXMMU_LUT833L_LVB_SHIFT		16
#define GFXMMU_LUT833L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut833l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT833L_FVB_SHIFT		8
#define GFXMMU_LUT833L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut833l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT833L_EN Enable **/
#define GFXMMU_LUT833L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut833h LUT833H Graphic MMU LUT entry 833 high
@{*/


#define GFXMMU_LUT833H_LO_SHIFT		4
#define GFXMMU_LUT833H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut833h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut834l LUT834L Graphic MMU LUT entry 834 low
@{*/


#define GFXMMU_LUT834L_LVB_SHIFT		16
#define GFXMMU_LUT834L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut834l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT834L_FVB_SHIFT		8
#define GFXMMU_LUT834L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut834l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT834L_EN Enable **/
#define GFXMMU_LUT834L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut834h LUT834H Graphic MMU LUT entry 834 high
@{*/


#define GFXMMU_LUT834H_LO_SHIFT		4
#define GFXMMU_LUT834H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut834h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut835l LUT835L Graphic MMU LUT entry 835 low
@{*/


#define GFXMMU_LUT835L_LVB_SHIFT		16
#define GFXMMU_LUT835L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut835l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT835L_FVB_SHIFT		8
#define GFXMMU_LUT835L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut835l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT835L_EN Enable **/
#define GFXMMU_LUT835L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut835h LUT835H Graphic MMU LUT entry 835 high
@{*/


#define GFXMMU_LUT835H_LO_SHIFT		4
#define GFXMMU_LUT835H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut835h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut836l LUT836L Graphic MMU LUT entry 836 low
@{*/


#define GFXMMU_LUT836L_LVB_SHIFT		16
#define GFXMMU_LUT836L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut836l_lvb LVB Last Valid Block
@{*/
/**@}*/


