grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT836L_FVB_SHIFT		8
#define GFXMMU_LUT836L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut836l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT836L_EN Enable **/
#define GFXMMU_LUT836L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut836h LUT836H Graphic MMU LUT entry 836 high
@{*/


#define GFXMMU_LUT836H_LO_SHIFT		4
#define GFXMMU_LUT836H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut836h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut837l LUT837L Graphic MMU LUT entry 837 low
@{*/


#define GFXMMU_LUT837L_LVB_SHIFT		16
#define GFXMMU_LUT837L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut837l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT837L_FVB_SHIFT		8
#define GFXMMU_LUT837L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut837l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT837L_EN Enable **/
#define GFXMMU_LUT837L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut837h LUT837H Graphic MMU LUT entry 837 high
@{*/


#define GFXMMU_LUT837H_LO_SHIFT		4
#define GFXMMU_LUT837H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut837h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut838l LUT838L Graphic MMU LUT entry 838 low
@{*/


#define GFXMMU_LUT838L_LVB_SHIFT		16
#define GFXMMU_LUT838L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut838l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT838L_FVB_SHIFT		8
#define GFXMMU_LUT838L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut838l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT838L_EN Enable **/
#define GFXMMU_LUT838L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut838h LUT838H Graphic MMU LUT entry 838 high
@{*/


#define GFXMMU_LUT838H_LO_SHIFT		4
#define GFXMMU_LUT838H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut838h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut839l LUT839L Graphic MMU LUT entry 839 low
@{*/


#define GFXMMU_LUT839L_LVB_SHIFT		16
#define GFXMMU_LUT839L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut839l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT839L_FVB_SHIFT		8
#define GFXMMU_LUT839L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut839l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT839L_EN Enable **/
#define GFXMMU_LUT839L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut839h LUT839H Graphic MMU LUT entry 839 high
@{*/


#define GFXMMU_LUT839H_LO_SHIFT		4
#define GFXMMU_LUT839H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut839h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut840l LUT840L Graphic MMU LUT entry 840 low
@{*/


#define GFXMMU_LUT840L_LVB_SHIFT		16
#define GFXMMU_LUT840L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut840l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT840L_FVB_SHIFT		8
#define GFXMMU_LUT840L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut840l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT840L_EN Enable **/
#define GFXMMU_LUT840L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut840h LUT840H Graphic MMU LUT entry 840 high
@{*/


#define GFXMMU_LUT840H_LO_SHIFT		4
#define GFXMMU_LUT840H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut840h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut841l LUT841L Graphic MMU LUT entry 841 low
@{*/


#define GFXMMU_LUT841L_LVB_SHIFT		16
#define GFXMMU_LUT841L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut841l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT841L_FVB_SHIFT		8
#define GFXMMU_LUT841L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut841l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT841L_EN Enable **/
#define GFXMMU_LUT841L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut841h LUT841H Graphic MMU LUT entry 841 high
@{*/


#define GFXMMU_LUT841H_LO_SHIFT		4
#define GFXMMU_LUT841H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut841h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut842l LUT842L Graphic MMU LUT entry 842 low
@{*/


#define GFXMMU_LUT842L_LVB_SHIFT		16
#define GFXMMU_LUT842L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut842l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT842L_FVB_SHIFT		8
#define GFXMMU_LUT842L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut842l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT842L_EN Enable **/
#define GFXMMU_LUT842L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut842h LUT842H Graphic MMU LUT entry 842 high
@{*/


#define GFXMMU_LUT842H_LO_SHIFT		4
#define GFXMMU_LUT842H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut842h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut843l LUT843L Graphic MMU LUT entry 843 low
@{*/


#define GFXMMU_LUT843L_LVB_SHIFT		16
#define GFXMMU_LUT843L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut843l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT843L_FVB_SHIFT		8
#define GFXMMU_LUT843L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut843l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT843L_EN Enable **/
#define GFXMMU_LUT843L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut843h LUT843H Graphic MMU LUT entry 843 high
@{*/


#define GFXMMU_LUT843H_LO_SHIFT		4
#define GFXMMU_LUT843H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut843h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut844l LUT844L Graphic MMU LUT entry 844 low
@{*/


#define GFXMMU_LUT844L_LVB_SHIFT		16
#define GFXMMU_LUT844L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut844l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT844L_FVB_SHIFT		8
#define GFXMMU_LUT844L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut844l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT844L_EN Enable **/
#define GFXMMU_LUT844L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut844h LUT844H Graphic MMU LUT entry 844 high
@{*/


#define GFXMMU_LUT844H_LO_SHIFT		4
#define GFXMMU_LUT844H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut844h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut845l LUT845L Graphic MMU LUT entry 845 low
@{*/


#define GFXMMU_LUT845L_LVB_SHIFT		16
#define GFXMMU_LUT845L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut845l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT845L_FVB_SHIFT		8
#define GFXMMU_LUT845L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut845l_fvb FVB First Valid Block
@{*/
/**@}*/

