grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT845L_EN Enable **/
#define GFXMMU_LUT845L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut845h LUT845H Graphic MMU LUT entry 845 high
@{*/


#define GFXMMU_LUT845H_LO_SHIFT		4
#define GFXMMU_LUT845H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut845h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut846l LUT846L Graphic MMU LUT entry 846 low
@{*/


#define GFXMMU_LUT846L_LVB_SHIFT		16
#define GFXMMU_LUT846L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut846l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT846L_FVB_SHIFT		8
#define GFXMMU_LUT846L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut846l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT846L_EN Enable **/
#define GFXMMU_LUT846L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut846h LUT846H Graphic MMU LUT entry 846 high
@{*/


#define GFXMMU_LUT846H_LO_SHIFT		4
#define GFXMMU_LUT846H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut846h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut847l LUT847L Graphic MMU LUT entry 847 low
@{*/


#define GFXMMU_LUT847L_LVB_SHIFT		16
#define GFXMMU_LUT847L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut847l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT847L_FVB_SHIFT		8
#define GFXMMU_LUT847L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut847l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT847L_EN Enable **/
#define GFXMMU_LUT847L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut847h LUT847H Graphic MMU LUT entry 847 high
@{*/


#define GFXMMU_LUT847H_LO_SHIFT		4
#define GFXMMU_LUT847H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut847h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut848l LUT848L Graphic MMU LUT entry 848 low
@{*/


#define GFXMMU_LUT848L_LVB_SHIFT		16
#define GFXMMU_LUT848L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut848l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT848L_FVB_SHIFT		8
#define GFXMMU_LUT848L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut848l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT848L_EN Enable **/
#define GFXMMU_LUT848L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut848h LUT848H Graphic MMU LUT entry 848 high
@{*/


#define GFXMMU_LUT848H_LO_SHIFT		4
#define GFXMMU_LUT848H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut848h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut849l LUT849L Graphic MMU LUT entry 849 low
@{*/


#define GFXMMU_LUT849L_LVB_SHIFT		16
#define GFXMMU_LUT849L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut849l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT849L_FVB_SHIFT		8
#define GFXMMU_LUT849L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut849l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT849L_EN Enable **/
#define GFXMMU_LUT849L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut849h LUT849H Graphic MMU LUT entry 849 high
@{*/


#define GFXMMU_LUT849H_LO_SHIFT		4
#define GFXMMU_LUT849H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut849h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut850l LUT850L Graphic MMU LUT entry 850 low
@{*/


#define GFXMMU_LUT850L_LVB_SHIFT		16
#define GFXMMU_LUT850L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut850l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT850L_FVB_SHIFT		8
#define GFXMMU_LUT850L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut850l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT850L_EN Enable **/
#define GFXMMU_LUT850L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut850h LUT850H Graphic MMU LUT entry 850 high
@{*/


#define GFXMMU_LUT850H_LO_SHIFT		4
#define GFXMMU_LUT850H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut850h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut851l LUT851L Graphic MMU LUT entry 851 low
@{*/


#define GFXMMU_LUT851L_LVB_SHIFT		16
#define GFXMMU_LUT851L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut851l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT851L_FVB_SHIFT		8
#define GFXMMU_LUT851L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut851l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT851L_EN Enable **/
#define GFXMMU_LUT851L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut851h LUT851H Graphic MMU LUT entry 851 high
@{*/


#define GFXMMU_LUT851H_LO_SHIFT		4
#define GFXMMU_LUT851H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut851h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut852l LUT852L Graphic MMU LUT entry 852 low
@{*/


#define GFXMMU_LUT852L_LVB_SHIFT		16
#define GFXMMU_LUT852L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut852l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT852L_FVB_SHIFT		8
#define GFXMMU_LUT852L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut852l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT852L_EN Enable **/
#define GFXMMU_LUT852L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut852h LUT852H Graphic MMU LUT entry 852 high
@{*/


#define GFXMMU_LUT852H_LO_SHIFT		4
#define GFXMMU_LUT852H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut852h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut853l LUT853L Graphic MMU LUT entry 853 low
@{*/


#define GFXMMU_LUT853L_LVB_SHIFT		16
#define GFXMMU_LUT853L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut853l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT853L_FVB_SHIFT		8
#define GFXMMU_LUT853L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut853l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT853L_EN Enable **/
#define GFXMMU_LUT853L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut853h LUT853H Graphic MMU LUT entry 853 high
@{*/


#define GFXMMU_LUT853H_LO_SHIFT		4
#define GFXMMU_LUT853H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut853h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut854l LUT854L Graphic MMU LUT entry 854 low
@{*/


#define GFXMMU_LUT854L_LVB_SHIFT		16
#define GFXMMU_LUT854L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut854l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT854L_FVB_SHIFT		8
#define GFXMMU_LUT854L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut854l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT854L_EN Enable **/
#define GFXMMU_LUT854L_EN		(1 << 0)

/**@}*/

