grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut854h LUT854H Graphic MMU LUT entry 854 high
@{*/


#define GFXMMU_LUT854H_LO_SHIFT		4
#define GFXMMU_LUT854H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut854h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut855l LUT855L Graphic MMU LUT entry 855 low
@{*/


#define GFXMMU_LUT855L_LVB_SHIFT		16
#define GFXMMU_LUT855L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut855l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT855L_FVB_SHIFT		8
#define GFXMMU_LUT855L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut855l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT855L_EN Enable **/
#define GFXMMU_LUT855L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut855h LUT855H Graphic MMU LUT entry 855 high
@{*/


#define GFXMMU_LUT855H_LO_SHIFT		4
#define GFXMMU_LUT855H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut855h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut856l LUT856L Graphic MMU LUT entry 856 low
@{*/


#define GFXMMU_LUT856L_LVB_SHIFT		16
#define GFXMMU_LUT856L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut856l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT856L_FVB_SHIFT		8
#define GFXMMU_LUT856L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut856l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT856L_EN Enable **/
#define GFXMMU_LUT856L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut856h LUT856H Graphic MMU LUT entry 856 high
@{*/


#define GFXMMU_LUT856H_LO_SHIFT		4
#define GFXMMU_LUT856H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut856h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut857l LUT857L Graphic MMU LUT entry 857 low
@{*/


#define GFXMMU_LUT857L_LVB_SHIFT		16
#define GFXMMU_LUT857L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut857l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT857L_FVB_SHIFT		8
#define GFXMMU_LUT857L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut857l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT857L_EN Enable **/
#define GFXMMU_LUT857L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut857h LUT857H Graphic MMU LUT entry 857 high
@{*/


#define GFXMMU_LUT857H_LO_SHIFT		4
#define GFXMMU_LUT857H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut857h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut858l LUT858L Graphic MMU LUT entry 858 low
@{*/


#define GFXMMU_LUT858L_LVB_SHIFT		16
#define GFXMMU_LUT858L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut858l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT858L_FVB_SHIFT		8
#define GFXMMU_LUT858L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut858l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT858L_EN Enable **/
#define GFXMMU_LUT858L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut858h LUT858H Graphic MMU LUT entry 858 high
@{*/


#define GFXMMU_LUT858H_LO_SHIFT		4
#define GFXMMU_LUT858H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut858h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut859l LUT859L Graphic MMU LUT entry 859 low
@{*/


#define GFXMMU_LUT859L_LVB_SHIFT		16
#define GFXMMU_LUT859L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut859l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT859L_FVB_SHIFT		8
#define GFXMMU_LUT859L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut859l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT859L_EN Enable **/
#define GFXMMU_LUT859L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut859h LUT859H Graphic MMU LUT entry 859 high
@{*/


#define GFXMMU_LUT859H_LO_SHIFT		4
#define GFXMMU_LUT859H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut859h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut860l LUT860L Graphic MMU LUT entry 860 low
@{*/


#define GFXMMU_LUT860L_LVB_SHIFT		16
#define GFXMMU_LUT860L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut860l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT860L_FVB_SHIFT		8
#define GFXMMU_LUT860L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut860l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT860L_EN Enable **/
#define GFXMMU_LUT860L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut860h LUT860H Graphic MMU LUT entry 860 high
@{*/


#define GFXMMU_LUT860H_LO_SHIFT		4
#define GFXMMU_LUT860H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut860h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut861l LUT861L Graphic MMU LUT entry 861 low
@{*/


#define GFXMMU_LUT861L_LVB_SHIFT		16
#define GFXMMU_LUT861L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut861l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT861L_FVB_SHIFT		8
#define GFXMMU_LUT861L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut861l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT861L_EN Enable **/
#define GFXMMU_LUT861L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut861h LUT861H Graphic MMU LUT entry 861 high
@{*/


#define GFXMMU_LUT861H_LO_SHIFT		4
#define GFXMMU_LUT861H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut861h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut862l LUT862L Graphic MMU LUT entry 862 low
@{*/


#define GFXMMU_LUT862L_LVB_SHIFT		16
#define GFXMMU_LUT862L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut862l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT862L_FVB_SHIFT		8
#define GFXMMU_LUT862L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut862l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT862L_EN Enable **/
#define GFXMMU_LUT862L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut862h LUT862H Graphic MMU LUT entry 862 high
@{*/


#define GFXMMU_LUT862H_LO_SHIFT		4
#define GFXMMU_LUT862H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut862h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut863l LUT863L Graphic MMU LUT entry 863 low
@{*/


#define GFXMMU_LUT863L_LVB_SHIFT		16
#define GFXMMU_LUT863L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut863l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT863L_FVB_SHIFT		8
#define GFXMMU_LUT863L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut863l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT863L_EN Enable **/
#define GFXMMU_LUT863L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut863h LUT863H Graphic MMU LUT entry 863 high
@{*/


#define GFXMMU_LUT863H_LO_SHIFT		4
#define GFXMMU_LUT863H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut863h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

