grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut864l LUT864L Graphic MMU LUT entry 864 low
@{*/


#define GFXMMU_LUT864L_LVB_SHIFT		16
#define GFXMMU_LUT864L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut864l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT864L_FVB_SHIFT		8
#define GFXMMU_LUT864L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut864l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT864L_EN Enable **/
#define GFXMMU_LUT864L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut864h LUT864H Graphic MMU LUT entry 864 high
@{*/


#define GFXMMU_LUT864H_LO_SHIFT		4
#define GFXMMU_LUT864H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut864h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut865l LUT865L Graphic MMU LUT entry 865 low
@{*/


#define GFXMMU_LUT865L_LVB_SHIFT		16
#define GFXMMU_LUT865L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut865l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT865L_FVB_SHIFT		8
#define GFXMMU_LUT865L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut865l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT865L_EN Enable **/
#define GFXMMU_LUT865L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut865h LUT865H Graphic MMU LUT entry 865 high
@{*/


#define GFXMMU_LUT865H_LO_SHIFT		4
#define GFXMMU_LUT865H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut865h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut866l LUT866L Graphic MMU LUT entry 866 low
@{*/


#define GFXMMU_LUT866L_LVB_SHIFT		16
#define GFXMMU_LUT866L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut866l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT866L_FVB_SHIFT		8
#define GFXMMU_LUT866L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut866l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT866L_EN Enable **/
#define GFXMMU_LUT866L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut866h LUT866H Graphic MMU LUT entry 866 high
@{*/


#define GFXMMU_LUT866H_LO_SHIFT		4
#define GFXMMU_LUT866H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut866h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut867l LUT867L Graphic MMU LUT entry 867 low
@{*/


#define GFXMMU_LUT867L_LVB_SHIFT		16
#define GFXMMU_LUT867L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut867l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT867L_FVB_SHIFT		8
#define GFXMMU_LUT867L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut867l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT867L_EN Enable **/
#define GFXMMU_LUT867L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut867h LUT867H Graphic MMU LUT entry 867 high
@{*/


#define GFXMMU_LUT867H_LO_SHIFT		4
#define GFXMMU_LUT867H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut867h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut868l LUT868L Graphic MMU LUT entry 868 low
@{*/


#define GFXMMU_LUT868L_LVB_SHIFT		16
#define GFXMMU_LUT868L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut868l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT868L_FVB_SHIFT		8
#define GFXMMU_LUT868L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut868l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT868L_EN Enable **/
#define GFXMMU_LUT868L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut868h LUT868H Graphic MMU LUT entry 868 high
@{*/


#define GFXMMU_LUT868H_LO_SHIFT		4
#define GFXMMU_LUT868H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut868h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut869l LUT869L Graphic MMU LUT entry 869 low
@{*/


#define GFXMMU_LUT869L_LVB_SHIFT		16
#define GFXMMU_LUT869L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut869l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT869L_FVB_SHIFT		8
#define GFXMMU_LUT869L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut869l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT869L_EN Enable **/
#define GFXMMU_LUT869L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut869h LUT869H Graphic MMU LUT entry 869 high
@{*/


#define GFXMMU_LUT869H_LO_SHIFT		4
#define GFXMMU_LUT869H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut869h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut870l LUT870L Graphic MMU LUT entry 870 low
@{*/


#define GFXMMU_LUT870L_LVB_SHIFT		16
#define GFXMMU_LUT870L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut870l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT870L_FVB_SHIFT		8
#define GFXMMU_LUT870L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut870l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT870L_EN Enable **/
#define GFXMMU_LUT870L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut870h LUT870H Graphic MMU LUT entry 870 high
@{*/


#define GFXMMU_LUT870H_LO_SHIFT		4
#define GFXMMU_LUT870H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut870h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut871l LUT871L Graphic MMU LUT entry 871 low
@{*/


#define GFXMMU_LUT871L_LVB_SHIFT		16
#define GFXMMU_LUT871L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut871l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT871L_FVB_SHIFT		8
#define GFXMMU_LUT871L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut871l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT871L_EN Enable **/
#define GFXMMU_LUT871L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut871h LUT871H Graphic MMU LUT entry 871 high
@{*/


#define GFXMMU_LUT871H_LO_SHIFT		4
#define GFXMMU_LUT871H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut871h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut872l LUT872L Graphic MMU LUT entry 872 low
@{*/


#define GFXMMU_LUT872L_LVB_SHIFT		16
#define GFXMMU_LUT872L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut872l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT872L_FVB_SHIFT		8
#define GFXMMU_LUT872L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut872l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT872L_EN Enable **/
#define GFXMMU_LUT872L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut872h LUT872H Graphic MMU LUT entry 872 high
@{*/


#define GFXMMU_LUT872H_LO_SHIFT		4
#define GFXMMU_LUT872H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut872h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut873l LUT873L Graphic MMU LUT entry 873 low
@{*/


#define GFXMMU_LUT873L_LVB_SHIFT		16
#define GFXMMU_LUT873L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut873l_lvb LVB Last Valid Block
@{*/
/**@}*/


