grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT873L_FVB_SHIFT		8
#define GFXMMU_LUT873L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut873l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT873L_EN Enable **/
#define GFXMMU_LUT873L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut873h LUT873H Graphic MMU LUT entry 873 high
@{*/


#define GFXMMU_LUT873H_LO_SHIFT		4
#define GFXMMU_LUT873H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut873h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut874l LUT874L Graphic MMU LUT entry 874 low
@{*/


#define GFXMMU_LUT874L_LVB_SHIFT		16
#define GFXMMU_LUT874L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut874l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT874L_FVB_SHIFT		8
#define GFXMMU_LUT874L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut874l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT874L_EN Enable **/
#define GFXMMU_LUT874L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut874h LUT874H Graphic MMU LUT entry 874 high
@{*/


#define GFXMMU_LUT874H_LO_SHIFT		4
#define GFXMMU_LUT874H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut874h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut875l LUT875L Graphic MMU LUT entry 875 low
@{*/


#define GFXMMU_LUT875L_LVB_SHIFT		16
#define GFXMMU_LUT875L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut875l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT875L_FVB_SHIFT		8
#define GFXMMU_LUT875L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut875l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT875L_EN Enable **/
#define GFXMMU_LUT875L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut875h LUT875H Graphic MMU LUT entry 875 high
@{*/


#define GFXMMU_LUT875H_LO_SHIFT		4
#define GFXMMU_LUT875H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut875h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut876l LUT876L Graphic MMU LUT entry 876 low
@{*/


#define GFXMMU_LUT876L_LVB_SHIFT		16
#define GFXMMU_LUT876L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut876l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT876L_FVB_SHIFT		8
#define GFXMMU_LUT876L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut876l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT876L_EN Enable **/
#define GFXMMU_LUT876L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut876h LUT876H Graphic MMU LUT entry 876 high
@{*/


#define GFXMMU_LUT876H_LO_SHIFT		4
#define GFXMMU_LUT876H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut876h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut877l LUT877L Graphic MMU LUT entry 877 low
@{*/


#define GFXMMU_LUT877L_LVB_SHIFT		16
#define GFXMMU_LUT877L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut877l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT877L_FVB_SHIFT		8
#define GFXMMU_LUT877L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut877l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT877L_EN Enable **/
#define GFXMMU_LUT877L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut877h LUT877H Graphic MMU LUT entry 877 high
@{*/


#define GFXMMU_LUT877H_LO_SHIFT		4
#define GFXMMU_LUT877H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut877h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut878l LUT878L Graphic MMU LUT entry 878 low
@{*/


#define GFXMMU_LUT878L_LVB_SHIFT		16
#define GFXMMU_LUT878L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut878l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT878L_FVB_SHIFT		8
#define GFXMMU_LUT878L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut878l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT878L_EN Enable **/
#define GFXMMU_LUT878L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut878h LUT878H Graphic MMU LUT entry 878 high
@{*/


#define GFXMMU_LUT878H_LO_SHIFT		4
#define GFXMMU_LUT878H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut878h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut879l LUT879L Graphic MMU LUT entry 879 low
@{*/


#define GFXMMU_LUT879L_LVB_SHIFT		16
#define GFXMMU_LUT879L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut879l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT879L_FVB_SHIFT		8
#define GFXMMU_LUT879L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut879l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT879L_EN Enable **/
#define GFXMMU_LUT879L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut879h LUT879H Graphic MMU LUT entry 879 high
@{*/


#define GFXMMU_LUT879H_LO_SHIFT		4
#define GFXMMU_LUT879H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut879h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut880l LUT880L Graphic MMU LUT entry 880 low
@{*/


#define GFXMMU_LUT880L_LVB_SHIFT		16
#define GFXMMU_LUT880L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut880l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT880L_FVB_SHIFT		8
#define GFXMMU_LUT880L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut880l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT880L_EN Enable **/
#define GFXMMU_LUT880L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut880h LUT880H Graphic MMU LUT entry 880 high
@{*/


#define GFXMMU_LUT880H_LO_SHIFT		4
#define GFXMMU_LUT880H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut880h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut881l LUT881L Graphic MMU LUT entry 881 low
@{*/


#define GFXMMU_LUT881L_LVB_SHIFT		16
#define GFXMMU_LUT881L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut881l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT881L_FVB_SHIFT		8
#define GFXMMU_LUT881L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut881l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT881L_EN Enable **/
#define GFXMMU_LUT881L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut881h LUT881H Graphic MMU LUT entry 881 high
@{*/


#define GFXMMU_LUT881H_LO_SHIFT		4
#define GFXMMU_LUT881H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut881h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut882l LUT882L Graphic MMU LUT entry 882 low
@{*/


#define GFXMMU_LUT882L_LVB_SHIFT		16
#define GFXMMU_LUT882L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut882l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT882L_FVB_SHIFT		8
#define GFXMMU_LUT882L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut882l_fvb FVB First Valid Block
@{*/
/**@}*/

