grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT882L_EN Enable **/
#define GFXMMU_LUT882L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut882h LUT882H Graphic MMU LUT entry 882 high
@{*/


#define GFXMMU_LUT882H_LO_SHIFT		4
#define GFXMMU_LUT882H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut882h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut883l LUT883L Graphic MMU LUT entry 883 low
@{*/


#define GFXMMU_LUT883L_LVB_SHIFT		16
#define GFXMMU_LUT883L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut883l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT883L_FVB_SHIFT		8
#define GFXMMU_LUT883L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut883l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT883L_EN Enable **/
#define GFXMMU_LUT883L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut883h LUT883H Graphic MMU LUT entry 883 high
@{*/


#define GFXMMU_LUT883H_LO_SHIFT		4
#define GFXMMU_LUT883H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut883h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut884l LUT884L Graphic MMU LUT entry 884 low
@{*/


#define GFXMMU_LUT884L_LVB_SHIFT		16
#define GFXMMU_LUT884L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut884l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT884L_FVB_SHIFT		8
#define GFXMMU_LUT884L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut884l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT884L_EN Enable **/
#define GFXMMU_LUT884L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut884h LUT884H Graphic MMU LUT entry 884 high
@{*/


#define GFXMMU_LUT884H_LO_SHIFT		4
#define GFXMMU_LUT884H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut884h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut885l LUT885L Graphic MMU LUT entry 885 low
@{*/


#define GFXMMU_LUT885L_LVB_SHIFT		16
#define GFXMMU_LUT885L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut885l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT885L_FVB_SHIFT		8
#define GFXMMU_LUT885L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut885l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT885L_EN Enable **/
#define GFXMMU_LUT885L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut885h LUT885H Graphic MMU LUT entry 885 high
@{*/


#define GFXMMU_LUT885H_LO_SHIFT		4
#define GFXMMU_LUT885H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut885h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut886l LUT886L Graphic MMU LUT entry 886 low
@{*/


#define GFXMMU_LUT886L_LVB_SHIFT		16
#define GFXMMU_LUT886L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut886l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT886L_FVB_SHIFT		8
#define GFXMMU_LUT886L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut886l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT886L_EN Enable **/
#define GFXMMU_LUT886L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut886h LUT886H Graphic MMU LUT entry 886 high
@{*/


#define GFXMMU_LUT886H_LO_SHIFT		4
#define GFXMMU_LUT886H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut886h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut887l LUT887L Graphic MMU LUT entry 887 low
@{*/


#define GFXMMU_LUT887L_LVB_SHIFT		16
#define GFXMMU_LUT887L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut887l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT887L_FVB_SHIFT		8
#define GFXMMU_LUT887L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut887l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT887L_EN Enable **/
#define GFXMMU_LUT887L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut887h LUT887H Graphic MMU LUT entry 887 high
@{*/


#define GFXMMU_LUT887H_LO_SHIFT		4
#define GFXMMU_LUT887H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut887h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut888l LUT888L Graphic MMU LUT entry 888 low
@{*/


#define GFXMMU_LUT888L_LVB_SHIFT		16
#define GFXMMU_LUT888L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut888l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT888L_FVB_SHIFT		8
#define GFXMMU_LUT888L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut888l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT888L_EN Enable **/
#define GFXMMU_LUT888L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut888h LUT888H Graphic MMU LUT entry 888 high
@{*/


#define GFXMMU_LUT888H_LO_SHIFT		4
#define GFXMMU_LUT888H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut888h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut889l LUT889L Graphic MMU LUT entry 889 low
@{*/


#define GFXMMU_LUT889L_LVB_SHIFT		16
#define GFXMMU_LUT889L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut889l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT889L_FVB_SHIFT		8
#define GFXMMU_LUT889L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut889l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT889L_EN Enable **/
#define GFXMMU_LUT889L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut889h LUT889H Graphic MMU LUT entry 889 high
@{*/


#define GFXMMU_LUT889H_LO_SHIFT		4
#define GFXMMU_LUT889H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut889h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut890l LUT890L Graphic MMU LUT entry 890 low
@{*/


#define GFXMMU_LUT890L_LVB_SHIFT		16
#define GFXMMU_LUT890L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut890l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT890L_FVB_SHIFT		8
#define GFXMMU_LUT890L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut890l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT890L_EN Enable **/
#define GFXMMU_LUT890L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut890h LUT890H Graphic MMU LUT entry 890 high
@{*/


#define GFXMMU_LUT890H_LO_SHIFT		4
#define GFXMMU_LUT890H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut890h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut891l LUT891L Graphic MMU LUT entry 891 low
@{*/


#define GFXMMU_LUT891L_LVB_SHIFT		16
#define GFXMMU_LUT891L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut891l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT891L_FVB_SHIFT		8
#define GFXMMU_LUT891L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut891l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT891L_EN Enable **/
#define GFXMMU_LUT891L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut891h LUT891H Graphic MMU LUT entry 891 high
@{*/


#define GFXMMU_LUT891H_LO_SHIFT		4
#define GFXMMU_LUT891H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut891h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut892l LUT892L Graphic MMU LUT entry 892 low
@{*/


