grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT892L_LVB_SHIFT		16
#define GFXMMU_LUT892L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut892l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT892L_FVB_SHIFT		8
#define GFXMMU_LUT892L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut892l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT892L_EN Enable **/
#define GFXMMU_LUT892L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut892h LUT892H Graphic MMU LUT entry 892 high
@{*/


#define GFXMMU_LUT892H_LO_SHIFT		4
#define GFXMMU_LUT892H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut892h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut893l LUT893L Graphic MMU LUT entry 893 low
@{*/


#define GFXMMU_LUT893L_LVB_SHIFT		16
#define GFXMMU_LUT893L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut893l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT893L_FVB_SHIFT		8
#define GFXMMU_LUT893L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut893l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT893L_EN Enable **/
#define GFXMMU_LUT893L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut893h LUT893H Graphic MMU LUT entry 893 high
@{*/


#define GFXMMU_LUT893H_LO_SHIFT		4
#define GFXMMU_LUT893H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut893h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut894l LUT894L Graphic MMU LUT entry 894 low
@{*/


#define GFXMMU_LUT894L_LVB_SHIFT		16
#define GFXMMU_LUT894L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut894l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT894L_FVB_SHIFT		8
#define GFXMMU_LUT894L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut894l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT894L_EN Enable **/
#define GFXMMU_LUT894L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut894h LUT894H Graphic MMU LUT entry 894 high
@{*/


#define GFXMMU_LUT894H_LO_SHIFT		4
#define GFXMMU_LUT894H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut894h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut895l LUT895L Graphic MMU LUT entry 895 low
@{*/


#define GFXMMU_LUT895L_LVB_SHIFT		16
#define GFXMMU_LUT895L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut895l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT895L_FVB_SHIFT		8
#define GFXMMU_LUT895L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut895l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT895L_EN Enable **/
#define GFXMMU_LUT895L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut895h LUT895H Graphic MMU LUT entry 895 high
@{*/


#define GFXMMU_LUT895H_LO_SHIFT		4
#define GFXMMU_LUT895H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut895h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut896l LUT896L Graphic MMU LUT entry 896 low
@{*/


#define GFXMMU_LUT896L_LVB_SHIFT		16
#define GFXMMU_LUT896L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut896l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT896L_FVB_SHIFT		8
#define GFXMMU_LUT896L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut896l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT896L_EN Enable **/
#define GFXMMU_LUT896L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut896h LUT896H Graphic MMU LUT entry 896 high
@{*/


#define GFXMMU_LUT896H_LO_SHIFT		4
#define GFXMMU_LUT896H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut896h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut897l LUT897L Graphic MMU LUT entry 897 low
@{*/


#define GFXMMU_LUT897L_LVB_SHIFT		16
#define GFXMMU_LUT897L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut897l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT897L_FVB_SHIFT		8
#define GFXMMU_LUT897L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut897l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT897L_EN Enable **/
#define GFXMMU_LUT897L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut897h LUT897H Graphic MMU LUT entry 897 high
@{*/


#define GFXMMU_LUT897H_LO_SHIFT		4
#define GFXMMU_LUT897H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut897h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut898l LUT898L Graphic MMU LUT entry 898 low
@{*/


#define GFXMMU_LUT898L_LVB_SHIFT		16
#define GFXMMU_LUT898L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut898l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT898L_FVB_SHIFT		8
#define GFXMMU_LUT898L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut898l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT898L_EN Enable **/
#define GFXMMU_LUT898L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut898h LUT898H Graphic MMU LUT entry 898 high
@{*/


#define GFXMMU_LUT898H_LO_SHIFT		4
#define GFXMMU_LUT898H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut898h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut899l LUT899L Graphic MMU LUT entry 899 low
@{*/


#define GFXMMU_LUT899L_LVB_SHIFT		16
#define GFXMMU_LUT899L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut899l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT899L_FVB_SHIFT		8
#define GFXMMU_LUT899L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut899l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT899L_EN Enable **/
#define GFXMMU_LUT899L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut899h LUT899H Graphic MMU LUT entry 899 high
@{*/


#define GFXMMU_LUT899H_LO_SHIFT		4
#define GFXMMU_LUT899H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut899h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut900l LUT900L Graphic MMU LUT entry 900 low
@{*/


#define GFXMMU_LUT900L_LVB_SHIFT		16
#define GFXMMU_LUT900L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut900l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT900L_FVB_SHIFT		8
#define GFXMMU_LUT900L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut900l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT900L_EN Enable **/
#define GFXMMU_LUT900L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut900h LUT900H Graphic MMU LUT entry 900 high
@{*/


#define GFXMMU_LUT900H_LO_SHIFT		4
#define GFXMMU_LUT900H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut900h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut901l LUT901L Graphic MMU LUT entry 901 low
@{*/


#define GFXMMU_LUT901L_LVB_SHIFT		16
#define GFXMMU_LUT901L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut901l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT901L_FVB_SHIFT		8
#define GFXMMU_LUT901L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut901l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT901L_EN Enable **/
#define GFXMMU_LUT901L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut901h LUT901H Graphic MMU LUT entry 901 high
@{*/


#define GFXMMU_LUT901H_LO_SHIFT		4
#define GFXMMU_LUT901H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut901h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut902l LUT902L Graphic MMU LUT entry 902 low
@{*/


