grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT902L_LVB_SHIFT		16
#define GFXMMU_LUT902L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut902l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT902L_FVB_SHIFT		8
#define GFXMMU_LUT902L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut902l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT902L_EN Enable **/
#define GFXMMU_LUT902L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut902h LUT902H Graphic MMU LUT entry 902 high
@{*/


#define GFXMMU_LUT902H_LO_SHIFT		4
#define GFXMMU_LUT902H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut902h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut903l LUT903L Graphic MMU LUT entry 903 low
@{*/


#define GFXMMU_LUT903L_LVB_SHIFT		16
#define GFXMMU_LUT903L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut903l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT903L_FVB_SHIFT		8
#define GFXMMU_LUT903L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut903l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT903L_EN Enable **/
#define GFXMMU_LUT903L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut903h LUT903H Graphic MMU LUT entry 903 high
@{*/


#define GFXMMU_LUT903H_LO_SHIFT		4
#define GFXMMU_LUT903H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut903h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut904l LUT904L Graphic MMU LUT entry 904 low
@{*/


#define GFXMMU_LUT904L_LVB_SHIFT		16
#define GFXMMU_LUT904L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut904l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT904L_FVB_SHIFT		8
#define GFXMMU_LUT904L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut904l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT904L_EN Enable **/
#define GFXMMU_LUT904L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut904h LUT904H Graphic MMU LUT entry 904 high
@{*/


#define GFXMMU_LUT904H_LO_SHIFT		4
#define GFXMMU_LUT904H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut904h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut905l LUT905L Graphic MMU LUT entry 905 low
@{*/


#define GFXMMU_LUT905L_LVB_SHIFT		16
#define GFXMMU_LUT905L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut905l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT905L_FVB_SHIFT		8
#define GFXMMU_LUT905L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut905l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT905L_EN Enable **/
#define GFXMMU_LUT905L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut905h LUT905H Graphic MMU LUT entry 905 high
@{*/


#define GFXMMU_LUT905H_LO_SHIFT		4
#define GFXMMU_LUT905H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut905h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut906l LUT906L Graphic MMU LUT entry 906 low
@{*/


#define GFXMMU_LUT906L_LVB_SHIFT		16
#define GFXMMU_LUT906L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut906l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT906L_FVB_SHIFT		8
#define GFXMMU_LUT906L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut906l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT906L_EN Enable **/
#define GFXMMU_LUT906L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut906h LUT906H Graphic MMU LUT entry 906 high
@{*/


#define GFXMMU_LUT906H_LO_SHIFT		4
#define GFXMMU_LUT906H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut906h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut907l LUT907L Graphic MMU LUT entry 907 low
@{*/


#define GFXMMU_LUT907L_LVB_SHIFT		16
#define GFXMMU_LUT907L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut907l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT907L_FVB_SHIFT		8
#define GFXMMU_LUT907L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut907l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT907L_EN Enable **/
#define GFXMMU_LUT907L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut907h LUT907H Graphic MMU LUT entry 907 high
@{*/


#define GFXMMU_LUT907H_LO_SHIFT		4
#define GFXMMU_LUT907H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut907h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut908l LUT908L Graphic MMU LUT entry 908 low
@{*/


#define GFXMMU_LUT908L_LVB_SHIFT		16
#define GFXMMU_LUT908L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut908l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT908L_FVB_SHIFT		8
#define GFXMMU_LUT908L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut908l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT908L_EN Enable **/
#define GFXMMU_LUT908L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut908h LUT908H Graphic MMU LUT entry 908 high
@{*/


#define GFXMMU_LUT908H_LO_SHIFT		4
#define GFXMMU_LUT908H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut908h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut909l LUT909L Graphic MMU LUT entry 909 low
@{*/


#define GFXMMU_LUT909L_LVB_SHIFT		16
#define GFXMMU_LUT909L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut909l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT909L_FVB_SHIFT		8
#define GFXMMU_LUT909L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut909l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT909L_EN Enable **/
#define GFXMMU_LUT909L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut909h LUT909H Graphic MMU LUT entry 909 high
@{*/


#define GFXMMU_LUT909H_LO_SHIFT		4
#define GFXMMU_LUT909H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut909h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut910l LUT910L Graphic MMU LUT entry 910 low
@{*/


#define GFXMMU_LUT910L_LVB_SHIFT		16
#define GFXMMU_LUT910L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut910l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT910L_FVB_SHIFT		8
#define GFXMMU_LUT910L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut910l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT910L_EN Enable **/
#define GFXMMU_LUT910L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut910h LUT910H Graphic MMU LUT entry 910 high
@{*/


#define GFXMMU_LUT910H_LO_SHIFT		4
#define GFXMMU_LUT910H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut910h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut911l LUT911L Graphic MMU LUT entry 911 low
@{*/


#define GFXMMU_LUT911L_LVB_SHIFT		16
#define GFXMMU_LUT911L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut911l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT911L_FVB_SHIFT		8
#define GFXMMU_LUT911L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut911l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT911L_EN Enable **/
#define GFXMMU_LUT911L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut911h LUT911H Graphic MMU LUT entry 911 high
@{*/


#define GFXMMU_LUT911H_LO_SHIFT		4
#define GFXMMU_LUT911H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut911h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut912l LUT912L Graphic MMU LUT entry 912 low
@{*/


#define GFXMMU_LUT912L_LVB_SHIFT		16
#define GFXMMU_LUT912L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut912l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT912L_FVB_SHIFT		8
#define GFXMMU_LUT912L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut912l_fvb FVB First Valid Block
@{*/
/**@}*/

