grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT912L_EN Enable **/
#define GFXMMU_LUT912L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut912h LUT912H Graphic MMU LUT entry 912 high
@{*/


#define GFXMMU_LUT912H_LO_SHIFT		4
#define GFXMMU_LUT912H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut912h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut913l LUT913L Graphic MMU LUT entry 913 low
@{*/


#define GFXMMU_LUT913L_LVB_SHIFT		16
#define GFXMMU_LUT913L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut913l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT913L_FVB_SHIFT		8
#define GFXMMU_LUT913L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut913l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT913L_EN Enable **/
#define GFXMMU_LUT913L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut913h LUT913H Graphic MMU LUT entry 913 high
@{*/


#define GFXMMU_LUT913H_LO_SHIFT		4
#define GFXMMU_LUT913H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut913h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut914l LUT914L Graphic MMU LUT entry 914 low
@{*/


#define GFXMMU_LUT914L_LVB_SHIFT		16
#define GFXMMU_LUT914L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut914l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT914L_FVB_SHIFT		8
#define GFXMMU_LUT914L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut914l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT914L_EN Enable **/
#define GFXMMU_LUT914L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut914h LUT914H Graphic MMU LUT entry 914 high
@{*/


#define GFXMMU_LUT914H_LO_SHIFT		4
#define GFXMMU_LUT914H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut914h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut915l LUT915L Graphic MMU LUT entry 915 low
@{*/


#define GFXMMU_LUT915L_LVB_SHIFT		16
#define GFXMMU_LUT915L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut915l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT915L_FVB_SHIFT		8
#define GFXMMU_LUT915L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut915l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT915L_EN Enable **/
#define GFXMMU_LUT915L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut915h LUT915H Graphic MMU LUT entry 915 high
@{*/


#define GFXMMU_LUT915H_LO_SHIFT		4
#define GFXMMU_LUT915H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut915h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut916l LUT916L Graphic MMU LUT entry 916 low
@{*/


#define GFXMMU_LUT916L_LVB_SHIFT		16
#define GFXMMU_LUT916L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut916l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT916L_FVB_SHIFT		8
#define GFXMMU_LUT916L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut916l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT916L_EN Enable **/
#define GFXMMU_LUT916L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut916h LUT916H Graphic MMU LUT entry 916 high
@{*/


#define GFXMMU_LUT916H_LO_SHIFT		4
#define GFXMMU_LUT916H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut916h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut917l LUT917L Graphic MMU LUT entry 917 low
@{*/


#define GFXMMU_LUT917L_LVB_SHIFT		16
#define GFXMMU_LUT917L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut917l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT917L_FVB_SHIFT		8
#define GFXMMU_LUT917L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut917l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT917L_EN Enable **/
#define GFXMMU_LUT917L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut917h LUT917H Graphic MMU LUT entry 917 high
@{*/


#define GFXMMU_LUT917H_LO_SHIFT		4
#define GFXMMU_LUT917H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut917h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut918l LUT918L Graphic MMU LUT entry 918 low
@{*/


#define GFXMMU_LUT918L_LVB_SHIFT		16
#define GFXMMU_LUT918L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut918l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT918L_FVB_SHIFT		8
#define GFXMMU_LUT918L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut918l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT918L_EN Enable **/
#define GFXMMU_LUT918L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut918h LUT918H Graphic MMU LUT entry 918 high
@{*/


#define GFXMMU_LUT918H_LO_SHIFT		4
#define GFXMMU_LUT918H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut918h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut919l LUT919L Graphic MMU LUT entry 919 low
@{*/


#define GFXMMU_LUT919L_LVB_SHIFT		16
#define GFXMMU_LUT919L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut919l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT919L_FVB_SHIFT		8
#define GFXMMU_LUT919L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut919l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT919L_EN Enable **/
#define GFXMMU_LUT919L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut919h LUT919H Graphic MMU LUT entry 919 high
@{*/


#define GFXMMU_LUT919H_LO_SHIFT		4
#define GFXMMU_LUT919H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut919h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut920l LUT920L Graphic MMU LUT entry 920 low
@{*/


#define GFXMMU_LUT920L_LVB_SHIFT		16
#define GFXMMU_LUT920L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut920l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT920L_FVB_SHIFT		8
#define GFXMMU_LUT920L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut920l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT920L_EN Enable **/
#define GFXMMU_LUT920L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut920h LUT920H Graphic MMU LUT entry 920 high
@{*/


#define GFXMMU_LUT920H_LO_SHIFT		4
#define GFXMMU_LUT920H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut920h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut921l LUT921L Graphic MMU LUT entry 921 low
@{*/


#define GFXMMU_LUT921L_LVB_SHIFT		16
#define GFXMMU_LUT921L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut921l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT921L_FVB_SHIFT		8
#define GFXMMU_LUT921L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut921l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT921L_EN Enable **/
#define GFXMMU_LUT921L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut921h LUT921H Graphic MMU LUT entry 921 high
@{*/


#define GFXMMU_LUT921H_LO_SHIFT		4
#define GFXMMU_LUT921H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut921h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut922l LUT922L Graphic MMU LUT entry 922 low
@{*/


#define GFXMMU_LUT922L_LVB_SHIFT		16
#define GFXMMU_LUT922L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut922l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT922L_FVB_SHIFT		8
#define GFXMMU_LUT922L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut922l_fvb FVB First Valid Block
@{*/
/**@}*/

