grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT922L_EN Enable **/
#define GFXMMU_LUT922L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut922h LUT922H Graphic MMU LUT entry 922 high
@{*/


#define GFXMMU_LUT922H_LO_SHIFT		4
#define GFXMMU_LUT922H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut922h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut923l LUT923L Graphic MMU LUT entry 923 low
@{*/


#define GFXMMU_LUT923L_LVB_SHIFT		16
#define GFXMMU_LUT923L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut923l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT923L_FVB_SHIFT		8
#define GFXMMU_LUT923L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut923l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT923L_EN Enable **/
#define GFXMMU_LUT923L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut923h LUT923H Graphic MMU LUT entry 923 high
@{*/


#define GFXMMU_LUT923H_LO_SHIFT		4
#define GFXMMU_LUT923H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut923h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut924l LUT924L Graphic MMU LUT entry 924 low
@{*/


#define GFXMMU_LUT924L_LVB_SHIFT		16
#define GFXMMU_LUT924L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut924l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT924L_FVB_SHIFT		8
#define GFXMMU_LUT924L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut924l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT924L_EN Enable **/
#define GFXMMU_LUT924L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut924h LUT924H Graphic MMU LUT entry 924 high
@{*/


#define GFXMMU_LUT924H_LO_SHIFT		4
#define GFXMMU_LUT924H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut924h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut925l LUT925L Graphic MMU LUT entry 925 low
@{*/


#define GFXMMU_LUT925L_LVB_SHIFT		16
#define GFXMMU_LUT925L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut925l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT925L_FVB_SHIFT		8
#define GFXMMU_LUT925L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut925l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT925L_EN Enable **/
#define GFXMMU_LUT925L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut925h LUT925H Graphic MMU LUT entry 925 high
@{*/


#define GFXMMU_LUT925H_LO_SHIFT		4
#define GFXMMU_LUT925H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut925h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut926l LUT926L Graphic MMU LUT entry 926 low
@{*/


#define GFXMMU_LUT926L_LVB_SHIFT		16
#define GFXMMU_LUT926L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut926l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT926L_FVB_SHIFT		8
#define GFXMMU_LUT926L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut926l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT926L_EN Enable **/
#define GFXMMU_LUT926L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut926h LUT926H Graphic MMU LUT entry 926 high
@{*/


#define GFXMMU_LUT926H_LO_SHIFT		4
#define GFXMMU_LUT926H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut926h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut927l LUT927L Graphic MMU LUT entry 927 low
@{*/


#define GFXMMU_LUT927L_LVB_SHIFT		16
#define GFXMMU_LUT927L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut927l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT927L_FVB_SHIFT		8
#define GFXMMU_LUT927L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut927l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT927L_EN Enable **/
#define GFXMMU_LUT927L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut927h LUT927H Graphic MMU LUT entry 927 high
@{*/


#define GFXMMU_LUT927H_LO_SHIFT		4
#define GFXMMU_LUT927H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut927h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut928l LUT928L Graphic MMU LUT entry 928 low
@{*/


#define GFXMMU_LUT928L_LVB_SHIFT		16
#define GFXMMU_LUT928L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut928l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT928L_FVB_SHIFT		8
#define GFXMMU_LUT928L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut928l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT928L_EN Enable **/
#define GFXMMU_LUT928L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut928h LUT928H Graphic MMU LUT entry 928 high
@{*/


#define GFXMMU_LUT928H_LO_SHIFT		4
#define GFXMMU_LUT928H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut928h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut929l LUT929L Graphic MMU LUT entry 929 low
@{*/


#define GFXMMU_LUT929L_LVB_SHIFT		16
#define GFXMMU_LUT929L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut929l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT929L_FVB_SHIFT		8
#define GFXMMU_LUT929L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut929l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT929L_EN Enable **/
#define GFXMMU_LUT929L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut929h LUT929H Graphic MMU LUT entry 929 high
@{*/


#define GFXMMU_LUT929H_LO_SHIFT		4
#define GFXMMU_LUT929H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut929h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut930l LUT930L Graphic MMU LUT entry 930 low
@{*/


#define GFXMMU_LUT930L_LVB_SHIFT		16
#define GFXMMU_LUT930L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut930l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT930L_FVB_SHIFT		8
#define GFXMMU_LUT930L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut930l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT930L_EN Enable **/
#define GFXMMU_LUT930L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut930h LUT930H Graphic MMU LUT entry 930 high
@{*/


#define GFXMMU_LUT930H_LO_SHIFT		4
#define GFXMMU_LUT930H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut930h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut931l LUT931L Graphic MMU LUT entry 931 low
@{*/


#define GFXMMU_LUT931L_LVB_SHIFT		16
#define GFXMMU_LUT931L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut931l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT931L_FVB_SHIFT		8
#define GFXMMU_LUT931L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut931l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT931L_EN Enable **/
#define GFXMMU_LUT931L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut931h LUT931H Graphic MMU LUT entry 931 high
@{*/


#define GFXMMU_LUT931H_LO_SHIFT		4
#define GFXMMU_LUT931H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut931h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

