grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut932l LUT932L Graphic MMU LUT entry 932 low
@{*/


#define GFXMMU_LUT932L_LVB_SHIFT		16
#define GFXMMU_LUT932L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut932l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT932L_FVB_SHIFT		8
#define GFXMMU_LUT932L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut932l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT932L_EN Enable **/
#define GFXMMU_LUT932L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut932h LUT932H Graphic MMU LUT entry 932 high
@{*/


#define GFXMMU_LUT932H_LO_SHIFT		4
#define GFXMMU_LUT932H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut932h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut933l LUT933L Graphic MMU LUT entry 933 low
@{*/


#define GFXMMU_LUT933L_LVB_SHIFT		16
#define GFXMMU_LUT933L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut933l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT933L_FVB_SHIFT		8
#define GFXMMU_LUT933L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut933l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT933L_EN Enable **/
#define GFXMMU_LUT933L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut933h LUT933H Graphic MMU LUT entry 933 high
@{*/


#define GFXMMU_LUT933H_LO_SHIFT		4
#define GFXMMU_LUT933H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut933h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut934l LUT934L Graphic MMU LUT entry 934 low
@{*/


#define GFXMMU_LUT934L_LVB_SHIFT		16
#define GFXMMU_LUT934L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut934l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT934L_FVB_SHIFT		8
#define GFXMMU_LUT934L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut934l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT934L_EN Enable **/
#define GFXMMU_LUT934L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut934h LUT934H Graphic MMU LUT entry 934 high
@{*/


#define GFXMMU_LUT934H_LO_SHIFT		4
#define GFXMMU_LUT934H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut934h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut935l LUT935L Graphic MMU LUT entry 935 low
@{*/


#define GFXMMU_LUT935L_LVB_SHIFT		16
#define GFXMMU_LUT935L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut935l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT935L_FVB_SHIFT		8
#define GFXMMU_LUT935L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut935l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT935L_EN Enable **/
#define GFXMMU_LUT935L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut935h LUT935H Graphic MMU LUT entry 935 high
@{*/


#define GFXMMU_LUT935H_LO_SHIFT		4
#define GFXMMU_LUT935H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut935h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut936l LUT936L Graphic MMU LUT entry 936 low
@{*/


#define GFXMMU_LUT936L_LVB_SHIFT		16
#define GFXMMU_LUT936L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut936l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT936L_FVB_SHIFT		8
#define GFXMMU_LUT936L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut936l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT936L_EN Enable **/
#define GFXMMU_LUT936L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut936h LUT936H Graphic MMU LUT entry 936 high
@{*/


#define GFXMMU_LUT936H_LO_SHIFT		4
#define GFXMMU_LUT936H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut936h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut937l LUT937L Graphic MMU LUT entry 937 low
@{*/


#define GFXMMU_LUT937L_LVB_SHIFT		16
#define GFXMMU_LUT937L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut937l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT937L_FVB_SHIFT		8
#define GFXMMU_LUT937L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut937l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT937L_EN Enable **/
#define GFXMMU_LUT937L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut937h LUT937H Graphic MMU LUT entry 937 high
@{*/


#define GFXMMU_LUT937H_LO_SHIFT		4
#define GFXMMU_LUT937H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut937h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut938l LUT938L Graphic MMU LUT entry 938 low
@{*/


#define GFXMMU_LUT938L_LVB_SHIFT		16
#define GFXMMU_LUT938L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut938l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT938L_FVB_SHIFT		8
#define GFXMMU_LUT938L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut938l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT938L_EN Enable **/
#define GFXMMU_LUT938L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut938h LUT938H Graphic MMU LUT entry 938 high
@{*/


#define GFXMMU_LUT938H_LO_SHIFT		4
#define GFXMMU_LUT938H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut938h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut939l LUT939L Graphic MMU LUT entry 939 low
@{*/


#define GFXMMU_LUT939L_LVB_SHIFT		16
#define GFXMMU_LUT939L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut939l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT939L_FVB_SHIFT		8
#define GFXMMU_LUT939L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut939l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT939L_EN Enable **/
#define GFXMMU_LUT939L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut939h LUT939H Graphic MMU LUT entry 939 high
@{*/


#define GFXMMU_LUT939H_LO_SHIFT		4
#define GFXMMU_LUT939H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut939h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut940l LUT940L Graphic MMU LUT entry 940 low
@{*/


#define GFXMMU_LUT940L_LVB_SHIFT		16
#define GFXMMU_LUT940L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut940l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT940L_FVB_SHIFT		8
#define GFXMMU_LUT940L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut940l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT940L_EN Enable **/
#define GFXMMU_LUT940L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut940h LUT940H Graphic MMU LUT entry 940 high
@{*/


#define GFXMMU_LUT940H_LO_SHIFT		4
#define GFXMMU_LUT940H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut940h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut941l LUT941L Graphic MMU LUT entry 941 low
@{*/


#define GFXMMU_LUT941L_LVB_SHIFT		16
#define GFXMMU_LUT941L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut941l_lvb LVB Last Valid Block
@{*/
/**@}*/


