grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT941L_FVB_SHIFT		8
#define GFXMMU_LUT941L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut941l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT941L_EN Enable **/
#define GFXMMU_LUT941L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut941h LUT941H Graphic MMU LUT entry 941 high
@{*/


#define GFXMMU_LUT941H_LO_SHIFT		4
#define GFXMMU_LUT941H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut941h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut942l LUT942L Graphic MMU LUT entry 942 low
@{*/


#define GFXMMU_LUT942L_LVB_SHIFT		16
#define GFXMMU_LUT942L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut942l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT942L_FVB_SHIFT		8
#define GFXMMU_LUT942L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut942l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT942L_EN Enable **/
#define GFXMMU_LUT942L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut942h LUT942H Graphic MMU LUT entry 942 high
@{*/


#define GFXMMU_LUT942H_LO_SHIFT		4
#define GFXMMU_LUT942H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut942h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut943l LUT943L Graphic MMU LUT entry 943 low
@{*/


#define GFXMMU_LUT943L_LVB_SHIFT		16
#define GFXMMU_LUT943L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut943l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT943L_FVB_SHIFT		8
#define GFXMMU_LUT943L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut943l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT943L_EN Enable **/
#define GFXMMU_LUT943L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut943h LUT943H Graphic MMU LUT entry 943 high
@{*/


#define GFXMMU_LUT943H_LO_SHIFT		4
#define GFXMMU_LUT943H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut943h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut944l LUT944L Graphic MMU LUT entry 944 low
@{*/


#define GFXMMU_LUT944L_LVB_SHIFT		16
#define GFXMMU_LUT944L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut944l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT944L_FVB_SHIFT		8
#define GFXMMU_LUT944L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut944l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT944L_EN Enable **/
#define GFXMMU_LUT944L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut944h LUT944H Graphic MMU LUT entry 944 high
@{*/


#define GFXMMU_LUT944H_LO_SHIFT		4
#define GFXMMU_LUT944H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut944h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut945l LUT945L Graphic MMU LUT entry 945 low
@{*/


#define GFXMMU_LUT945L_LVB_SHIFT		16
#define GFXMMU_LUT945L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut945l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT945L_FVB_SHIFT		8
#define GFXMMU_LUT945L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut945l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT945L_EN Enable **/
#define GFXMMU_LUT945L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut945h LUT945H Graphic MMU LUT entry 945 high
@{*/


#define GFXMMU_LUT945H_LO_SHIFT		4
#define GFXMMU_LUT945H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut945h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut946l LUT946L Graphic MMU LUT entry 946 low
@{*/


#define GFXMMU_LUT946L_LVB_SHIFT		16
#define GFXMMU_LUT946L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut946l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT946L_FVB_SHIFT		8
#define GFXMMU_LUT946L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut946l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT946L_EN Enable **/
#define GFXMMU_LUT946L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut946h LUT946H Graphic MMU LUT entry 946 high
@{*/


#define GFXMMU_LUT946H_LO_SHIFT		4
#define GFXMMU_LUT946H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut946h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut947l LUT947L Graphic MMU LUT entry 947 low
@{*/


#define GFXMMU_LUT947L_LVB_SHIFT		16
#define GFXMMU_LUT947L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut947l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT947L_FVB_SHIFT		8
#define GFXMMU_LUT947L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut947l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT947L_EN Enable **/
#define GFXMMU_LUT947L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut947h LUT947H Graphic MMU LUT entry 947 high
@{*/


#define GFXMMU_LUT947H_LO_SHIFT		4
#define GFXMMU_LUT947H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut947h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut948l LUT948L Graphic MMU LUT entry 948 low
@{*/


#define GFXMMU_LUT948L_LVB_SHIFT		16
#define GFXMMU_LUT948L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut948l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT948L_FVB_SHIFT		8
#define GFXMMU_LUT948L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut948l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT948L_EN Enable **/
#define GFXMMU_LUT948L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut948h LUT948H Graphic MMU LUT entry 948 high
@{*/


#define GFXMMU_LUT948H_LO_SHIFT		4
#define GFXMMU_LUT948H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut948h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut949l LUT949L Graphic MMU LUT entry 949 low
@{*/


#define GFXMMU_LUT949L_LVB_SHIFT		16
#define GFXMMU_LUT949L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut949l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT949L_FVB_SHIFT		8
#define GFXMMU_LUT949L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut949l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT949L_EN Enable **/
#define GFXMMU_LUT949L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut949h LUT949H Graphic MMU LUT entry 949 high
@{*/


#define GFXMMU_LUT949H_LO_SHIFT		4
#define GFXMMU_LUT949H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut949h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut950l LUT950L Graphic MMU LUT entry 950 low
@{*/


#define GFXMMU_LUT950L_LVB_SHIFT		16
#define GFXMMU_LUT950L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut950l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT950L_FVB_SHIFT		8
#define GFXMMU_LUT950L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut950l_fvb FVB First Valid Block
@{*/
/**@}*/

