grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT950L_EN Enable **/
#define GFXMMU_LUT950L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut950h LUT950H Graphic MMU LUT entry 950 high
@{*/


#define GFXMMU_LUT950H_LO_SHIFT		4
#define GFXMMU_LUT950H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut950h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut951l LUT951L Graphic MMU LUT entry 951 low
@{*/


#define GFXMMU_LUT951L_LVB_SHIFT		16
#define GFXMMU_LUT951L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut951l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT951L_FVB_SHIFT		8
#define GFXMMU_LUT951L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut951l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT951L_EN Enable **/
#define GFXMMU_LUT951L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut951h LUT951H Graphic MMU LUT entry 951 high
@{*/


#define GFXMMU_LUT951H_LO_SHIFT		4
#define GFXMMU_LUT951H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut951h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut952l LUT952L Graphic MMU LUT entry 952 low
@{*/


#define GFXMMU_LUT952L_LVB_SHIFT		16
#define GFXMMU_LUT952L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut952l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT952L_FVB_SHIFT		8
#define GFXMMU_LUT952L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut952l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT952L_EN Enable **/
#define GFXMMU_LUT952L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut952h LUT952H Graphic MMU LUT entry 952 high
@{*/


#define GFXMMU_LUT952H_LO_SHIFT		4
#define GFXMMU_LUT952H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut952h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut953l LUT953L Graphic MMU LUT entry 953 low
@{*/


#define GFXMMU_LUT953L_LVB_SHIFT		16
#define GFXMMU_LUT953L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut953l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT953L_FVB_SHIFT		8
#define GFXMMU_LUT953L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut953l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT953L_EN Enable **/
#define GFXMMU_LUT953L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut953h LUT953H Graphic MMU LUT entry 953 high
@{*/


#define GFXMMU_LUT953H_LO_SHIFT		4
#define GFXMMU_LUT953H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut953h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut954l LUT954L Graphic MMU LUT entry 954 low
@{*/


#define GFXMMU_LUT954L_LVB_SHIFT		16
#define GFXMMU_LUT954L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut954l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT954L_FVB_SHIFT		8
#define GFXMMU_LUT954L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut954l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT954L_EN Enable **/
#define GFXMMU_LUT954L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut954h LUT954H Graphic MMU LUT entry 954 high
@{*/


#define GFXMMU_LUT954H_LO_SHIFT		4
#define GFXMMU_LUT954H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut954h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut955l LUT955L Graphic MMU LUT entry 955 low
@{*/


#define GFXMMU_LUT955L_LVB_SHIFT		16
#define GFXMMU_LUT955L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut955l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT955L_FVB_SHIFT		8
#define GFXMMU_LUT955L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut955l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT955L_EN Enable **/
#define GFXMMU_LUT955L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut955h LUT955H Graphic MMU LUT entry 955 high
@{*/


#define GFXMMU_LUT955H_LO_SHIFT		4
#define GFXMMU_LUT955H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut955h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut956l LUT956L Graphic MMU LUT entry 956 low
@{*/


#define GFXMMU_LUT956L_LVB_SHIFT		16
#define GFXMMU_LUT956L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut956l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT956L_FVB_SHIFT		8
#define GFXMMU_LUT956L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut956l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT956L_EN Enable **/
#define GFXMMU_LUT956L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut956h LUT956H Graphic MMU LUT entry 956 high
@{*/


#define GFXMMU_LUT956H_LO_SHIFT		4
#define GFXMMU_LUT956H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut956h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut957l LUT957L Graphic MMU LUT entry 957 low
@{*/


#define GFXMMU_LUT957L_LVB_SHIFT		16
#define GFXMMU_LUT957L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut957l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT957L_FVB_SHIFT		8
#define GFXMMU_LUT957L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut957l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT957L_EN Enable **/
#define GFXMMU_LUT957L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut957h LUT957H Graphic MMU LUT entry 957 high
@{*/


#define GFXMMU_LUT957H_LO_SHIFT		4
#define GFXMMU_LUT957H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut957h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut958l LUT958L Graphic MMU LUT entry 958 low
@{*/


#define GFXMMU_LUT958L_LVB_SHIFT		16
#define GFXMMU_LUT958L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut958l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT958L_FVB_SHIFT		8
#define GFXMMU_LUT958L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut958l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT958L_EN Enable **/
#define GFXMMU_LUT958L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut958h LUT958H Graphic MMU LUT entry 958 high
@{*/


#define GFXMMU_LUT958H_LO_SHIFT		4
#define GFXMMU_LUT958H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut958h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut959l LUT959L Graphic MMU LUT entry 959 low
@{*/


#define GFXMMU_LUT959L_LVB_SHIFT		16
#define GFXMMU_LUT959L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut959l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT959L_FVB_SHIFT		8
#define GFXMMU_LUT959L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut959l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT959L_EN Enable **/
#define GFXMMU_LUT959L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut959h LUT959H Graphic MMU LUT entry 959 high
@{*/


#define GFXMMU_LUT959H_LO_SHIFT		4
#define GFXMMU_LUT959H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut959h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut960l LUT960L Graphic MMU LUT entry 960 low
@{*/


#define GFXMMU_LUT960L_LVB_SHIFT		16
#define GFXMMU_LUT960L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut960l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT960L_FVB_SHIFT		8
#define GFXMMU_LUT960L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut960l_fvb FVB First Valid Block
@{*/
/**@}*/

