grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT960L_EN Enable **/
#define GFXMMU_LUT960L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut960h LUT960H Graphic MMU LUT entry 960 high
@{*/


#define GFXMMU_LUT960H_LO_SHIFT		4
#define GFXMMU_LUT960H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut960h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut961l LUT961L Graphic MMU LUT entry 961 low
@{*/


#define GFXMMU_LUT961L_LVB_SHIFT		16
#define GFXMMU_LUT961L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut961l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT961L_FVB_SHIFT		8
#define GFXMMU_LUT961L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut961l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT961L_EN Enable **/
#define GFXMMU_LUT961L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut961h LUT961H Graphic MMU LUT entry 961 high
@{*/


#define GFXMMU_LUT961H_LO_SHIFT		4
#define GFXMMU_LUT961H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut961h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut962l LUT962L Graphic MMU LUT entry 962 low
@{*/


#define GFXMMU_LUT962L_LVB_SHIFT		16
#define GFXMMU_LUT962L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut962l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT962L_FVB_SHIFT		8
#define GFXMMU_LUT962L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut962l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT962L_EN Enable **/
#define GFXMMU_LUT962L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut962h LUT962H Graphic MMU LUT entry 962 high
@{*/


#define GFXMMU_LUT962H_LO_SHIFT		4
#define GFXMMU_LUT962H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut962h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut963l LUT963L Graphic MMU LUT entry 963 low
@{*/


#define GFXMMU_LUT963L_LVB_SHIFT		16
#define GFXMMU_LUT963L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut963l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT963L_FVB_SHIFT		8
#define GFXMMU_LUT963L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut963l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT963L_EN Enable **/
#define GFXMMU_LUT963L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut963h LUT963H Graphic MMU LUT entry 963 high
@{*/


#define GFXMMU_LUT963H_LO_SHIFT		4
#define GFXMMU_LUT963H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut963h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut964l LUT964L Graphic MMU LUT entry 964 low
@{*/


#define GFXMMU_LUT964L_LVB_SHIFT		16
#define GFXMMU_LUT964L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut964l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT964L_FVB_SHIFT		8
#define GFXMMU_LUT964L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut964l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT964L_EN Enable **/
#define GFXMMU_LUT964L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut964h LUT964H Graphic MMU LUT entry 964 high
@{*/


#define GFXMMU_LUT964H_LO_SHIFT		4
#define GFXMMU_LUT964H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut964h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut965l LUT965L Graphic MMU LUT entry 965 low
@{*/


#define GFXMMU_LUT965L_LVB_SHIFT		16
#define GFXMMU_LUT965L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut965l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT965L_FVB_SHIFT		8
#define GFXMMU_LUT965L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut965l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT965L_EN Enable **/
#define GFXMMU_LUT965L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut965h LUT965H Graphic MMU LUT entry 965 high
@{*/


#define GFXMMU_LUT965H_LO_SHIFT		4
#define GFXMMU_LUT965H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut965h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut966l LUT966L Graphic MMU LUT entry 966 low
@{*/


#define GFXMMU_LUT966L_LVB_SHIFT		16
#define GFXMMU_LUT966L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut966l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT966L_FVB_SHIFT		8
#define GFXMMU_LUT966L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut966l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT966L_EN Enable **/
#define GFXMMU_LUT966L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut966h LUT966H Graphic MMU LUT entry 966 high
@{*/


#define GFXMMU_LUT966H_LO_SHIFT		4
#define GFXMMU_LUT966H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut966h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut967l LUT967L Graphic MMU LUT entry 967 low
@{*/


#define GFXMMU_LUT967L_LVB_SHIFT		16
#define GFXMMU_LUT967L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut967l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT967L_FVB_SHIFT		8
#define GFXMMU_LUT967L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut967l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT967L_EN Enable **/
#define GFXMMU_LUT967L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut967h LUT967H Graphic MMU LUT entry 967 high
@{*/


#define GFXMMU_LUT967H_LO_SHIFT		4
#define GFXMMU_LUT967H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut967h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut968l LUT968L Graphic MMU LUT entry 968 low
@{*/


#define GFXMMU_LUT968L_LVB_SHIFT		16
#define GFXMMU_LUT968L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut968l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT968L_FVB_SHIFT		8
#define GFXMMU_LUT968L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut968l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT968L_EN Enable **/
#define GFXMMU_LUT968L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut968h LUT968H Graphic MMU LUT entry 968 high
@{*/


#define GFXMMU_LUT968H_LO_SHIFT		4
#define GFXMMU_LUT968H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut968h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut969l LUT969L Graphic MMU LUT entry 969 low
@{*/


#define GFXMMU_LUT969L_LVB_SHIFT		16
#define GFXMMU_LUT969L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut969l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT969L_FVB_SHIFT		8
#define GFXMMU_LUT969L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut969l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT969L_EN Enable **/
#define GFXMMU_LUT969L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut969h LUT969H Graphic MMU LUT entry 969 high
@{*/


#define GFXMMU_LUT969H_LO_SHIFT		4
#define GFXMMU_LUT969H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut969h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut970l LUT970L Graphic MMU LUT entry 970 low
@{*/


