grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT970L_LVB_SHIFT		16
#define GFXMMU_LUT970L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut970l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT970L_FVB_SHIFT		8
#define GFXMMU_LUT970L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut970l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT970L_EN Enable **/
#define GFXMMU_LUT970L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut970h LUT970H Graphic MMU LUT entry 970 high
@{*/


#define GFXMMU_LUT970H_LO_SHIFT		4
#define GFXMMU_LUT970H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut970h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut971l LUT971L Graphic MMU LUT entry 971 low
@{*/


#define GFXMMU_LUT971L_LVB_SHIFT		16
#define GFXMMU_LUT971L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut971l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT971L_FVB_SHIFT		8
#define GFXMMU_LUT971L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut971l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT971L_EN Enable **/
#define GFXMMU_LUT971L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut971h LUT971H Graphic MMU LUT entry 971 high
@{*/


#define GFXMMU_LUT971H_LO_SHIFT		4
#define GFXMMU_LUT971H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut971h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut972l LUT972L Graphic MMU LUT entry 972 low
@{*/


#define GFXMMU_LUT972L_LVB_SHIFT		16
#define GFXMMU_LUT972L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut972l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT972L_FVB_SHIFT		8
#define GFXMMU_LUT972L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut972l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT972L_EN Enable **/
#define GFXMMU_LUT972L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut972h LUT972H Graphic MMU LUT entry 972 high
@{*/


#define GFXMMU_LUT972H_LO_SHIFT		4
#define GFXMMU_LUT972H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut972h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut973l LUT973L Graphic MMU LUT entry 973 low
@{*/


#define GFXMMU_LUT973L_LVB_SHIFT		16
#define GFXMMU_LUT973L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut973l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT973L_FVB_SHIFT		8
#define GFXMMU_LUT973L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut973l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT973L_EN Enable **/
#define GFXMMU_LUT973L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut973h LUT973H Graphic MMU LUT entry 973 high
@{*/


#define GFXMMU_LUT973H_LO_SHIFT		4
#define GFXMMU_LUT973H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut973h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut974l LUT974L Graphic MMU LUT entry 974 low
@{*/


#define GFXMMU_LUT974L_LVB_SHIFT		16
#define GFXMMU_LUT974L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut974l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT974L_FVB_SHIFT		8
#define GFXMMU_LUT974L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut974l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT974L_EN Enable **/
#define GFXMMU_LUT974L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut974h LUT974H Graphic MMU LUT entry 974 high
@{*/


#define GFXMMU_LUT974H_LO_SHIFT		4
#define GFXMMU_LUT974H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut974h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut975l LUT975L Graphic MMU LUT entry 975 low
@{*/


#define GFXMMU_LUT975L_LVB_SHIFT		16
#define GFXMMU_LUT975L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut975l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT975L_FVB_SHIFT		8
#define GFXMMU_LUT975L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut975l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT975L_EN Enable **/
#define GFXMMU_LUT975L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut975h LUT975H Graphic MMU LUT entry 975 high
@{*/


#define GFXMMU_LUT975H_LO_SHIFT		4
#define GFXMMU_LUT975H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut975h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut976l LUT976L Graphic MMU LUT entry 976 low
@{*/


#define GFXMMU_LUT976L_LVB_SHIFT		16
#define GFXMMU_LUT976L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut976l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT976L_FVB_SHIFT		8
#define GFXMMU_LUT976L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut976l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT976L_EN Enable **/
#define GFXMMU_LUT976L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut976h LUT976H Graphic MMU LUT entry 976 high
@{*/


#define GFXMMU_LUT976H_LO_SHIFT		4
#define GFXMMU_LUT976H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut976h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut977l LUT977L Graphic MMU LUT entry 977 low
@{*/


#define GFXMMU_LUT977L_LVB_SHIFT		16
#define GFXMMU_LUT977L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut977l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT977L_FVB_SHIFT		8
#define GFXMMU_LUT977L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut977l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT977L_EN Enable **/
#define GFXMMU_LUT977L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut977h LUT977H Graphic MMU LUT entry 977 high
@{*/


#define GFXMMU_LUT977H_LO_SHIFT		4
#define GFXMMU_LUT977H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut977h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut978l LUT978L Graphic MMU LUT entry 978 low
@{*/


#define GFXMMU_LUT978L_LVB_SHIFT		16
#define GFXMMU_LUT978L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut978l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT978L_FVB_SHIFT		8
#define GFXMMU_LUT978L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut978l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT978L_EN Enable **/
#define GFXMMU_LUT978L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut978h LUT978H Graphic MMU LUT entry 978 high
@{*/


#define GFXMMU_LUT978H_LO_SHIFT		4
#define GFXMMU_LUT978H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut978h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut979l LUT979L Graphic MMU LUT entry 979 low
@{*/


#define GFXMMU_LUT979L_LVB_SHIFT		16
#define GFXMMU_LUT979L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut979l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT979L_FVB_SHIFT		8
#define GFXMMU_LUT979L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut979l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT979L_EN Enable **/
#define GFXMMU_LUT979L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut979h LUT979H Graphic MMU LUT entry 979 high
@{*/


#define GFXMMU_LUT979H_LO_SHIFT		4
#define GFXMMU_LUT979H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut979h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut980l LUT980L Graphic MMU LUT entry 980 low
@{*/


#define GFXMMU_LUT980L_LVB_SHIFT		16
#define GFXMMU_LUT980L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut980l_lvb LVB Last Valid Block
@{*/
/**@}*/


