grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT980L_FVB_SHIFT		8
#define GFXMMU_LUT980L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut980l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT980L_EN Enable **/
#define GFXMMU_LUT980L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut980h LUT980H Graphic MMU LUT entry 980 high
@{*/


#define GFXMMU_LUT980H_LO_SHIFT		4
#define GFXMMU_LUT980H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut980h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut981l LUT981L Graphic MMU LUT entry 981 low
@{*/


#define GFXMMU_LUT981L_LVB_SHIFT		16
#define GFXMMU_LUT981L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut981l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT981L_FVB_SHIFT		8
#define GFXMMU_LUT981L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut981l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT981L_EN Enable **/
#define GFXMMU_LUT981L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut981h LUT981H Graphic MMU LUT entry 981 high
@{*/


#define GFXMMU_LUT981H_LO_SHIFT		4
#define GFXMMU_LUT981H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut981h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut982l LUT982L Graphic MMU LUT entry 982 low
@{*/


#define GFXMMU_LUT982L_LVB_SHIFT		16
#define GFXMMU_LUT982L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut982l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT982L_FVB_SHIFT		8
#define GFXMMU_LUT982L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut982l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT982L_EN Enable **/
#define GFXMMU_LUT982L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut982h LUT982H Graphic MMU LUT entry 982 high
@{*/


#define GFXMMU_LUT982H_LO_SHIFT		4
#define GFXMMU_LUT982H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut982h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut983l LUT983L Graphic MMU LUT entry 983 low
@{*/


#define GFXMMU_LUT983L_LVB_SHIFT		16
#define GFXMMU_LUT983L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut983l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT983L_FVB_SHIFT		8
#define GFXMMU_LUT983L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut983l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT983L_EN Enable **/
#define GFXMMU_LUT983L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut983h LUT983H Graphic MMU LUT entry 983 high
@{*/


#define GFXMMU_LUT983H_LO_SHIFT		4
#define GFXMMU_LUT983H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut983h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut984l LUT984L Graphic MMU LUT entry 984 low
@{*/


#define GFXMMU_LUT984L_LVB_SHIFT		16
#define GFXMMU_LUT984L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut984l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT984L_FVB_SHIFT		8
#define GFXMMU_LUT984L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut984l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT984L_EN Enable **/
#define GFXMMU_LUT984L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut984h LUT984H Graphic MMU LUT entry 984 high
@{*/


#define GFXMMU_LUT984H_LO_SHIFT		4
#define GFXMMU_LUT984H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut984h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut985l LUT985L Graphic MMU LUT entry 985 low
@{*/


#define GFXMMU_LUT985L_LVB_SHIFT		16
#define GFXMMU_LUT985L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut985l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT985L_FVB_SHIFT		8
#define GFXMMU_LUT985L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut985l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT985L_EN Enable **/
#define GFXMMU_LUT985L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut985h LUT985H Graphic MMU LUT entry 985 high
@{*/


#define GFXMMU_LUT985H_LO_SHIFT		4
#define GFXMMU_LUT985H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut985h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut986l LUT986L Graphic MMU LUT entry 986 low
@{*/


#define GFXMMU_LUT986L_LVB_SHIFT		16
#define GFXMMU_LUT986L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut986l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT986L_FVB_SHIFT		8
#define GFXMMU_LUT986L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut986l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT986L_EN Enable **/
#define GFXMMU_LUT986L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut986h LUT986H Graphic MMU LUT entry 986 high
@{*/


#define GFXMMU_LUT986H_LO_SHIFT		4
#define GFXMMU_LUT986H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut986h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut987l LUT987L Graphic MMU LUT entry 987 low
@{*/


#define GFXMMU_LUT987L_LVB_SHIFT		16
#define GFXMMU_LUT987L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut987l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT987L_FVB_SHIFT		8
#define GFXMMU_LUT987L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut987l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT987L_EN Enable **/
#define GFXMMU_LUT987L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut987h LUT987H Graphic MMU LUT entry 987 high
@{*/


#define GFXMMU_LUT987H_LO_SHIFT		4
#define GFXMMU_LUT987H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut987h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut988l LUT988L Graphic MMU LUT entry 988 low
@{*/


#define GFXMMU_LUT988L_LVB_SHIFT		16
#define GFXMMU_LUT988L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut988l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT988L_FVB_SHIFT		8
#define GFXMMU_LUT988L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut988l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT988L_EN Enable **/
#define GFXMMU_LUT988L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut988h LUT988H Graphic MMU LUT entry 988 high
@{*/


#define GFXMMU_LUT988H_LO_SHIFT		4
#define GFXMMU_LUT988H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut988h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut989l LUT989L Graphic MMU LUT entry 989 low
@{*/


#define GFXMMU_LUT989L_LVB_SHIFT		16
#define GFXMMU_LUT989L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut989l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT989L_FVB_SHIFT		8
#define GFXMMU_LUT989L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut989l_fvb FVB First Valid Block
@{*/
/**@}*/

