grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** GFXMMU_LUT989L_EN Enable **/
#define GFXMMU_LUT989L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut989h LUT989H Graphic MMU LUT entry 989 high
@{*/


#define GFXMMU_LUT989H_LO_SHIFT		4
#define GFXMMU_LUT989H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut989h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut990l LUT990L Graphic MMU LUT entry 990 low
@{*/


#define GFXMMU_LUT990L_LVB_SHIFT		16
#define GFXMMU_LUT990L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut990l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT990L_FVB_SHIFT		8
#define GFXMMU_LUT990L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut990l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT990L_EN Enable **/
#define GFXMMU_LUT990L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut990h LUT990H Graphic MMU LUT entry 990 high
@{*/


#define GFXMMU_LUT990H_LO_SHIFT		4
#define GFXMMU_LUT990H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut990h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut991l LUT991L Graphic MMU LUT entry 991 low
@{*/


#define GFXMMU_LUT991L_LVB_SHIFT		16
#define GFXMMU_LUT991L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut991l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT991L_FVB_SHIFT		8
#define GFXMMU_LUT991L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut991l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT991L_EN Enable **/
#define GFXMMU_LUT991L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut991h LUT991H Graphic MMU LUT entry 991 high
@{*/


#define GFXMMU_LUT991H_LO_SHIFT		4
#define GFXMMU_LUT991H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut991h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut992l LUT992L Graphic MMU LUT entry 992 low
@{*/


#define GFXMMU_LUT992L_LVB_SHIFT		16
#define GFXMMU_LUT992L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut992l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT992L_FVB_SHIFT		8
#define GFXMMU_LUT992L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut992l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT992L_EN Enable **/
#define GFXMMU_LUT992L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut992h LUT992H Graphic MMU LUT entry 992 high
@{*/


#define GFXMMU_LUT992H_LO_SHIFT		4
#define GFXMMU_LUT992H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut992h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut993l LUT993L Graphic MMU LUT entry 993 low
@{*/


#define GFXMMU_LUT993L_LVB_SHIFT		16
#define GFXMMU_LUT993L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut993l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT993L_FVB_SHIFT		8
#define GFXMMU_LUT993L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut993l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT993L_EN Enable **/
#define GFXMMU_LUT993L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut993h LUT993H Graphic MMU LUT entry 993 high
@{*/


#define GFXMMU_LUT993H_LO_SHIFT		4
#define GFXMMU_LUT993H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut993h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut994l LUT994L Graphic MMU LUT entry 994 low
@{*/


#define GFXMMU_LUT994L_LVB_SHIFT		16
#define GFXMMU_LUT994L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut994l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT994L_FVB_SHIFT		8
#define GFXMMU_LUT994L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut994l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT994L_EN Enable **/
#define GFXMMU_LUT994L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut994h LUT994H Graphic MMU LUT entry 994 high
@{*/


#define GFXMMU_LUT994H_LO_SHIFT		4
#define GFXMMU_LUT994H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut994h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut995l LUT995L Graphic MMU LUT entry 995 low
@{*/


#define GFXMMU_LUT995L_LVB_SHIFT		16
#define GFXMMU_LUT995L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut995l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT995L_FVB_SHIFT		8
#define GFXMMU_LUT995L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut995l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT995L_EN Enable **/
#define GFXMMU_LUT995L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut995h LUT995H Graphic MMU LUT entry 995 high
@{*/


#define GFXMMU_LUT995H_LO_SHIFT		4
#define GFXMMU_LUT995H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut995h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut996l LUT996L Graphic MMU LUT entry 996 low
@{*/


#define GFXMMU_LUT996L_LVB_SHIFT		16
#define GFXMMU_LUT996L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut996l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT996L_FVB_SHIFT		8
#define GFXMMU_LUT996L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut996l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT996L_EN Enable **/
#define GFXMMU_LUT996L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut996h LUT996H Graphic MMU LUT entry 996 high
@{*/


#define GFXMMU_LUT996H_LO_SHIFT		4
#define GFXMMU_LUT996H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut996h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut997l LUT997L Graphic MMU LUT entry 997 low
@{*/


#define GFXMMU_LUT997L_LVB_SHIFT		16
#define GFXMMU_LUT997L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut997l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT997L_FVB_SHIFT		8
#define GFXMMU_LUT997L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut997l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT997L_EN Enable **/
#define GFXMMU_LUT997L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut997h LUT997H Graphic MMU LUT entry 997 high
@{*/


#define GFXMMU_LUT997H_LO_SHIFT		4
#define GFXMMU_LUT997H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut997h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut998l LUT998L Graphic MMU LUT entry 998 low
@{*/


#define GFXMMU_LUT998L_LVB_SHIFT		16
#define GFXMMU_LUT998L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut998l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT998L_FVB_SHIFT		8
#define GFXMMU_LUT998L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut998l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT998L_EN Enable **/
#define GFXMMU_LUT998L_EN		(1 << 0)

/**@}*/

