grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut998h LUT998H Graphic MMU LUT entry 998 high
@{*/


#define GFXMMU_LUT998H_LO_SHIFT		4
#define GFXMMU_LUT998H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut998h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut999l LUT999L Graphic MMU LUT entry 999 low
@{*/


#define GFXMMU_LUT999L_LVB_SHIFT		16
#define GFXMMU_LUT999L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut999l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT999L_FVB_SHIFT		8
#define GFXMMU_LUT999L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut999l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT999L_EN Enable **/
#define GFXMMU_LUT999L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut999h LUT999H Graphic MMU LUT entry 999 high
@{*/


#define GFXMMU_LUT999H_LO_SHIFT		4
#define GFXMMU_LUT999H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut999h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1000l LUT1000L Graphic MMU LUT entry 1000 low
@{*/


#define GFXMMU_LUT1000L_LVB_SHIFT		16
#define GFXMMU_LUT1000L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1000l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1000L_FVB_SHIFT		8
#define GFXMMU_LUT1000L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1000l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1000L_EN Enable **/
#define GFXMMU_LUT1000L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1000h LUT1000H Graphic MMU LUT entry 1000 high
@{*/


#define GFXMMU_LUT1000H_LO_SHIFT		4
#define GFXMMU_LUT1000H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1000h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1001l LUT1001L Graphic MMU LUT entry 1001 low
@{*/


#define GFXMMU_LUT1001L_LVB_SHIFT		16
#define GFXMMU_LUT1001L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1001l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1001L_FVB_SHIFT		8
#define GFXMMU_LUT1001L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1001l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1001L_EN Enable **/
#define GFXMMU_LUT1001L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1001h LUT1001H Graphic MMU LUT entry 1001 high
@{*/


#define GFXMMU_LUT1001H_LO_SHIFT		4
#define GFXMMU_LUT1001H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1001h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1002l LUT1002L Graphic MMU LUT entry 1002 low
@{*/


#define GFXMMU_LUT1002L_LVB_SHIFT		16
#define GFXMMU_LUT1002L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1002l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1002L_FVB_SHIFT		8
#define GFXMMU_LUT1002L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1002l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1002L_EN Enable **/
#define GFXMMU_LUT1002L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1002h LUT1002H Graphic MMU LUT entry 1002 high
@{*/


#define GFXMMU_LUT1002H_LO_SHIFT		4
#define GFXMMU_LUT1002H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1002h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1003l LUT1003L Graphic MMU LUT entry 1003 low
@{*/


#define GFXMMU_LUT1003L_LVB_SHIFT		16
#define GFXMMU_LUT1003L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1003l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1003L_FVB_SHIFT		8
#define GFXMMU_LUT1003L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1003l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1003L_EN Enable **/
#define GFXMMU_LUT1003L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1003h LUT1003H Graphic MMU LUT entry 1003 high
@{*/


#define GFXMMU_LUT1003H_LO_SHIFT		4
#define GFXMMU_LUT1003H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1003h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1004l LUT1004L Graphic MMU LUT entry 1004 low
@{*/


#define GFXMMU_LUT1004L_LVB_SHIFT		16
#define GFXMMU_LUT1004L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1004l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1004L_FVB_SHIFT		8
#define GFXMMU_LUT1004L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1004l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1004L_EN Enable **/
#define GFXMMU_LUT1004L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1004h LUT1004H Graphic MMU LUT entry 1004 high
@{*/


#define GFXMMU_LUT1004H_LO_SHIFT		4
#define GFXMMU_LUT1004H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1004h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1005l LUT1005L Graphic MMU LUT entry 1005 low
@{*/


#define GFXMMU_LUT1005L_LVB_SHIFT		16
#define GFXMMU_LUT1005L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1005l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1005L_FVB_SHIFT		8
#define GFXMMU_LUT1005L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1005l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1005L_EN Enable **/
#define GFXMMU_LUT1005L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1005h LUT1005H Graphic MMU LUT entry 1005 high
@{*/


#define GFXMMU_LUT1005H_LO_SHIFT		4
#define GFXMMU_LUT1005H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1005h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1006l LUT1006L Graphic MMU LUT entry 1006 low
@{*/


#define GFXMMU_LUT1006L_LVB_SHIFT		16
#define GFXMMU_LUT1006L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1006l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1006L_FVB_SHIFT		8
#define GFXMMU_LUT1006L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1006l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1006L_EN Enable **/
#define GFXMMU_LUT1006L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1006h LUT1006H Graphic MMU LUT entry 1006 high
@{*/


#define GFXMMU_LUT1006H_LO_SHIFT		4
#define GFXMMU_LUT1006H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1006h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1007l LUT1007L Graphic MMU LUT entry 1007 low
@{*/


#define GFXMMU_LUT1007L_LVB_SHIFT		16
#define GFXMMU_LUT1007L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1007l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1007L_FVB_SHIFT		8
#define GFXMMU_LUT1007L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1007l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1007L_EN Enable **/
#define GFXMMU_LUT1007L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1007h LUT1007H Graphic MMU LUT entry 1007 high
@{*/


#define GFXMMU_LUT1007H_LO_SHIFT		4
#define GFXMMU_LUT1007H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1007h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1008l LUT1008L Graphic MMU LUT entry 1008 low
@{*/


