grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
#define GFXMMU_LUT1008L_LVB_SHIFT		16
#define GFXMMU_LUT1008L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1008l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1008L_FVB_SHIFT		8
#define GFXMMU_LUT1008L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1008l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1008L_EN Enable **/
#define GFXMMU_LUT1008L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1008h LUT1008H Graphic MMU LUT entry 1008 high
@{*/


#define GFXMMU_LUT1008H_LO_SHIFT		4
#define GFXMMU_LUT1008H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1008h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1009l LUT1009L Graphic MMU LUT entry 1009 low
@{*/


#define GFXMMU_LUT1009L_LVB_SHIFT		16
#define GFXMMU_LUT1009L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1009l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1009L_FVB_SHIFT		8
#define GFXMMU_LUT1009L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1009l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1009L_EN Enable **/
#define GFXMMU_LUT1009L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1009h LUT1009H Graphic MMU LUT entry 1009 high
@{*/


#define GFXMMU_LUT1009H_LO_SHIFT		4
#define GFXMMU_LUT1009H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1009h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1010l LUT1010L Graphic MMU LUT entry 1010 low
@{*/


#define GFXMMU_LUT1010L_LVB_SHIFT		16
#define GFXMMU_LUT1010L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1010l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1010L_FVB_SHIFT		8
#define GFXMMU_LUT1010L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1010l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1010L_EN Enable **/
#define GFXMMU_LUT1010L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1010h LUT1010H Graphic MMU LUT entry 1010 high
@{*/


#define GFXMMU_LUT1010H_LO_SHIFT		4
#define GFXMMU_LUT1010H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1010h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1011l LUT1011L Graphic MMU LUT entry 1011 low
@{*/


#define GFXMMU_LUT1011L_LVB_SHIFT		16
#define GFXMMU_LUT1011L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1011l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1011L_FVB_SHIFT		8
#define GFXMMU_LUT1011L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1011l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1011L_EN Enable **/
#define GFXMMU_LUT1011L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1011h LUT1011H Graphic MMU LUT entry 1011 high
@{*/


#define GFXMMU_LUT1011H_LO_SHIFT		4
#define GFXMMU_LUT1011H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1011h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1012l LUT1012L Graphic MMU LUT entry 1012 low
@{*/


#define GFXMMU_LUT1012L_LVB_SHIFT		16
#define GFXMMU_LUT1012L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1012l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1012L_FVB_SHIFT		8
#define GFXMMU_LUT1012L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1012l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1012L_EN Enable **/
#define GFXMMU_LUT1012L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1012h LUT1012H Graphic MMU LUT entry 1012 high
@{*/


#define GFXMMU_LUT1012H_LO_SHIFT		4
#define GFXMMU_LUT1012H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1012h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1013l LUT1013L Graphic MMU LUT entry 1013 low
@{*/


#define GFXMMU_LUT1013L_LVB_SHIFT		16
#define GFXMMU_LUT1013L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1013l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1013L_FVB_SHIFT		8
#define GFXMMU_LUT1013L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1013l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1013L_EN Enable **/
#define GFXMMU_LUT1013L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1013h LUT1013H Graphic MMU LUT entry 1013 high
@{*/


#define GFXMMU_LUT1013H_LO_SHIFT		4
#define GFXMMU_LUT1013H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1013h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1014l LUT1014L Graphic MMU LUT entry 1014 low
@{*/


#define GFXMMU_LUT1014L_LVB_SHIFT		16
#define GFXMMU_LUT1014L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1014l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1014L_FVB_SHIFT		8
#define GFXMMU_LUT1014L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1014l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1014L_EN Enable **/
#define GFXMMU_LUT1014L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1014h LUT1014H Graphic MMU LUT entry 1014 high
@{*/


#define GFXMMU_LUT1014H_LO_SHIFT		4
#define GFXMMU_LUT1014H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1014h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1015l LUT1015L Graphic MMU LUT entry 1015 low
@{*/


#define GFXMMU_LUT1015L_LVB_SHIFT		16
#define GFXMMU_LUT1015L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1015l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1015L_FVB_SHIFT		8
#define GFXMMU_LUT1015L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1015l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1015L_EN Enable **/
#define GFXMMU_LUT1015L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1015h LUT1015H Graphic MMU LUT entry 1015 high
@{*/


#define GFXMMU_LUT1015H_LO_SHIFT		4
#define GFXMMU_LUT1015H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1015h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1016l LUT1016L Graphic MMU LUT entry 1016 low
@{*/


#define GFXMMU_LUT1016L_LVB_SHIFT		16
#define GFXMMU_LUT1016L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1016l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1016L_FVB_SHIFT		8
#define GFXMMU_LUT1016L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1016l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1016L_EN Enable **/
#define GFXMMU_LUT1016L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1016h LUT1016H Graphic MMU LUT entry 1016 high
@{*/


#define GFXMMU_LUT1016H_LO_SHIFT		4
#define GFXMMU_LUT1016H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1016h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

