grevaillot/svd_tools/headers/STM32L4S7/gfxmmu.h
/** @defgroup gfxmmu_lut1017l LUT1017L Graphic MMU LUT entry 1017 low
@{*/


#define GFXMMU_LUT1017L_LVB_SHIFT		16
#define GFXMMU_LUT1017L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1017l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1017L_FVB_SHIFT		8
#define GFXMMU_LUT1017L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1017l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1017L_EN Enable **/
#define GFXMMU_LUT1017L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1017h LUT1017H Graphic MMU LUT entry 1017 high
@{*/


#define GFXMMU_LUT1017H_LO_SHIFT		4
#define GFXMMU_LUT1017H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1017h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1018l LUT1018L Graphic MMU LUT entry 1018 low
@{*/


#define GFXMMU_LUT1018L_LVB_SHIFT		16
#define GFXMMU_LUT1018L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1018l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1018L_FVB_SHIFT		8
#define GFXMMU_LUT1018L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1018l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1018L_EN Enable **/
#define GFXMMU_LUT1018L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1018h LUT1018H Graphic MMU LUT entry 1018 high
@{*/


#define GFXMMU_LUT1018H_LO_SHIFT		4
#define GFXMMU_LUT1018H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1018h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1019l LUT1019L Graphic MMU LUT entry 1019 low
@{*/


#define GFXMMU_LUT1019L_LVB_SHIFT		16
#define GFXMMU_LUT1019L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1019l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1019L_FVB_SHIFT		8
#define GFXMMU_LUT1019L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1019l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1019L_EN Enable **/
#define GFXMMU_LUT1019L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1019h LUT1019H Graphic MMU LUT entry 1019 high
@{*/


#define GFXMMU_LUT1019H_LO_SHIFT		4
#define GFXMMU_LUT1019H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1019h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1020l LUT1020L Graphic MMU LUT entry 1020 low
@{*/


#define GFXMMU_LUT1020L_LVB_SHIFT		16
#define GFXMMU_LUT1020L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1020l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1020L_FVB_SHIFT		8
#define GFXMMU_LUT1020L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1020l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1020L_EN Enable **/
#define GFXMMU_LUT1020L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1020h LUT1020H Graphic MMU LUT entry 1020 high
@{*/


#define GFXMMU_LUT1020H_LO_SHIFT		4
#define GFXMMU_LUT1020H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1020h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1021l LUT1021L Graphic MMU LUT entry 1021 low
@{*/


#define GFXMMU_LUT1021L_LVB_SHIFT		16
#define GFXMMU_LUT1021L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1021l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1021L_FVB_SHIFT		8
#define GFXMMU_LUT1021L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1021l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1021L_EN Enable **/
#define GFXMMU_LUT1021L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1021h LUT1021H Graphic MMU LUT entry 1021 high
@{*/


#define GFXMMU_LUT1021H_LO_SHIFT		4
#define GFXMMU_LUT1021H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1021h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1022l LUT1022L Graphic MMU LUT entry 1022 low
@{*/


#define GFXMMU_LUT1022L_LVB_SHIFT		16
#define GFXMMU_LUT1022L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1022l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1022L_FVB_SHIFT		8
#define GFXMMU_LUT1022L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1022l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1022L_EN Enable **/
#define GFXMMU_LUT1022L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1022h LUT1022H Graphic MMU LUT entry 1022 high
@{*/


#define GFXMMU_LUT1022H_LO_SHIFT		4
#define GFXMMU_LUT1022H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1022h_lo LO Line offset
@{*/
/**@}*/


/**@}*/

/** @defgroup gfxmmu_lut1023l LUT1023L Graphic MMU LUT entry 1023 low
@{*/


#define GFXMMU_LUT1023L_LVB_SHIFT		16
#define GFXMMU_LUT1023L_LVB_MASK		0xff
/** @defgroup gfxmmu_lut1023l_lvb LVB Last Valid Block
@{*/
/**@}*/


#define GFXMMU_LUT1023L_FVB_SHIFT		8
#define GFXMMU_LUT1023L_FVB_MASK		0xff
/** @defgroup gfxmmu_lut1023l_fvb FVB First Valid Block
@{*/
/**@}*/

/** GFXMMU_LUT1023L_EN Enable **/
#define GFXMMU_LUT1023L_EN		(1 << 0)

/**@}*/

/** @defgroup gfxmmu_lut1023h LUT1023H Graphic MMU LUT entry 1023 high
@{*/


#define GFXMMU_LUT1023H_LO_SHIFT		4
#define GFXMMU_LUT1023H_LO_MASK		0x3ffff
/** @defgroup gfxmmu_lut1023h_lo LO Line offset
@{*/
/**@}*/


/**@}*/
